[{"name":"Zack Brown","email":"zackdangerbrown@gmail.com","avatar":"https://secure.gravatar.com/avatar/96a42fc088260ad04bcc911ec6e26c38?s=500","location":"Columbus, Ohio","bio":"Software developer. Cookbook author. Crowdfunded a potato salad on Kickstarter. Co-founder of Root (www.joinroot.com) and Base Two (www.base2.io).","twitter":"ztbrown","url":"https://github.com/ztbrown","organization":"Pillar Technology","shirt_size":"Men's L","title":"Intro to Mocking Unit Test Dependencies","abstract":"In this talk, I cover unit test isolation and why it’s important, introduce mocking as a solution, show examples of mocking in popular programming languages, including a quick example of link-time interpositioning in C.","description":"Unit tests must exist in isolation. This is easier said than done. Your code may have many dependencies, depend on a long running process or on system calls. If we fail to address these issues, our tests will run slower, be less reliable and will make CI / CD a challenge. In order to test this code in isolation, we need to replace real objects and functions with our own implementations. This is called Mocking.\r\n\r\nIn this session, we will talk about the value of unit testing in isolation and strategies for isolating unit tests in Ruby and C by using both established frameworks and rolling our own mocks.","notes":"","audience_level":"Intermediate","tag_list":["testing"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-07-12T13:47:01.637Z"},{"name":"Ieva Valbaka on behalf of Uldis Karlovs-Karlovskis","email":"ievavalbaka@inbox.lv","avatar":"https://secure.gravatar.com/avatar/e12073c080b79e501c0d8c7c0b2af804?s=500","location":"Latvia","bio":"-I’ve been DevOps in some way since I was 12. Now it’s been almost 20 years applying it at everything I do.\r\nWhen I’m tired running “sprints”, I go out and evangelize to make DevOps more popular!\r\n\r\n\r\n","twitter":"nrciam","url":"https://www.linkedin.com/in/uldiskarlovskarlovskis","organization":"Accenture Latvia, devops.lv","shirt_size":"Men's L","title":" One DevOps platform for IT and Business - is that even possible?","abstract":"In our talk, we’ll explain what is DevOps platform and why every software company needs it. We’ll also show some practical hints on how to sell it to management.","description":"Can you imagine how many people again and again install same DevOps tools and configure similar pipelines over and over again?\r\nLet us introduce you to ADOP - the DevOps platform. It’s a framework which glues together suite of open-source DevOps tools and provides extremely quick way of mobilizing software development projects in a consistent way. It’s open-source and available on Github. The platform can be installed even on a laptop as well as on AWS, Azure etc. ADOP supports different programming languages or you can just run your Ops department on it. We truly believe it’s a must-have for any software company.\r\nHaving such platform in IT brings great value for any software business but sometimes it’s not that clear to management or Business people. So we’ll also show some do’s and don’ts on how to explain and sell it to them. ","notes":"Projector for slides. Audio.\r\nThis is duo-presentation by two speakers - Arturs Kovalenko and Uldis Karlovs-Karlovskis.\r\n\r\nWe love DevOps and ADOP! Most of the time we spend on AWS, Docker, Jenkins, Groovy etc. to make ADOP better. When we’re tired running sprints, we go out and evangelize to make DevOps and ADOP more popular!\r\n","audience_level":"Intermediate","tag_list":["devops","devops platform","devops tools","docker adop"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-07-12T12:26:04.250Z"},{"name":"Ieva Valbaka on behalf of Uldis Karlovs-Karlovskis","email":"ievavalbaka@inbox.lv","avatar":"https://secure.gravatar.com/avatar/e12073c080b79e501c0d8c7c0b2af804?s=500","location":"Latvia","bio":"-I’ve been DevOps in some way since I was 12. Now it’s been almost 20 years applying it at everything I do.\r\nWhen I’m tired running “sprints”, I go out and evangelize to make DevOps more popular!\r\n\r\nhttps://www.youtube.com/watch?v=6m9oGoqB9rk\r\n\r\n","twitter":"nrciam","url":"https://www.linkedin.com/in/uldiskarlovskarlovskis","organization":"Accenture Latvia, devops.lv","shirt_size":"Men's L","title":"DevOps at Scale applied in Bunnyworld","abstract":"While people are discussing what is DevOps and what is not, this talk demonstrates DevOps at Scale and anti-patterns in an absolutely unseen way - with bunnies in the happy Bunnyworld. \n","description":"DevOps at Scale as a problem to solve is becoming more relevant every day but there isn’t that much of information how to do it in on a real project. Techy people get into technology and forget what DevOps is really about. This talk abstracts from technology and focuses purely on culture and organisational topics in a fun way. \r\n“So… meet delivery lead John. He got a brilliant idea how basically from nothing to make the cutest bunny in the world.”\r\n","notes":"Project for slides. \r\nThis is absolutely unique talk made by me personally and presented just in few places for now.","audience_level":"All","tag_list":["devops","devops at scale","scaled devops","fun"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-07-12T12:25:30.995Z"},{"name":"Katie Owen","email":"katherinehowen@gmail.com","avatar":"https://secure.gravatar.com/avatar/402cba58d64720296bb4973085399a07?s=500","location":"Atlanta","bio":"Katie has her DMA in music and played all over the world with the likes of the Atlanta Symphony, Charleston Symphony, and the Hollywood Concert Orchestra before perusing a career in code. As a developer, she mixes her musical expertise with her coding prowess to create detailed, custom, engaging user experiences and products as a Software Application Developer on CNN's Off Platform \u0026 Emerging Tech team.","twitter":"knhowen","url":"http://khowen.github.io/","organization":"Software Application Developer at CNN","shirt_size":"Women's M","title":"I have an idea, now what?","abstract":"You have come up with THE next big idea that could change everything, but how do you get it out there? Come to learn the process of ideation through deployment. Code demos will be built in the JavaScript stack.","description":"It can be so frustrating to come up with a great idea and not know how to get it out to the world. This session will walk attendees through the lifecycle of ideation to launch within the context of a web app. Learn key terminology and basic guidelines to help you on your way to launching THE next big idea. ","notes":"I am an excellent choice to speak on this topic because I am passionate about community and development, and I am a knowledgeable entrepreneur and developer.\r\n\r\nMy current employer, CNN, is big on Open Source, and many of the projects I work on are published through our Open Source organizations on Github and through NPM. \r\n\r\nIn addition, my background before working as a full-time developer was as a music freelancer. I understand first hand how to take ideas and make them reality. Past ventures include co-founding a music non-profit, starting a private lesson music school,  and starting various music groups. I became a developer because of the skills I gained from all of these freelance ventures, and I am passionate about helping others express their ideas through digital means. Wireframes, mockups, logos, full stack coding, source control, git, deployments are all in my wheelhouse.\r\n\r\nThere is nothing more powerful than a person creating an idea and getting it out to the world, and the world is a better place the more people are heard. ","audience_level":"Beginner","tag_list":["full stack deployments","entrepreneurial skills","ideas","open source","javascript"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-07-06T02:18:43.469Z"},{"name":"Peter Mbanugo","email":"chuksgerrard@yahoo.com","avatar":"https://secure.gravatar.com/avatar/cd018b040f18cd2038a277c0bdb21d45?s=500","location":"Lagos, Nigeria","bio":"I'm a Software Developer with experience working with the Microsoft .NET stack. I'm passionate about building quality software, with interest area around Offline First, Web App Performance and software architecture. I play football and tennis as a hobby.","twitter":"p_mbanugo","url":"https://pmbanugo.wordpress.com","organization":"","shirt_size":"Men's XL","title":"Think Offline-First","abstract":"It is easy to forget, in a culture of always-on internet connections, that large portions of the world do not enjoy the same level of access as smartphone-wielding Westerners. Let us look at design guidelines and technologies for building offline-first products.","description":"The internet has become a necessity for some of us. It's become a preferable medium for some of us to communicate, share and receive information. As we move from place to place, we discover that connection speed vary from location to location. Different service provider work best at specific locations. Some places are just shut out and offline. Also not forgetting the cost of data and how we try to minimise data expense. \r\n\r\nIn this talk, I teach Offline First. What it is, design guides, the benefits, technologies for building offline-first apps, and some products that has used it to gain broader reach and better serve their users.","notes":"No technical requirement. I'm the best on this subject because I'm a member of the offline-first community, where we're looking at patterns and practices for building applications for the developing world where inter is less affordable, less reliable and less available. I'm a contributor to Hoodie, an Open Source project for building offline-first product without worrying about backend. \r\nI also live in Nigeria, where internet connectivity is an issue, so I have first hand experience","audience_level":"All","tag_list":["offline-first","offline","development-methodology","web"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-07-04T17:58:33.604Z"},{"name":"Hugo Alejandro Borchert","email":"hugoborchert@hotmail.com","avatar":"https://secure.gravatar.com/avatar/64f94162988bc60ccbdf6a15e2a1e6af?s=500","location":"Argentina","bio":"Ingeniero en Informática (UCS-BA), Licenciado en Informática (UCS-BA), Especialista en Ingeniería del Software (CAECE), Criptografía y Seguridad Teleinformática (IESE), Diplomatura en Criptografía y Seguridad Informática (UBA-INAP).\r\n\r\nCursos realizados: Curso VMware vSphere: Install, Configure, Manage [V6] (LOL), Jornadas de Firma Digital (INAP), Jornada de Actualización Docente (IIFA), Curso de Introducción a la Ciberdefensa (CITC-Madrid), Jornada de Cibercrimen y Ciberterrorismo (UCEMA), Cursos de Linux Seguridad Avanzada, Shell Scripting, Redes, Administrador (Educación-IT), Ethical Hacking (Root Secure), Gestión y tratamiento de incidentes de seguridad de la información Parte 1,2 y 3 (ARCERT).\r\n\r\nExperiencia Docente: JTP “Arquitectura de las Computadoras” UTN-FRBA (2007-2011). Titular \"Arquitectura de Computadoras” y “Tecnología Computacional” ISTEA (2013-2014). Titular “Técnicas Criptográficas” IIFA-EMG (2006 a la actualidad). Adjunto \"Seguridad Informática” IIFA-EMG (2006 a la actualidad). Docente “Medidas de Seguridad Informática en el ámbito laboral” FAA (2006 a la actualidad). Docente “Seguridad Informática Nivel 1” IIFA-EMG (2013 a la actualidad). Docente “Medidas de seguridad de Contrainteligencia” (A distancia) IIFA-EMG (2013 a la actualidad). Docente “Introducción a la ciberdefensa” IIFA-EMG (2013 a la actualidad). Charlas y Seminarios de capacitación en empresas privadas en el país y en el extranjero.","twitter":"hugo_borchert","url":"http://hugoborchert.com","organization":"hugoborchert.com","shirt_size":"Men's L","title":"Criptografía Open Source","abstract":"Se brindarán conceptos de Información y Privacidad, también de Criptografía, las ventajas de su uso y algoritmos criptográficos.\nLuego se mostrará la instalación y el uso del Sistema criptográfico Veracrypt, detallando la creación y usos de contenedores cifrados.","description":"Hoy nos costaría mucho imaginar nuestras vidas sin el acceso a nuestra información digital, estamos acostumbrados a acceder a documentos de forma fácil y rápida desde cualquier computadora, a infinidad de dispositivos o la nube.\r\nEl planteo de la presente charla es ¿Qué tan segura está nuestra información? ¿Qué pasa si algún extraño pudiera acceder a nuestra información? ¿Nuestras fotografías privadas están protegidas, o corremos el riesgo de que un extraño o persona maliciosa invada nuestra privacidad?\r\nEl uso de herramientas de criptografía nos brindará la seguridad suficiente a la hora de transferir y/o guardar información.\r\nEn la presente charla se explicará el concepto de Criptografía Simétrica, Criptografía Asimétrica, se explicaran sus usos y se mostrará la instalación y el uso de la herramienta Veracrypt.","notes":"Me desempeño como criptólogo de un Organismo estatal de la República Argentina, asimismo me desempeño también profesionalmente en el área de criptografía y consultoría de Seguridad.\r\nTambién soy docente de Criptografía y Seguridad Informática y realizo capacitaciones en el área a instituciones privadas.\r\nTengo implementaciones realizadas en Veracrypt en organizaciones con excelente resultado.\r\n\r\nLa presente charla fue dictada en el FLISOL 2017 de Santiago de Chile, el 22 de Abril del presente año, en el INACAP (Santiago de Chile).","audience_level":"All","tag_list":[],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-29T19:52:18.921Z"},{"name":"Sharon Steed","email":"sharon@communilogue.com","avatar":"https://secure.gravatar.com/avatar/8fab0774eaa221532cf43d9c0fd831c3?s=500","location":"Unknown","bio":"Sharon Steed is a corporate empathy and communications consultant as well as an\r\ninternational keynote speaker. Sharon is a subject matter expert on communicating with\r\nempathy. She has spoken at companies on improving team communication and collaboration;\r\nat tech conferences on vulnerability as an asset; and has given a TEDx talk on empowering\r\ninsecurities. A lifelong stutterer, she uses her speech impediment to teach both what empathy is\r\nand how to be empathetic.\r\n \r\nHer corporate empathy practice teaches organizations how to build a collaborative culture using\r\nprinciples of empathy. Sharon works with teams looking to boost productivity through improving\r\ncollaboration as well as with individuals on effective, productive and positive communication\r\nstrategies.\r\n \r\nSharon’s course Communicating with Empathy is available on both LinkedIn Learning and\r\nLynda.com.\r\n","twitter":"sharonsteed","url":"http://www.communilogue.co","organization":"Communilogue LLC","shirt_size":"Women's L","title":"Empathetic Communication at Work","abstract":"Communication is the one skill that will never be obsolete. Why, then, are so many of us intimidated by working on or beefing up our communication strategies? This interactive workshop tackles your communications fears and weaknesses head on with a full day focused how we speak and how we listen. ","description":"Communication is the one skill that will never be obsolete. Why, then, are so many of us intimidated by working on or beefing up our communication strategies? We can all be great communicators, we just need to learn to approach it from a place of empathy. This interactive workshop tackles your communications fears and weaknesses head on with a full day focused on both sides of the conversation spectrum: speaking and listening. The main goal of this workshop is to learn how to approach every interaction from a place of empathy. Learners will leave this course with the tools to:\r\n \r\n1. Understand the true purpose of listening\r\n2. Shift listening into an action-based activity \r\n3. Identify biases and learn how to combat them\r\n4. Fight fair and use those disagreements as gateways to collaboration\r\n5. Craft responses that best helps their listeners understand and embrace their message\r\n","notes":"This is appropriate for all audiences. Specifically, this workshop is for people that either want to improve upon their already great communication skills or work on weaknesses that they or their coworkers have identified as areas to improve. \r\n","audience_level":"All","tag_list":["devops","agile","soft skills","leadership"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-28T23:23:03.475Z"},{"name":"Victor Gevers","email":"victor@GDI.foundation","avatar":"https://secure.gravatar.com/avatar/83f4f3c75459758260205e82c10b6c6a?s=500","location":"Unknown","bio":"(Ethical) hacker. 5,252 Responsible Disclosures / Coordinated Vulnerability Disclosures since '98 and chairman of the largest non-profit organization that offers free assistance with cybersecurity issues worldwide. ","twitter":"0xDUDE","url":"http://GDI.foundation","organization":"GDI.foundation","shirt_size":"Men's 3XL","title":"Repairing the internet with Responsible Disclosures","abstract":"In 2016 a non-profit organization GDI.foundation, operated by volunteers started reporting vulnerabilities as responsible disclosures and helping victims of ransom attacks worldwide under the name PROJECT366. We would like to share our experiences and challenges they have faced so far. ","description":"GDI.Foundation is a non profit organization that strives to make the internet safer. We have discovered and reported hundreds of data leaks and thousands of security issues worldwide and has been been mentioned by international press in 2017 which only covers a small aspect of our work: \r\nhttps://securityintelligence.com/news/brick-house-new-malware-destroys-vulnerable-iot-devices/ \r\nhttps://www.scmagazine.com/mongodb-databases-under-attack-worldwide/article/629601/ \r\nhttp://www.computerworld.com/article/3155260/security/ransomware-groups-have-deleted-over-10000-mongodb-databases.html \r\nhttps://www.scmagazineuk.com/thousands-of-hadoop-clusters-still-not-being-secured-against-attacks/article/637389/\r\n","notes":"","audience_level":"All","tag_list":["open source intelligence","responsible disclosure","coordinated vulnerability disclosure"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-26T21:11:51.001Z"},{"name":"Ignacio Anaya","email":"ignacio.anaya89@gmail.com","avatar":"https://secure.gravatar.com/avatar/6c3e7ef20801b4b967dc1643f63d6233?s=500","location":"Unknown","bio":"I am a Full Stack Developer and Programming mentor mostly working with JavaScript techs as Node.js and Vue.js. With more than 8 years of experience, not just coding but also teaching,  I am an enthusiastic OSS contributor who has cooperated with several JS (and Vue.js) libraries. I also like to participate in dev communities and conferences performing workshops, tech talks or just helping organizing.","twitter":"ianaya89","url":"http://github.com/ianaya89","organization":"Exact Transactions | Thinkful","shirt_size":"Men's S","title":"Breaking the Binary World with Vue.js","abstract":"Vue.js is more consolidated than ever. It is the future of the MV* client side world and  is one of the most promising alternatives, fighting with industry giants like React and Angular 2.\nI will show you the simplicity and power of this framework which combines the best parts of front end world.","description":"This talk exposes a binary situation in front-end world. Right now most people try to chose between React and Angular. Everybody knows that there are more choices but people prefer to pick between these two.\r\n\r\nThankfully the situation started to change and alternatives like Vue.js have an stronger role in front end apps.\r\nI want to briefly introduce what is Vue.js and how it works.The idea is to review the core concepts of the framework but also see how you can scale progressively when you have complex requirements\r\n\r\nI think would be great that Angular and React developers can see how to merge advantages and best parts of both frameworks to build a new one and break the polarization they have.\r\n\r\nI am not an evangelist. I will not try to convince developers to use Vue, just show the features, uses cases and advantages. And also let know the audience that OSS projects could became great without Facebook or Google behind it.","notes":"According to Third Party Benchmark, Vue.js is one of the alternatives with better perfomance. Is also one of the mosts starred and forked project on GitHub. Its popularity and community has grown a lot last months. Besides that, there lot of people that could not learn it yet or would give it a chance. So I think is a great opportunity to make more popular.\r\n\r\nI am an experienced full stack developer and programming mentor. I started \"my career\" as speaker last year participating in local conf and meetups. But I also have a several years of experience teaching and mentoring developers. I worked with Vue for more than 1 year. I contributed the framework with tools and plugins and I also performed courses for online code schools like platzi.","audience_level":"All","tag_list":["javascrtip","vuejs","mv*"],"rating":75.0,"state":"submitted","confirmed":false,"created_at":"2017-06-24T19:31:34.008Z"},{"name":"Ignacio Anaya","email":"ignacio.anaya89@gmail.com","avatar":"https://secure.gravatar.com/avatar/6c3e7ef20801b4b967dc1643f63d6233?s=500","location":"Unknown","bio":"Full Stack developer. Passionate about code, teach and field hockey. Mostly working with JavaScript and Node.js 🚀","twitter":"ianaya89","url":"http://github.com/ianaya89","organization":"Exact Transactions | Thinkful","shirt_size":"Men's S","title":"FindEarth - Hola Mundo!","abstract":"Quisiera presentar a la comunidad nuestro proyecto open source: Find Earth.\nEn conjunto con una de las ONG mas grandes de Argentina construimos una plataforma para ayudar a encontrar personas perdidas en todo el mundo. ","description":"Find Earth es una plataforma open source, que tiene como objetivo facilitar el reporte de personas perdidas, agilizar la viralización de sus datos en redes sociales y lo más importante: ayudar a encontrarlas. \r\n\r\nContamos con 3 piezas de software fundamentales: \r\n\r\n- Un dashboard que permite a los gobiernos u organizaciones concentrar la información de personas perdidas, obtener reportes, ser mas precisos en detalles de geolocalización y lo mas importante poder viralizar a las personas mediante redes sociales.\r\n- Una aplicacion para celulares para que los ciudadanos se sumen a la iniciativa y puedan ser notificados cuando las personas se pierden cerca de sus barrios o vecindarios. De esta manera facilitamos las notificaciones y podemos recibir información valiosa en tiempo real.\r\n- Un sitio web publico que permite listar personas desaparecidas, informar sobre las mismas y reportar nuevos casos.\r\n\r\nFind Earth es un proyecto local que va a ser impulsado en primera instancia desde Argentina pero tiene la escalabilidad y arquitectura necesaria para poder desarrollarse a nivel gubernamental o empresarial en cualquier parte del mundo.\r\n\r\nFue desarrollada por un grupo de amigos en conjunto con la ONG mas importante de Argentina: Red Solidaria. El propósito de la charla es contar la experiencia de lo realizado, dar a conocer porque construimos esta plataforma, mostrar las herramientas y las tecnologías utilizadas (100% open source) y por ultimo concientizar a las personas que con un mīnimo aporte podemos ayudar a otras personas.","notes":"Mi nombre es Ignacio Anaya, soy uno de los creadores de la plataforma junto con Matias Tucci, Nicolas del Valle y Jonathan del Valle. Hace muchos años empezamos a hacer software para ayudar ONG's y para poder aportar un cambio en lo social desde el punto de vista del software.\r\n\r\nTrabajamos varios proyectos sociales, como Frio Cero, Decinos Donde Votas y Precios Cuidados pero Find Earth es el proyecto mas grande que tenemos hasta ahora y el cual creemos que va a causar mayor impacto social, no solo en nuestra region sino en cualquier país donde se necesite.\r\n\r\nLa plataforma todavía no fue lanzada públicamente pero aquí están los links\r\n\r\nSitio Publico =\u003e https://find.earth/\r\nGitHub =\u003e https://github.com/findearth","audience_level":"All","tag_list":["missing people","social","open source","javascript","nodejs"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-24T19:14:13.981Z"},{"name":"Niv Sardi","email":"xaiki@evilgiggle.com","avatar":"https://secure.gravatar.com/avatar/9cddcb9b135cb4794ac422f5f7faee0d?s=500","location":"Unknown","bio":"Comes from Argentina. Hacker and activist for 15 years, he's worked on Debian, Linux, FFMPEG and many other Free Software Projects.\r\nTrained Matematician, have worked for many years as an R\u0026D engineer. Since 2009, retrained into a political advisor, around Argentinia's new media law.\r\nWith strong views on Culture, Free Software, Technology, Commerce and Politics he's an experienced public speaker that usually enlightens his audience with innovative and challenging ideas. \r\n\r\nHe's the Butter Project Leader from the start, now almost 3 years ago\r\n","twitter":"xaiki","url":"http://butterproject.org","organization":"Butter Project","shirt_size":"Men's M","title":"From PopcornTime to Butter, the fight for the right to make awesome software","abstract":"We make Netflix tremble showing the world how easy it is to make a great video streaming experience with simple hacks and almost no money. obviously, that got a few people knocking on our door and got us from technical to legal hacks to be able to keep doing what we do: great Software that people ♥","description":"We live in a world of rich media, text, images and videos are ubiquitous to\r\nour lives. Open-Source technology to distribute text and images to anyone is\r\ncommon but we lack its video part. The solutions offered by the market are\r\nusually expensive and require a massive installed infrastructure, de-facto\r\nexcluding most of the world's populous: emerging nations. Contrary to the\r\nText distribution revolution that built the Internet we all love, ttoday a\r\nfew companies hold patents locked technologies to position themselves as the\r\nnew 'media curators', Netflix, Hulu, HBO, YouTube, Facebook,… get to decide\r\nand influence what is seen, when and where, destroying local content in\r\nfavor of the global one. Furthermore, the centralized logic of these\r\nbusiness models (and hence technologies) make their content unavailable in\r\npoorly or disconnected areas, in essence, cultural inclusion is now bound to\r\ninternet access and we have deepened the digital breach.\r\n\r\n\r\nWe bring world-class highly distributed and decentralized technologies. We\r\nempower emerging societies to enter the video distribution race side by side\r\nto the biggest players. We make user-focused tools to build proven, solid\r\nand useable Video On Demand (VOD) solutions that handle with extreme simplicity the whole\r\nmedia workflow with close to zero pre-required technical knowledge and digital\r\ninfrastructure.\r\n\r\nThere are basically 3 classes of companies going to similar solutions,\r\ncommercial content broadcaster, user-content broadcaster and CDN providers.\r\n\r\nThe Commercial Content Broadcasters (CCB) will try to own all of the chain,\r\nthey buy content, build the user apps, distribute them, marked them build\r\nthe CDN and charge users. Some of them will even produce their own content\r\nto feed into their solutions. In this realm our 'competitors' would be\r\nNetflix, HBO, Amazon and Hulu.\r\n\r\nThen the User-Content Broadcasters (UCB) will focus on building a content\r\ndistribution strategy for user content. They strip the content production\r\ncosts faced by the CCBs but need to provide infrastructure for a much higher\r\nnumber of files. Here we're facing Facebook, Youtube and Vimeo.\r\n\r\nFinally the CDN providers will only build the distribution technology and\r\nsell that to 3rd parties interested in monetizing the content they own or\r\nbuy, their clients are usually ISPs, Telcos and Content groups, these are\r\nour most direct competitors as we are a drop-in replacement for technologies\r\nbuilt by Akamai, Datco and Microsoft.\r\n\r\nWith Butter, we offer something these platforms don’t: \r\n\r\n- Through peer-to-peer, our infrastructure costs shrink to zero as demand grows\r\n  reverting the traditional growth paradigm.\r\n\r\n- Our user-owned technology makes the video content available in places with\r\n  poor to no internet, we have working solutions working out of a $20 USD\r\n  of-the-shelves wifi access point with a pendrive (great for small ISPs).\r\n\r\n- With Butter you own your work, you own the user agreement, you own the\r\n  rules, we have a zero trolling, censorship resistant, decentralized solution.\r\n\r\n- Don't be excluded, all these platform's content can be integrated to\r\n  Butter.\r\n\r\nOn top of everything, Butter offers an unmatched way to customize and\r\nstylize the platform itself to truly reflect a vision one can have.\r\n\r\n###What is your project doing? \r\n\r\n- Expanding/improving existing new technology/platform\r\n\r\nWe are bringing first world technology to developing countries and\r\nculture-driven actors all around the world. We're building the \"Android of\r\nVOD\", a tool for building strong, resilient and innovative applications, and\r\ndistributing video-content through direct connection with a server,\r\npeer-to-peer sharing, or even simple network distribution without Internet\r\nconnectivity.\r\n\r\nThese use-cases of video streaming already exist separately but no software\r\nmanaged to combine all these elements together, even less with a simple yet\r\npowerful interface without direct code contribution required. Furthermore,\r\nthe use of Open Source licensing allows developers to directly get involved\r\nwith their platform and propose changes to Butter directly, on top of the\r\nin-code modifications they might add.\r\n\r\nThe groundbreaking vision of Butter can empower youth, vulnerable\r\nminorities, cooperatives and social actors but also companies or\r\norganizations, by giving them a revolutionary way of gathering, sharing and\r\nwatching video-content.\r\n\r\n### Our future\r\nWith ButterMaker, literally anyone will be able to build their stylized VOD\r\nsolutions, through a clean and user-friendly without any coding skills\r\nrequired. The app will produce secure and updatable Butter applications on\r\nany platform (currently Windows/OSX/Linux/iOS/Android). Our bleeding edge\r\nOpen Source technology stack is packaged and documented allowing the\r\ntech-savvy to be-part of the deployment of world-class applications for\r\ntheir communities.\r\n\r\nButterDAM will empower children, adolecents and youth to be their own media\r\ncurators, by selecting the video content and metadata pushed to users\r\nthrough a simple interface connected to ButterMaker: Young media creators\r\nwill their content displayed in the spotlight.\r\n\r\nFinally these local-owned, local-built Butter Apps, will move kids away from\r\nglobalized content to know and own their cultural heritage through\r\nnew-media.\r\n","notes":"This talk doesn't have much technical requirements, it's going to be mostly a flyhtrough what butter/popcorntime does and what is our vision for it.\r\nI'm the best person to do that talk as the Butter Project Leader, speak native spanish and know a fair bit about Latin American politics.","audience_level":"All","tag_list":["javascript","popcorntime","vod","netflix","streaming","cdn"],"rating":83.3333333333333,"state":"submitted","confirmed":false,"created_at":"2017-06-20T23:50:13.448Z"},{"name":"Mahmoud Abdelghany","email":"blackbeard334@protonmail.com","avatar":"https://secure.gravatar.com/avatar/b29a3fcda3cf8c388f58e9c71b7c5614?s=500","location":"Unknown","bio":"The speaker has been your ordinary consultant for over a decade now. He had/has the privilege of working for numerous industries ranging from airlines to the financial sector. \r\n\r\nIn the rest of his waking hours, he tinkers around with games and emulators. Most recently, he spent about 3 years on the djoom3 project, and reaffirms that he's learned more in those 3 years than his whole career.","twitter":"blackbeard0x14e","url":"https://github.com/blackbeard334","organization":"","shirt_size":"Men's 3XL","title":"Fallacies of Doom - Lessons learned from porting Doom 3 to Java","abstract":"While Java has grown enormously over the years, the fundamentals have stagnated.\n\nThe motivation for this talk and underlying project, was the following question: why is Java, with it's 20 years of age, and (at least)6 billion running JVM's not a major player in the video-game development universe?","description":"So everybody knows the Doom games, right? Every new installment brought brand new ideas, and groundbreaking graphics. But more importantly, they brought the source code of the prior installment to the eye of the public.\r\n\r\nNaturally people have played and hacked the code to oblivion, as much as they played the games themselves. And I have the honor to be one of those people.\r\n\r\nI (naively) endeavored to port the Doom 3 C++ code to our fantabulous Java. In doing so, I hoped to learn, among other things, more about 3D graphics.\r\n...what I didn't expect though, was for djoom3(cool name huh!) to teach me more about Java!?\r\n\r\nAside from the basic game development intro, this talk focuses on the following:\r\n- Some areas where Java should learn from it's nemesis, C++\r\n- Other areas where the student(Java) becomes the master(C++)\r\n- And some promises that were made, but never kept","notes":"All I require is some kind of projector or big monitor, which I assume will be provided.\r\n\r\nThis is an opinionated talk, but the content is all technically sound.\r\nI guess what would make me the best person to speak about all of this, is the amount of time I spent on the djoom3 project, which is the main theme of the presentation.","audience_level":"Intermediate","tag_list":["game","c++","debugging","language features","ide"],"rating":83.3333333333333,"state":"submitted","confirmed":false,"created_at":"2017-06-18T11:49:40.688Z"},{"name":"Melanie McCall","email":"bluescript17@gmail.com","avatar":"https://secure.gravatar.com/avatar/d5db0b34e89bf2b3cdfc3897a6ce94d5?s=500","location":"Unknown","bio":"I love to absorb as much info as I possibly can. I am a dancer at heart and will dance by myself with no shame. I understand coding can be scary at first, so I try to encourage as many people to take that dive because we're capable of just about anything! I have studied at Georgia Tech with a major in Computational Media. It is a mixture of computer science courses and media-focused courses. With a passion in UX, I have taken a role as a Software Dev at CNN. Come talk to me if you want to connect! I speak beginner level Spanish. ","twitter":"","url":"https://www.linkedin.com/in/melaniemccall/","organization":"CNN, Software Developer","shirt_size":"Women's M","title":"Animation and Gaming","abstract":"Have you ever wanted to make your own game or animation? Processing is a great tool to help make compelling and professional artwork. I will explore some cool examples and features when using it as well as how to get set up. ","description":"Have you ever wanted to make your own game or animation? \r\nArt and technology meet in Processing's FREE and easy to use software. Processing is a flexible software sketchbook and a language for learning how to code within the context of the visual arts. We will explore some cool examples and features of Processing as well as how to get set up. Processing is available on GNU/Linux, Mac OSX, and Windows. Established in 2001, there are tens of thousands of users who use Processing for learning and prototyping. it is very well documented with many books available.  Java, Javascript, Python, and Android modes are available. 2D and 3D Animation are possible.","notes":"There shouldn't be any technical requirements besides needing a projector of some sort. I have been using Processing for three years and have done many projects as a student at Georgia Tech and I am in love with it. I have used it to learn gaming and computer graphics. I think its a wonderful way to overlap media and technology while having some fun and would love to get the word out to as many developers as possible. There are also many people who have put their projects online. The link is https://processing.org/ if you would like to check it out. ","audience_level":"All","tag_list":["processing","animation","java","javascript","python","open source"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-15T16:32:36.306Z"},{"name":"U.M.K. Dikshit","email":"dikshitrocks93@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/7098/10422481_1072276466135294_8947180447375837799_n.jpg","location":"Unknown","bio":"U.M.K. Dikshit is a Mozilla Tech Speaker, Mozilla Representative and part of the Mozilla Hyderabad Community here in India. He is also takes part in projects on Security as a part of his job. He is also a participant and attendee of Internet Freedom Festival 2017. He also volunteers as a localizer for Mozilla, TOR, Orfox, OrWeb and many other Open Source Projects and Coordinator for Globaleaks. He currently also devotes his time with ICRISAT where he works with drones to develop and trial techniques to connect farmers. He is the founder of “JAVA 1.X Hyderabad Chapter” where he teaches about the latest features, changes in Java and Co-founder of “Duck Duck Go Hyderabad Chapter”. Overall he is your next door friendly software guy. \r\n“Developer by Day, Hacker by Night”","twitter":"decode_dev","url":"https://medium.com/@decode_dev/","organization":"Mozilla Tech Speaker","shirt_size":"Men's XL","title":"Using Tor for Smart Home Security","abstract":"The IoT is emerging as the third wave in the development of the Internet. We have a great danger with IoT because of the surveillance by an individual hacker or a state actor to exploit the very private information of individuals or companies. We can secure our “Smart Homes” by using TOR.","description":"Recent advances in information and communication technologies and embedded systems have given rise to a new disruptive technology: the Internet of Things (IoT). Internet of things (IoT) is expected to have a massive impact on consumer products, business and wider culture, but these are still early days.\r\n\r\nThe Internet of Things is a phenomenon where tiny machines have the ability to sense, respond, compute, and connect to the Internet, providing unprecedented access to control things and the environment around us. Along with advancement lies the problem going hand-to-hand.There have been many reports on how this things can be exploited to do various things in the Digital World.We need security because we don’t want others to control our home or disturb our privacy in our homes. TOR having been helping many people towards “Safe and Secure Browsing”. We can use “Tor” for securing our “Smart Home” so that we may not face the situations where we locked out by our home.\r\n\r\nSecurity is extremely important for achieving this goal. As this worldwide network of interconnected objects can be exploited anywhere by anyone and anytime, it is necessary to enhance it with strong security foundations able to give birth to a world-changing paradigm.\r\n\r\nThe sense of fear that arises when using “Smart Homes” is addressed since, recently we have seen the “Dark Side” of Smart Homes and Internet of Things where people became aware of the risks of using more “IoT” which makes them more vulnerable and also effects their privacy.","notes":"U.M.K. Dikshit is a Mozilla Tech Speaker, Representative, and part of its Hyderabad Community, India. His job has to do with Security and he spoke at the Internet Freedom Festival in 2017.\r\nAs a volunteer he localizes software for Mozilla, Tor, Orfox, GlobaLeaks and OONIProbe. Currently working with ICRISAT, using drones to develop and trial techniques to connect farmers.\r\nFounder of the “JAVA 1.X Hyderabad Chapter” giving lectures on the latest features and changes in Java. Co-founder of “Duck Duck Go Hyderabad Chapter”.\r\nOverall he is your next door friendly software guy.\r\n«Friendly Developer by Day, Friendly Hacker by Night.»\r\n\r\nTravel and Accommodation required","audience_level":"All","tag_list":["security","iot","python","tor","internet of things","open source","raspberrypi","privacy"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-11T18:37:08.052Z"},{"name":"Octavio Rossell","email":"octavio.rossell@gmail.com","avatar":"https://secure.gravatar.com/avatar/cf29bc5be377196498c8e2f3c1f2927a?s=500","location":"Unknown","bio":"Soy Octavio José Rossell Tabet: Venezolano a Tiempo Completo.\r\n\r\nMiembro de la Comuna Don Luis Zambrano. Formo parte de la comunidad de Software Libre desde hace 15 años, fundador del Congreso Nacional de Software Libre y organizador del mismo por mas de 10 años. Corredactor de la Ley de Infogobierno\r\n\r\nMusico productor, evangelizador por el Software Libre a tiempo completo!\r\n\r\nDefinitivamente vine a este mundo a formar parte en la vanguardia del movimiento del Software Libre.","twitter":"octaviotron","url":"","organization":"Comunidad de SL Venezuela","shirt_size":"Men's XL","title":"Software Libre para Audio Profesional en Estaciones de Radio y Estudios de Grabación","abstract":"El objetivo de la charla es Identificar los principales conceptos de Audio Digital como base fundamental en el tratamiento de las ondas analógicas en un computador y reconocer los dispositivos y herramientas de software libre usados en la producción de audio digital.","description":"Índice Temático: \r\n1: Conceptos básicos.\r\n a) Qué es el audio digital y el audio analógico.\r\n b) Tasa de muestreo y profundidad de Bits.\r\n c) Entendiendo el rango dinámico.\r\n2: Equipos de audio necesarios para un buen sistema de captura y procesamiento de audio.\r\n3: Herramientas de Software Libre para edición de audio.\r\n a) Estación de audio digital (DAW).\r\n b) Enrutador de señales.\r\n c) Efectos.\r\n d) Multiefectos.\r\n e) Instrumentos virtuales.\r\n f) Editor de Onda: AUDACITY.\r\n g) Trackers-secuenciadores.\r\n h) Instalación de las herramientas de software libre.\r\n i) Distribuciones de GNU/Linux para audio.\r\n","notes":"Necesidades: Proyector de Video y (opcional) Amplificación de Audio","audience_level":"All","tag_list":["radio","audio","gnu","linux"],"rating":90.0,"state":"submitted","confirmed":false,"created_at":"2017-06-08T20:31:14.656Z"},{"name":"Ashley Hathaway","email":"ashley@stitchdata.com","avatar":"https://secure.gravatar.com/avatar/807c826a50bb0795b43a5deed6f8ef72?s=500","location":"Unknown","bio":"Ashley is a Developer Evangelist at Stitch Data but focuses on their open-source project, Singer.io which helps developers automate and analyze data more easier. Previous to Stitch Ashley worked on the senior product team for the IBM Watson APIs and focused on AI and machine learning. She puts her fine arts degree to good use by identifying random typefaces and waxing poetic over their historical context. Ashley travels often so be sure to high five her when passing through your local airport.","twitter":"ash_hathaway","url":"https://medium.com/@ash_hathaway","organization":"Stitch Data","shirt_size":"Women's S","title":"Why we made an open-source project ","abstract":"In this talk learn the purposeful decision to open-source part of an existing product and why open-source is contributing to the overall strength and success of the product. We'll also go over ways to engage communities, some of struggles along the way, and metrics to help guide decision-making.","description":"Singer was born out of experience writing Python script integrations that would break, lose data, and just waste time. Making Singer open-source was a purposeful move by the company meant to strengthen the community of integrations and make moving data easier. In this talk learn how the team created the product along with successes and failures along the way.","notes":"","audience_level":"Beginner","tag_list":["etl","opensource","startup"],"rating":90.0,"state":"submitted","confirmed":false,"created_at":"2017-06-07T19:01:28.734Z"},{"name":"Andres","email":"amijares@shiftgig.com","avatar":"https://secure.gravatar.com/avatar/0493f2673517f90092c431ea418b5269?s=500","location":"Buenos Aires, Argentina","bio":"I'm a software engineer currently working as Front end Director at Shiftgig,  also, I collaborate with several groups in Buenos Aires which aims to delivers javascript free classes for anyone interested in learning.  ","twitter":"andresmijares25","url":"https://medium.com/@andresmijares25","organization":"Shiftgig","shirt_size":"Men's M","title":"Ingenieria de software como alternativa para inmigrantes en latino america. ","abstract":"En los últimos 10 anos, Latino América a presentado una ola migratoria masiva;   solo en Argentina existen 5000 puestos en el area de tecnología no ocupados, cómo podemos usar todo esto a nuestro favor?","description":"En los últimos años Venezuela, Colombia y México presentan grandes indices de fuga de talento, países como Argentina, Estados Unidos y Chile tienen a ser destinos los jovenes debido las facilidades para conseguir una visa de trabajo gracias a convenios como el Mercosur. Sin embargo, insertarse en una sociedad nueva no es fácil, en el caso de Venezuela, la mayoría de los emigrantes son profesionales en areas como Medicina, Derecho e Ingenieria, por su parte Colombia y Mexico buscan destinos donde la educación no sea tan costosa para poder estudiar una carrera profesional, las realidades son varias.\r\n\r\nEn este caso puntual, me enfoco de la realidad de Argentina; actualmente según cifras de la Nación* existen aproximadamente 5000 puestos de trabajo que no están siendo ocupados en el area de informática (programación, administración de sistemas entre otros), por su parte, la desocupación en áreas como Educación, Medicina y Derecho es alarmante, actualmente las cifras de desempleo abarcar alrededor de 15%. Todo esto lleva a la interrogante, cómo podemos educar a nuestra sociedad en materia de ciencias de la computación para mejorar la calidad de vida y contribuir a la inserción de los profesionales a la sociedad?\r\n\r\nEl enfoque se encuentra en:\r\n1- Soportar la diversidad de genero.\r\n2- Presentar aplicaciones que se enfoque especialmente proveer contenido que pueda funcionar con condiciones de conexión en baja latencia.\r\n3- Educar a las personas para insertase en la sociedad en un nuevo ámbito, ciencias de la computación, en una cultura que no require tener un titulo universitario.\r\n4- Adopción de Javascript como lenguage de pila.\r\n\r\n\r\n","notes":"","audience_level":"All","tag_list":["javascript"],"rating":90.0,"state":"submitted","confirmed":false,"created_at":"2017-06-04T01:14:09.672Z"},{"name":"Morgen","email":"morgen.bromell@gmail.com","avatar":"https://secure.gravatar.com/avatar/f47a997c782124840efd1fbb23e6193b?s=500","location":"Oakland, CA","bio":"Morgen Bromell is a 25 year old black queer technologist and CEO and founder of Thurst, a dating app for queer people of all genders. Thurst aims to create a space for marginalized people, especially trans women, to connect with community and find love. Morgen is working towards make tech more accessible to people of color through software and community initiatives and activism. They are interested in science fiction, afro-futurism, comics, and vegan donuts.","twitter":"MorgenBromell","url":"http://whoismorgen.com/","organization":"Thurst Co","shirt_size":"Men's M","title":"Developing Thurst: An accessible dating app for queer people of all genders","abstract":"My name is Morgen, I’m a queer nonbinary person and the founder of Thurst, a dating app for queer people of all genders. I’d love to talk about the development process for Thurst, making intentional and accessible space for non-binary \u0026 trans mobile users, and how queering tech is the future. ","description":"Thurst is a dating app for queer people of all genders, that prioritizes safety, security, accessibility, and fostering an affirming online community. I’ll explore how Thurst evolved from just an idea posted on Tumblr to an app and community of queer, non-binary, and trans users and developers working towards a more inclusive dating culture. Thurst is currently being developed and designed with only free, low-cost, or open software and tools. \r\n\r\n","notes":"","audience_level":"All","tag_list":["dating","thurst","app","mobile","angular"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-06-02T00:17:57.802Z"},{"name":"Tarus Balog","email":"tarus@opennms.org","avatar":"https://secure.gravatar.com/avatar/df6e134314b6ba3c88648f2208539b57?s=500","location":"Pittsboro, NC, USA","bio":"Tarus Balog has been involved in managing communications networks professionally since 1988, and unprofessionally since 1978 when he got his first computer - a TRS-80 from Radio Shack. Having worked as a network management consultant for many years, he was constantly frustrated in the lack of flexibility involved in commercial solutions such as OpenView and Tivoli, as well as shocked by their high prices. Looking for a better solution, he turned to open source and joined the OpenNMS project in 2001 and become the principal administrator of the project in 2002. Since then he has managed not only to make a living working with free software, but the OpenNMS Group, the services company behind the project, has thrived. He is an outspoken evangelist for free and open source software and the communities it inspires.","twitter":"sortova","url":"https://www.adventuresinoss.com/","organization":"The OpenNMS Project","shirt_size":"Men's L","title":"So You Want to Start an Open Source Business?","abstract":"Love free software? Want to make money with free software? Are you crazy?\n\nIf you are, this talk is for you. This presentation will discuss how a business in open source software is different that a normal software company, and how you can be successful even if your software is free.","description":"Someone who is a good cook might often hear “You should open a restaurant!”. While that is definitely a compliment, there is a tremendous distance between the kitchen and a storefront. Likewise, people who love free and open source software often want to do it full time as a business, but how do you get started? Where do the customers come from? What do you sell? How do you pay the bills?\r\n\r\nThese questions and more will be discussed in “So, You Think You Want to Start an Open Source Business?”, a talk which will cover most of the steps from “idea” to “profit!”. It is aimed at anyone with an interest in doing open source full time or entrepreneurs who want to bring an idea to life.\r\n","notes":"I have given presentations at a number of open source conferences and I look forward to visiting Cuba in November. While I understand Spanish and can speak it at an elementary level, I'll will be bringing another member of the OpenNMS team, Alejandro, who is originally from Venezuela, so that we can better participate in all three days.\r\n\r\nI blog about free and open source software here: https://www.adventuresinoss.com/\r\n\r\nA video of a keynote I gave at the SCaLE conference can be found here: http://www.ustream.tv/recorded/4904528\r\n\r\nMy talk will be in English but we will be able to answer questions in either English or Spanish.","audience_level":"All","tag_list":["open source business"],"rating":80.2,"state":"submitted","confirmed":false,"created_at":"2017-06-01T15:16:48.912Z"},{"name":"Tarus Balog","email":"tarus@opennms.org","avatar":"https://secure.gravatar.com/avatar/df6e134314b6ba3c88648f2208539b57?s=500","location":"Pittsboro, NC, USA","bio":"Tarus Balog has been involved in managing communications networks professionally since 1988, and unprofessionally since 1978 when he got his first computer - a TRS-80 from Radio Shack. Having worked as a network management consultant for many years, he was constantly frustrated in the lack of flexibility involved in commercial solutions such as OpenView and Tivoli, as well as shocked by their high prices. Looking for a better solution, he turned to open source and joined the OpenNMS project in 2001 and become the principal administrator of the project in 2002. Since then he has managed not only to make a living working with free software, but the OpenNMS Group, the services company behind the project, has thrived. He is an outspoken evangelist for free and open source software and the communities it inspires.","twitter":"sortova","url":"https://www.adventuresinoss.com/","organization":"The OpenNMS Project","shirt_size":"Men's L","title":"OpenNMS WHO?","abstract":"Projections expect that by 2020 there will be 30 billion devices on the Internet, rising to 75 billion by 2025. How will they be monitored?\n\nOpenNMS is a 100% free and open source monitoring platform designed to scale to the Internet of Things. Learn all of the great things about this project.","description":"OpenNMS is the most amazing piece of software you've never heard about, even though it has been around since 2000. It is a network monitoring platform designed to scale to the Internet of Things, and yet it is 100% free and open source software. It is used by some of the largest companies in the world.\r\n\r\nThis presentation covers What's Happening with OpenNMS. The project has grown considerably and this talk will cover the new technology such as NewTS (a new time series database built on Cassandra), the Minion (distributed monitoring) and OpenNMS Compass (mobile client).\r\n\r\nThere will be demonstrations of the new features as well as some funny stories about working with an open source project.","notes":"I have given presentations at a number of open source conferences and I look forward to visiting Cuba in November. While I understand Spanish and can speak it at an elementary level, I'll will be bringing another member of the OpenNMS team, Alejandro, who is originally from Venezuela, so that we can better participate in all three days.\r\n\r\nI blog about free and open source software here: https://www.adventuresinoss.com/\r\n\r\nA video of a keynote I gave at the SCaLE conference can be found here: http://www.ustream.tv/recorded/4904528\r\n\r\nMy talk will be in English but we will be able to answer questions in either English or Spanish.","audience_level":"All","tag_list":["java","monitoring","opennms"],"rating":80.0,"state":"submitted","confirmed":false,"created_at":"2017-06-01T14:43:24.889Z"},{"name":"Rebecca Poulson","email":"rebecca.poulson@gmail.com","avatar":"https://secure.gravatar.com/avatar/de85ce9ca9269eeb8b5a32f12b5e25ed?s=500","location":"Chicago, IL","bio":"Rebecca Poulson is the Technical Program Manager for Emerging Platforms at Knight Lab at Northwestern University where she gets to build weird open source tools for journalists. She's particularly excited about WebVR, getting writers involved with open source and tacos. Rebecca has previously been an Oculus Launchpad Fellow, engineer at Kickstarter and a professional playwright.","twitter":"RebeccaPoulson","url":"","organization":"Knight Lab","shirt_size":"Women's M","title":"Building Engaging Virtual Reality Experiences for the Web","abstract":"WebVR is incredibly exciting for its potential to democratize both the creation and consumption of VR content.  We'll start with a brief overview of the state of WebVR and UX best practices, then we'll dive in and show you how you can start developing VR projects with HTML and JS using A-Frame.\n\n\n","description":"A-Frame is a powerful and flexible open source framework that makes it surprisingly easy to get started developing VR experiences. It provides an accessible entry point for beginners and is endlessly extensible to suit the needs of advanced users. A-Frame is free and open source so it makes VR development available to the widest possible variety of people. Virtual Reality has the potential to make a tremendous impact on the way we interact with the world, so it's important that these technologies are built by and for all kinds of communities. This talk will instruct the audience in how to begin developing VR projects with HTML and Javascript and provide a foundational context for their new creations.\r\n\r\nWe'll start with a quick overview of the WebVR API, what it does and in which browsers. Then we'll take a look at some of the most recent research about what makes a safe, entertaining and useful VR experience. The last half of the talk will be a how-to on getting started with A-Frame, using the A-Frame Inspector and building components.\r\n\r\nAttendees should leave confident in their ability to explore this exciting new domain using their existing web development skills.","notes":"","audience_level":"All","tag_list":["javascript","html","virtual reality"],"rating":90.0,"state":"submitted","confirmed":false,"created_at":"2017-05-31T03:12:00.479Z"},{"name":"Sia Karamalegos","email":"siakaramalegos@gmail.com","avatar":"https://secure.gravatar.com/avatar/6e0ba5b45dafe063b98db2a1d5391433?s=500","location":"New Orleans","bio":"Sia Karamalegos is the founder and lead developer for Clio + Calliope Web Development. She has over 15 years of experience in technology, strategy, project management, and operations from small startups to large corporations across multiple industries, especially high-tech and education. She leverages her depth of experience with software engineering to build high-value applications. \r\n\r\nIn both 2015 and 2016, Sia was recognized in the Silicon Bayou 100, the 100 most influential and active people in tech and entrepreneurship in Louisiana. She graduated from Texas A\u0026M University with a BS in chemical engineering and received her MBA from Harvard Business School.","twitter":"thegreengreek","url":"http://www.clioandcalliope.com/","organization":"Clio + Calliope Web Development","shirt_size":"Men's M","title":"Level Up Your React Form Prowess","abstract":"Rare is the app that doesn’t rely on forms to obtain data from users, but how well do you really know them in React? If you’re just starting out in React, or if you’re more experienced in React but swimming in a sea of code complexity, come learn how you can improve your form prowess.","description":"In this session, we’ll learn what the options are when it comes to building forms, weighing their pros and cons and giving you the practical tools you need to become a React form ninja.\r\n\r\nHave you only ever used controlled input forms? Why? We’ll explore both controlled and uncontrolled forms and answer the important question of when you should use one over the other, smashing a few myths along the way. How do we address the thorny issue of state management when building our forms? We’ll also explain concepts of encapsulation and how you would approach state both with and without Redux. Do you need validations? Check, we got that too.\r\n\r\nYou’ll get the most out of this session if you’re familiar with React components and ES6 syntax. You’ll get all the fancy concepts you need through code examples. And don’t worry if all of this didn’t make sense… it will.","notes":"This was an earlier version of the talk, and the portion on encapsulation and messaging was done off-slides and on the white board https://docs.google.com/presentation/d/1xEO6sIBgiSOuUZ3Nb1jwuRE__nrlLmcS5XMYfl9zuyg/edit#slide=id.p. I've written a curriculum already including this content but it's not shareable (copyrighted by the bootcamp).\r\n\r\nI will be speaking in English. I know some Spanish, but not enough to deliver a talk in it. I would need travel assistance as I work for myself. I very much enjoy contributing to the community, and I have worked in public education and non-profits in the US, especially in New Orleans. I would love to help the conference attendees learn how to take advantage of the most popular open-source, free tools to build modern web applications. If one of my topics is accepted and I receive travel assistance, I will gladly submit more topics in the unconference portion of the agenda. I have taught Ruby on Rails and written a curriculum for React and Redux (front-end JavaScript). If you are interested, I can also teach longer workshops.","audience_level":"All","tag_list":["javascript","front-end","react","forms","web development","reactjs"],"rating":87.5,"state":"submitted","confirmed":false,"created_at":"2017-05-31T00:38:39.578Z"},{"name":"Sia Karamalegos","email":"siakaramalegos@gmail.com","avatar":"https://secure.gravatar.com/avatar/6e0ba5b45dafe063b98db2a1d5391433?s=500","location":"New Orleans","bio":"Sia Karamalegos is the founder and lead developer for Clio + Calliope Web Development. She has over 15 years of experience in technology, strategy, project management, and operations from small startups to large corporations across multiple industries, especially high-tech and education. She leverages her depth of experience with software engineering to build high-value applications. \r\n\r\nIn both 2015 and 2016, Sia was recognized in the Silicon Bayou 100, the 100 most influential and active people in tech and entrepreneurship in Louisiana. She graduated from Texas A\u0026M University with a BS in chemical engineering and received her MBA from Harvard Business School.","twitter":"thegreengreek","url":"http://www.clioandcalliope.com/","organization":"Clio + Calliope Web Development","shirt_size":"Men's M","title":"Lightning Fast React Apps","abstract":"App loading and run time affect your bottom line. Fancy features aren’t worth anything users leave the app out of frustration. Every second counts! React is super fast, but you could be shooting yourself in the foot with design decisions. Come learn how to make your React apps lightning fast!","description":"Page abandonment increases with every second of load time. Also, profiling and debugging performance issues can seem like an overwhelming topic to learn.. In this session, we’ll cover the usual suspects of performance issues, from the basics of using the correct build, to the fundamentals of immutable data, to higher-level tools like Perf, shouldComponentUpdate, PureComponent, and memoizing computed props in Redux. \r\n\r\nWe will both cover the concepts and walk through examples step-by-step, so that by the end of this session you will feel like a React Speed Racer. You’ll get the most out of this session if you’re at least comfortable with React and ES6 syntax.","notes":"Here are the slides I created for the same topic but shorter duration at a local meetup (delivered in May 2017): https://tinyurl.com/lightningreact. I was accepted to do this talk at Connect.Tech in Atlanta, and I plan to do it at our local BarCamp in July as well.\r\n\r\nI will be speaking in English. I know some Spanish, but not enough to deliver a talk in it. I would need travel assistance as I work for myself. I very much enjoy contributing to the community, and I have worked in public education and non-profits in the US, especially in New Orleans. I would love to help the conference attendees learn how to take advantage of the most popular open-source, free tools to build modern web applications. If one of my topics is accepted and I receive travel assistance, I will gladly submit more topics in the unconference portion of the agenda. I have taught Ruby on Rails and written a curriculum for React and Redux (front-end JavaScript). If you are interested, I can also teach longer workshops.","audience_level":"All","tag_list":["front-end","ux","javascript","react","reactjs","performance"],"rating":67.0,"state":"submitted","confirmed":false,"created_at":"2017-05-31T00:33:51.402Z"},{"name":"Sia Karamalegos","email":"siakaramalegos@gmail.com","avatar":"https://secure.gravatar.com/avatar/6e0ba5b45dafe063b98db2a1d5391433?s=500","location":"New Orleans","bio":"Sia Karamalegos is the founder and lead developer for Clio + Calliope Web Development. She has over 15 years of experience in technology, strategy, project management, and operations from small startups to large corporations across multiple industries, especially high-tech and education. She leverages her depth of experience with software engineering to build high-value applications. \r\n\r\nIn both 2015 and 2016, Sia was recognized in the Silicon Bayou 100, the 100 most influential and active people in tech and entrepreneurship in Louisiana. She graduated from Texas A\u0026M University with a BS in chemical engineering and received her MBA from Harvard Business School.","twitter":"thegreengreek","url":"http://www.clioandcalliope.com/","organization":"Clio + Calliope Web Development","shirt_size":"Men's M","title":"No REST for the weary... Introducing GraphQL","abstract":"RESTful APIs can make fetching data pretty hairy sometimes, but fetching data doesn’t have to be so difficult. Enter GraphQL… the query language where you can ask for exactly what you need with a single HTTP request. Come learn what all the buzz is about!","description":"What is GraphQL? How does it differ from REST? In this session, I’ll answer these questions as well as give you an overview of the open-source ecosystem. Of course, an introduction would not be complete without a demonstration of how to use GraphQL, including queries, resolving, integrating into a front-end app, and more! \r\n \r\nYou’ll get the most out of this session if you’re familiar with JavaScript and ES6 syntax. You’ll get all the fancy concepts you need through code examples. The last part of the demo will show integration with a React app, but it’s not critical that you know ReactJS to learn the fundamentals of GraphQL from this session.","notes":"This talk was accepted to Connect.Tech in Atlanta. I’m also presenting it locally in New Orleans in July. \r\n\r\nI will be speaking in English. I know some Spanish, but not enough to deliver a talk in it. I would need travel assistance as I work for myself. I very much enjoy contributing to the community, and I have worked in public education and non-profits in the US, especially in New Orleans. I would love to help the conference attendees learn how to take advantage of the most popular open-source, free tools to build modern web applications. If one of my topics is accepted and I receive travel assistance, I will gladly submit more topics in the unconference portion of the agenda. I have taught Ruby on Rails and written a curriculum for React and Redux (front-end JavaScript). If you are interested, I can also teach longer workshops.","audience_level":"All","tag_list":["javascript","graphql","react"],"rating":75.0,"state":"submitted","confirmed":false,"created_at":"2017-05-31T00:32:19.613Z"},{"name":"Angélica Delgado","email":"adel24042017@gmail.com","avatar":"https://secure.gravatar.com/avatar/acc5f7caa19760d4e18198e443e3b44b?s=500","location":"Unknown","bio":"Hola! soy Angélica de Venezuela, pertenezco a la comunidad de Software Libre de mis país desde hace mas de 10 años, me interesan los temas de tecnologías para personas con discapacidad, La Educación y el SL y en especial los temas con enfoque de genero.\r\n\r\nTrabajo para el Proyecto Canaima Educativo desde hace mas de 6 años y lo siento como una de las mejores ideas para preparar a l@s activistas de las tecnologías libres del futuro!\r\n \r\nActualmente realizo una tesis sobre la reducción de la brecha digital a través de la implementación de proyectos educativos en las instituciones publicas.\r\n\r\nPertenezco al grupo ActivistasXSL (Activistas por el Software Libre) donde busco apoyar el ingreso de mas mujeres a las comunidades de Software Libre, para así hacer mas diverso el universo de los grupo de tecnologías libres en el país y fuera de él. Soy defensora de la necesidad de empoderar cada día a mas mujeres para poder así tener espacios mas diversos donde se creen mejores ideas.\r\n\r\nFanática de Game of Thrones! ","twitter":"m1a_ve","url":"","organization":"ActivistasXSL","shirt_size":"Women's L","title":"Software Libre y Educación, Una travesía a través del Proyecto Canaima Educativo","abstract":"La charla busca mostrar los beneficios de la implementación del Software Libre en la Educación (básica, diversificada y universitaria) y como el SL ayuda a transformar el proceso educativo respetando la libertad de los usuarios, creando así una educación liberadora.\n","description":"La charla busca mostrar el impacto en la educación cuando se elige trabajar con tecnologías libres, como esto es económicamente mas viable, mas seguro,  como interviene en el proceso educativo y como los estudiantes empiezan a formar parte activa dentro de la comunidad de software libre del país con mas de 5 millones de maquinas entregadas a nivel nacional.\r\n\r\nTambién mientras el impacto en la reducción de la brecha digital al apostar por hacer una educación mas integral apoyado en la base principal del software libre como lo es la libertad del conocimiento.","notes":"Técnicamente solo se necesita un videobeam y un cable HDMI para conectar el portátil.\r\n\r\nActualmente realizo un trabajo de tesis que esta basado en el tema del cual quisiera hablar en la conferencia, trabajo directamente con el proyecto desde hace muchos años y a lo largo de él he estado involucrada en distintas áreas del mismo.\r\nNo tengo miedo escénico lo que me facilita hablar frente a un publico amplio.\r\nEstoy entusiasmada ante la posibilidad de poder volver al CubaConf.","audience_level":"All","tag_list":["canaima","tecnologías","educación"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-05-29T02:28:05.018Z"},{"name":"Angélica Delgado","email":"adel24042017@gmail.com","avatar":"https://secure.gravatar.com/avatar/acc5f7caa19760d4e18198e443e3b44b?s=500","location":"Unknown","bio":"Hola! soy Angélica de Venezuela, pertenezco a la comunidad de Software Libre de mis país desde hace mas de 10 años, me interesan los temas de tecnologías para personas con discapacidad, La Educación y el SL y en especial los temas con enfoque de genero.\r\n\r\nSoy defensora de la necesidad de empoderar cada día a mas mujeres para poder así tener espacios mas diversos donde se creen mejores ideas.\r\n\r\nFanatica de Game of Thrones! ","twitter":"m1a_ve","url":"","organization":"ActivistasXSL","shirt_size":"Women's L","title":"Las mujeres  y sus experiencias dentro de la Comunidad de Software Libre","abstract":"Busca mostrar las experiencias de las mujeres dentro de las comunidades de software libre, siendo el objetivo central empoderar a las asistentes para que formen parte mas activa dentro de las comunidades en sus respectivos países.\n","description":"La idea es hacerlo tipo panel o mesa redonda, en ella pueden participar tanto hombres como mujeres aunque el tema central serán las experiencias de las mujeres asistentes a la conferencia.\r\n\r\n*Que ha determinado su participación o falta de ella dentro de las comunidades de Software Libre? \r\n*Han sido discriminadas por ser mujeres?\r\n*Como es el apoyo de los compañeros en sus países?\r\n*Como construir una comunidad que sea segura para todos?\r\n*Como es la comunidad den sus países? \r\n\r\nLa idea es poder establecer un grupo basado en la experiencia del CubaConf asentando el evento como inicio de un grupo de usuarias con representantes en diferentes partes del mundo y con experiencia y vivencias distintas.\r\n\r\nCreemos el primero grupo de usuarias de la Habana Cuba, porque una mujer informada, es una mujer empoderada!","notes":"Solo un videobeam para mostrar laminas y un cable HDMI para conectar el portátil.\r\n\r\nQuisiera tocar este tema porque es importante no solo sumergirse en la parte técnica de las tecnologías libres, sino brindar espacios seguros para las compañeras que van llegando a las comunidades y que necesitan saber que en ellas se necesita de todas, desde programadoras, diseñadoras, documentadoras, difusoras, etc.\r\n\r\nQuiero hablar del tema porque soy defensora de las equidad de genero dentro de la comunidad de Software Libre y pertenezco al grupo venezolano ActivistasXSL (Activistas por el SL) desde hace mas de 9 años.\r\n\r\nEstoy entusiasmada, conozco del tema y quisiera la oportunidad de establecer contacto con diversas mujeres que albergan diferentes experiencias!\r\n","audience_level":"All","tag_list":["equidad de genero","tecnologías","mujeres","sofware libre"],"rating":100.0,"state":"submitted","confirmed":false,"created_at":"2017-05-29T02:10:12.544Z"},{"name":"Tiago Lopes Ferreira","email":"tiagth@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/3245/lopesferreira.png","location":"Porto","bio":"Tiago is a programmer, web passionate, food enthusiast, sports boy, compulsive reader, traveler, and [#BbackstreetsBackPlease](https://www.youtube.com/watch?v=h4QLZTW8W-I\u0026feature=youtu.be\u0026t=45s) advocate. \r\n\r\nHe’s currently working in the beautiful city of [Porto](https://www.youtube.com/watch?v=jCI5JeL8rSc) for [Betfair](https://twitter.com/betfair). As a JavaScript enthusiast he’s trying to bring the best of front-end to all bet lovers for almost 3 years. Before that Tiago worked for Microsoft as an Infrastructure boy building all the machinery for developers to work. They called it “The heart”. \r\n\r\nHe’s a master from École polytechnique fédérale de Lausanne with a little French inside him and love for [Raclette](https://youtu.be/PXsX4RPMQxI?t=6s). His curiosity and passion have helped him to win Microsoft Imagine Cup. \r\n\r\nNevertheless, Tiago sees himself as a student. **There’s no better cure than books.**","twitter":"ferreiratiago_","url":"https://tiagolopesferreira.com","organization":"Betfair","shirt_size":"Men's M","title":"JS WTF","abstract":"This is simple. **I want to talk about the bad stuff on JavaScript and clarify it so we don't have to discuss it again.** Why? *(Now you sound a lot like my girlfriend)* So we can avoid it and be happy forever. Can we do this? I wish my girlfriend understood this too.","description":"All who have played with JavaScript have felt what R. Kelly believes to be [flying](https://www.youtube.com/watch?v=GIQn8pab8Vc).\r\n\r\nUnfortunately, during these flights we can find some cold breezes that make us think \"What the f*\"*. Well, in JavaScript, these WTFs are just the way it is. Sometimes you're flying just nice, others you're crashing cold.\r\n\r\nLet's fly for a minute:\r\n\r\n`true + true === 2   // true`\r\n\r\n`true - true === 0   // true`\r\n\r\n`true === 1 // false`\r\n\r\nI know the felling 💩\r\n\r\nFortunately, for all weird things there's always an explanation (except maybe for [this](https://www.youtube.com/watch?v=o1eHKf-dMwo)) and JavaScript is no exception.\r\n\r\nIn this talk we will see some of the JavaScript's weirdest things and try to understand how and why they happen.\r\n\r\nThe only requirement for this talk is to listen to [Never Gonna Give You Up](https://www.youtube.com/watch?v=dQw4w9WgXcQ) from Rick Astley. Some of these things are really mind blowing.","notes":"Unfortunately, some of the JavaScript's weird behaviour is actually developers' real struggle to try to understand why their code behaves the way it does. \r\n\r\nJavaScript is amazing but sometimes it can be trick. We can ignore the tricky parts and hope for the best, or choose to be the best by knowing how JavaScript works.\r\n\r\nNo advance knowledge is needed. Only a bit of craziness and fun. And, for course, some open mind. All these are the perfect combo for enjoying even more the magic that we do.\r\n\r\nWe should share our love for JavaScript even when that love comes from those things that we don’t love that much.\r\n\r\nI’m passionate about teaching and sharing. I have been doing some share for [universities](https://www.facebook.com/blip.pt/photos/pcb.10153874029028818/10153874026213818/?type=3\u0026theater), [at my company](https://goo.gl/photos/rdEtJPD1rnwVthh47) and on [some events](https://goo.gl/photos/SNCMPY3R8EFHCQhk6). \r\n\r\nUnderneath that I have some crazy and fun with me. I’m a huge advocate of learning while smiling.","audience_level":"Intermediate","tag_list":["javascript","wtf","crazy","fun"],"rating":87.5,"state":"submitted","confirmed":false,"created_at":"2017-05-25T17:38:33.860Z"},{"name":"Maxim Salnikov","email":"salnikov@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/2867/Maxim_Salnikov_-_Norway_-_GDE.png","location":"Oslo","bio":"Maxim Salnikov is Oslo-based Web UI Engineer, a Google Developer Expert in Web Technologies and Angular. He develops complex web applications since the end of the last century and has extensive experience with all aspects of web front-end: UX/UI prototyping, HTML/CSS/JS, main frameworks, architecting RESTful APIs. \r\n\r\nMaxim is a founder and active contributor to two conferences: Mobile Era and ngVikings - Nordics’ main conferences for mobile and Angular developers respectively. Also, he leads Norway’s largest meetups dedicated to web front-end and mobile: Framsia, Angular Oslo, Mobile Meetup Oslo.\r\n\r\nMaxim is passionate about sharing his web front-end experience and knowledge with the community. He travels extensively for visiting developers events and speaking/training at conferences and meetups around the world.","twitter":"webmaxru","url":"https://developers.google.com/experts/people/maxim-salnikov","organization":"ForgeRock","shirt_size":"Men's M","title":"Pragmatic Angular: The only tutorial you've been missing","abstract":"Let's have a look at the state of the web platform:\n- Which issues could be solved even simpler by using Angular\n- What are the best practices on these\n- How the code could look like for some real life examples\n- ...And when Angular is not the best choice (do you remember \"pragmatic\" in the title?)","description":"Let me guess: as a web front-end developer you've read a lot of articles, blog posts, watched some sessions where they introduce the frameworks, or, on the contrary, go too deep into specific details, or even compare ones with others, sometimes in a very passionate way. I'm here with another approach.\r\n\r\nLet's have a look at the state of the web platform and requirements for the applications we build. How can we fulfil the last ones using incredible power of modern browsers' possibilities. Only after having the problem/solution list ready, we will check:\r\n- Which issues could be solved even simpler by using Angular\r\n- What are the best practices on these\r\n- How the code could look like for some real life examples\r\n- ...And when Angular is not the best choice (do you remember \"pragmatic\" in the title?)\r\n\r\nAs a takeaway from this session, you will have a better overview of web platform new features, how to use them to build high-quality apps, and a rational decision on when (and - the most important - how) the Angular could work for you.","notes":"As an organizer of Norway's Angular community and founder of Nordics main Angular conference, it is difficult to prove my impartiality :) But I strongly believe - only the rational, pragmatic content brings real value for the developers community, which I'm really passionated to contribute to. I held dozens of front-end sessions for local and international conferences, and I've found a way to build my talks the way they are useful for the attendees.\r\n\r\nIt makes sense to have at least one session about Angular at the conference, and I tried to build the one capable of satisfying a wide range of interests to this framework. As an Google Developer Expert in Angular and Angular contributor, I know this framework from inside and can deliver the best possible technical session. Again, no bias, only facts, both strong and weak sides.\r\n\r\nI hope to gather all the web front-end developers, who wish to deepen knowledge of the web platform possibilities. The frameworks are just tools (there is no silver bullet), and choosing the proper one could make your developer experience better, and your customer happier. No \"react VS angular VS framework-of-the-week\", no bias, no \"passion\". Just facts and rationales. The final decision is up to the attendee.\r\n\r\nThere will be some examples of \"best practices\" and \"real life solutions\" code in the slides.","audience_level":"Intermediate","tag_list":["angular","observables","frontend","frameworks","modern web","best practices"],"rating":100.0,"state":"declined","confirmed":true,"created_at":"2017-05-15T21:53:38.855Z"},{"name":"Chelsea Bullock","email":"chelsea.bullock@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/8391/VSCO_Cam-1.jpg","location":"Atlanta, GA","bio":"Chelsea Bullock is a UX Researcher for IBM at The Weather Company, specializing in research that directs strategy and shapes product design. In a past professional life she taught university students how to critically think about the politics of reality television. She most loves projects that enable her to combine cultural critical inquiry with technological innovation. She organizes events around Atlanta with Women Who Code: Atlanta. Her personal website is chelseabullock.com. Chelsea holds a BA in English from Columbus State University and a PhD from University of Oregon in English and Media Studies.","twitter":"chelsea_bullock","url":"http://www.chelseabullock.com","organization":"IBM at The Weather Company","shirt_size":"Women's L","title":"How to Make Your AI a Better Person","abstract":"As AI technologies evolve, we must be mindful of progressing the politics composing them. How do we render these politics transparent and develop rigorous processes for interrogating them? This talk will consider how to influence the politics of building AI and cognitive technologies.","description":"I want to present some thoughtful strategies for evaluating bias built into cognitive technologies. I will equip people with tools that might look like a checklist/rubric of questions developed to interrogate bias from an intersectional feminist perspective concerned with social justice across identities varied in race, gender, class, and sexuality. As a UX Researcher, I am not an AI developer, but I partner with teams building those technologies and maximize opportunities for interventions like these. I want to encourage others to do the same, even in varied technological capacities and proximities to AI/cognitive technology development.","notes":"I will need projection with (possibly) video + audio.","audience_level":"All","tag_list":["ai","cognitive","politics","feminism","emerging technologies","feminisms","ethics","bias","research"],"rating":80.0,"state":"accepted","confirmed":true,"created_at":"2017-05-01T17:37:11.645Z"},{"name":"Sergey Bolshchikov","email":"sergey@bolshchikov.net","avatar":"https://secure.gravatar.com/avatar/f0fbd607aab5c6ec39213d2a24fbf339?s=500","location":"Israel","bio":"Team Lead at Wix with great passion to technology and knowledge sharing with 9 years of experience. Co-organizer of YouGottaLoveFrontend Conference and Ember-IL meetup group in Tel Aviv, Israel. \r\nM.Sc. in Information Systems from Technion - Israel Institute of Technology.\r\nhttp://bolshchikov.net ","twitter":"bolshchikov","url":"http://bolshchikov.net","organization":"Wix","shirt_size":"Men's M","title":"Writing #microservices in React and Angular","abstract":"In this talk we will discuss the design principles and architecture of large scale multi-tenant mobile and web applications that serve as a foundation for the mobile and web.\n\nYou will learn how to apply those principles and techniques at scale of over 10 teams, while embracing existing frameworks.","description":"\r\n# Project evolution\r\n### Stage 1\r\nClassic framework (Angular or React + Redux/Mobx). Pushing code, all fine. Growth starts. Growth in terms of features and people.\r\n### Stage 2:\r\n1. Push into my repo. \r\n(+): access to everything\r\n(-): decreased test coverage, css fucksups, messed state, monolith deployment\r\n2. I’ll put you inside the iframe. \r\n(+) nobody is messing up my code, independent deployments \r\n(-) post messages, hard integration, complicated reuse.\r\n\r\n# Our objective\r\n### We need to build an SPA\r\n1. Isolated modules\r\n1.1. Easy communication and reuse\r\n1.2. No iframes\r\n2. Framework/Library agnostic\r\n3. We are big (multiple teams)\r\n3.1. Support of existing code in Angular\r\n3.2. Enable new modules in React\r\n3.3. Separate deployables\r\n3.4. Lazy-load of modules\r\n# How we did it\r\nLive demo of application. It consists of \r\n* Shell app\r\n* React app\r\n* Angular app\r\n* Create manifest.js\r\n* Extend angular lazy component\r\n* Register component\r\n* Specify files\r\n* Remove files from index.vm\r\n* Specify module\r\n* Specify component\r\n* Add another entry to package.json\r\n* Load manifest in index.vm\r\n* Instantiate component\r\n* Pass topology\r\n## Explanations\r\n* Module registry\r\n* Component\r\n* Events\r\n* RPC\r\n* Angular Lazy Component\r\n* React Lazy Component\r\n# Why it might be useful to you\r\n1. Wix one app\r\n2. Separate deployables\r\n\r\n\r\n\f\r\nDemo:\r\n","notes":"","audience_level":"Intermediate","tag_list":["javascript","react","angular","architecture","large-scale","microservices"],"rating":87.5,"state":"accepted","confirmed":true,"created_at":"2017-05-03T16:03:35.977Z"},{"name":"Bhavani Shankar","email":"right2bhavi@gmail.com","avatar":"https://secure.gravatar.com/avatar/78ec69a957b136c0d733f40ebdd1d1c9?s=500","location":"Unknown","bio":"Bhavani Shankar is a cerebral palsy affected guy who has around 7 years of experience in the IT industry, presently working as a senior consultant in Accion Labs Pvt limited in an automation specialist role.\r\n\r\nApart from his work at Accion Labs he is an active ubuntu community contributor from the past 8 years in various roles from being an active contributing member to a developer to being on the governance councils in the ubuntu community.\r\n\r\nMore info about his ubuntu work\r\n\r\nLaunchpad Profile: https://launchpad.net/~bhavi\r\nWiki page: https://wiki.ubuntu.com/BhavaniShankar\r\n\r\nA recipient of various international awards too for his work in the opensource and disability sector. Some of them below\r\n\r\nA silver medal and an achievement award from UNESCAP, United Nations, Bangkok, in October 2013, for his outstanding performance in Global IT challenge for youth with disabilities event\r\n\r\nAwarded Helen Keller Award as a role model for persons with disabilities for his work in IT and open source in December 2013.\r\n\r\nhttp://dnis.org/NCPEDP-Shell-Helen-Keller-Award-Brochure-2013.pdf\r\n(Page no 10 has citation of his work)\r\n\r\nAwarded Aryabhata International award 2013 in the state of Karnataka for his contributions to IT field.\r\n(http://www.ibcnews.in/2014/06/18/aryabhata-awards-for-the-year-2013-announced-to-be-presented-on-22nd-june-at-ravindra-kalakshetra/)\r\n\r\nNominated for National Award as a role model with disabilities by Govt of India 2013, 2014, 2016 ","twitter":"","url":"https://launchpad.net/~bhavi","organization":"Accion Labs, Ubuntu community","shirt_size":"Men's XL","title":"Python + Rest API's +UI = A tester's treat in openstacky way :)","abstract":"A common notion is that python is majorly a scripting language widely used for some automation tasks or a developer oriented tightly coupled language.\n\nThis talk would give an overview and a treatise on Automation testing with selenium and would give a 30k feet view of automation simplified.  ","description":"This talk would mainly focus on using python as a language and a framework for automation testing where I would intend to cover the below with Opencafe and selenium with python.\r\n\r\n- ReST API/SoAP API automation framework development using opencafe\r\n- Rigging up tests for API testing using roast part of opencafe\r\n- Performance testing of API\r\n- Regression testing\r\n- Integration of opencafe stuff with a CI like Jenkins\r\n\r\nApart from this I would like also to give an overview of integration of vanilla selenium with python for UI and browser testing.\r\n\r\n\r\n","notes":"This talk would require a basic linux or mac system preferably running python 2.7 (recommended)","audience_level":"Beginner","tag_list":[],"rating":87.5,"state":"accepted","confirmed":true,"created_at":"2017-02-16T06:26:31.423Z"},{"name":"Dario Badagnani","email":"dario.badagnani@gmail.com","avatar":"https://secure.gravatar.com/avatar/097e8912bf64837fc6fc3b81d329fb14?s=500","location":"Unknown","bio":"Born in Mar del Plata, Arg. Graphic designer, and for the last 12 years an activist promoting open source software.\r\n ","twitter":"DaFeBa_foto","url":"http://vamox.blogspot.com","organization":"VMO design","shirt_size":"Men's XL","title":"Vamox Project, 10 years on the Libre side ","abstract":"Vamox started while in the University, we want to learn without been called \"pirates\". As graphic designers we wanted to help in the Software Libre community, and making a statement of what should be the content in Public Universities. A Graduation Thesis and much more stuff made for an open ideal.","description":"in 2007 We started a migration to open source software for graphic design, and starting to think what our graduation thesis should be. In one hand many people told us horror stories of great ideas being stolen, in the other we wanted to help our University and community. Why not both?\r\n\r\nFrom them we did a lot of research, of the problems in our education, what was \"free as in freedom\" and a research about the history of the GUI.\r\nWe had a crazy idea: making a complete redesign of a Operating System, showing what you can do with open tools, on a open OS, and sharing the result. In 2008 we needed to convince our professors of this crazy idea, and then making it.\r\n\r\nIn december 2008 we completed our graduation thesis, and hours later was online, with many unexpected results: hosting bandwidth exhausted, many sites thought it was a new distro, lots of downloads in gnome-look.\r\n\r\nSince then we keep using open source tools, making activities to promote them, fighting those who gain from ignorance and fear.","notes":"","audience_level":"All","tag_list":["interface","design","gui","icons","graphic design"],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-02-10T16:18:00.543Z"},{"name":"Sumanth Damarla","email":"damarla.sumanth@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/2495/sims.jpg","location":"India","bio":"Security Evangelist, Mozilla Tech Speaker from Mozilla, India. Conducted series of events related to Web security.Part of Mozilla team which represented FOSSASIA 2015. Done a project for Mozilla Security team under MWoS 2014. Worked with former security developer at US NSA under OWASP Summer code sprint 2015. Invited as sponsored facilitator for Mozfest 2015 (London), Mozilla Leadership Summit 2016 (Singapore) and Mozfest 2016 (London). Invited as speaker for FOSSASIA 2015, I.T.A.K.E Unconference'16(Romania), OSCAL'16(Albania), Riviera Dev 2016 (France), FOSDEM 2017 (Belgium), United Dev Conf 2017 (Minsk, Belarus) and cf.Objective() 2017 (Washington DC, USA). Recent talk was given at Voxxed Days 2017 (Bristol,UK) on Web Security.  Trained by \"Denise Graveline\" (The Eloquent Woman) as part of tech speaker training at Mozilla.","twitter":"Sumanth_Damarla","url":"https://sumanthmoz.wordpress.com","organization":"Mozilla (volunteer role)","shirt_size":"Men's L","title":"Securing the Web","abstract":"With the right skills, tools and software, you can protect yourself and remain secure. This session will take attendees from no knowledge of open source web security tools to a deep understanding of how to use them and their growing set of capabilities.","description":"This session focuses on building Web Security Awareness. Its helps the attendees to build their web applications more securely using Web Security Tools. With the help of websecurity tools, People can attack their own designed Web applications and check for the vulnerabilities in their applications and code it more securely.  \r\n\r\nFor an instance, Assume a coder created Login page, He can use ZAP (Mozilla Security Automation Project) to attack his Login page and sort out the ways to trace out the flaws. In this way ZAP gives the coder chance to build their Web Application more securely. (Though its only one of the many features of ZAP).\r\n\r\n### Session Plan: [Talk duration: 45min]\r\n\r\n-\u003e Importance of Web Secuirty - 5min\r\n\r\n-\u003e Discussing OWASP Top 10 vulneribities [Each vulnerabity will take 1min for discussion] - 10min\r\n\r\n-\u003e Discussing on available open source security tools such as OWASP ZAP, Vega Scanner, Open VAS, Nikto and Uniscan. [5 tools X 3min] - 15min\r\n\r\n-\u003e Live Demo [Scanning vulnerable web application to detect vulnerabilities and various other features of the ZAP] - 10min\r\n\r\n-\u003e QA - 5min\r\n\r\n### Outcome:\r\n\r\nThis session would be able to show path for the attendees how he/she can contribute to Mozilla in Security Aspects. The participant can be able to learn following areas:\r\n\r\n→ Participant will grasp detailed knowledge on how a web application functions on browser and how he/she detect vulnerabilities. (By learning from OWASP Top ten vulnerabilities )\r\n\r\n→ Solving vulnerabilities.\r\n\r\n→ Contributing to open source security tools.\r\n\r\n→ Working on bugs related to vulnerabilities issues.\r\n\r\n→ Start contributing to ZAP or other open source security projects in both tech/non-tech aspects.","notes":"This talk focuses on bringing awareness on importance of web security for Web Developers. The talks deals with the major threats posed for web applications and the ways to overcome them. I am going to introduce an open source web application tool which ranked first as Top Web Security tool be \"toolswatch.org\". It is ZAP(Zed Attack Proxy). I am ZAP Evangelist for India. The session would also focus on other available open source web security tools to make session technology agonistic. I had worked on a project for ZAP under Mozilla Winter of Security 2014 with Mozilla Cloud Security team. I have experience of taking sessions related to web security. My recent talk was given at “Voxxed Days 2017” happened in Watershed at Bristol, United Kingdom. I am part of Mozilla Tech Speakers team. I am comfortable to speak about different security aspects. I have experience of working with former Security Developer from US NSA(National Security Agency) as Summer Intern at OWASP. Trained by \"Denise Graveline\" (The Eloquent Woman) as part of tech speaker training at Mozilla. These all experiences will make me right person to handle this session with at-most organized way.\r\n","audience_level":"Intermediate","tag_list":["pentester","security","html","java","opensource"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-04-04T10:24:01.195Z"},{"name":"Patrick Kettner","email":"patrickkettner@gmail.com","avatar":"https://secure.gravatar.com/avatar/3fada965c1f65adc0599bb9cd606524d?s=500","location":"seattle","bio":"Patrick Kettner won an 8th grade talent show singing Gloria Gaynor's 1978 disco hit \"I Will Survive\", and things have been looking up ever since. He has traded in the golden microphone for a PM position on Microsoft Edge, as well as being the lead developer for Modernizr. He lives in Seattle with his wonderful partner Katrina, son Holden, and dog Baxter.","twitter":"patrickkettner","url":"https://github.com/patrickkettner","organization":"Microsoft","shirt_size":"Men's L","title":"Modern Websites for the Modern Web","abstract":"You shouldn't wait to use the latest browser APIs. Through progressive enhancement and some clever JS, I will discuss creating feature rich and super fast front end applications, integrating over a dozen cutting edge web features, all while supporting even the oldest of web clients.","description":"It seems like new APIs for the web are released every week. It would be cool to be able to use them, but if you need to make websites for the average user, you won't be able to use them for years - right? Wrong. I will go over how creating feature rich and super fast front end applications, integrating over a dozen cutting edge web features, all while supporting even the oldest of web clients. If you want to see a 100% client side offline enabled application work in every browser to Mosiac, and even be ported to a command line GUI (yes GUI), come check it out!","notes":"As both an employee of a browser, and the lead developer for Modernizr, I am very well equipped to discuss cutting edge APIs and what is plausible on the web. But even more so, I am skilled creating a progressively enhanced version of the latest and greatest so that the web \"just works\", for everyone. It would be an absolute honor to share my experiences with you, and to learn even more from the attendees and other speakers.","audience_level":"All","tag_list":[],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-05-13T08:01:19.253Z"},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim, a Community Engineer, has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to develop technical people, ideas, organizations, and communities. Her current efforts focus on creating environments that support the sharing of common attitudes, interests, and goals. \r\n\r\nShe is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, KimCrayton1 on Medium.com, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects The ABC’s of Coding, Tech Talk For Non-Techies, #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"What The Doc?!?! How to Write and Read Documentation That Allows You To Get Shit Done!","abstract":"Documentation tells the story of your code, application or community and like any great story, effective communication is key. ","description":"Details:\r\nOften documentation is treated as an afterthought and an undesirable part of the creative process but it doesn’t have to be. Documentation can be seen as your effective and efficient method for you to tell your story in a comprehensive and engaging way. What the Doc?!?! will help both the writer and reader \r\n\r\nLearning Outcomes:\r\n- The development of a checklist of issues to consider when writing technical documentation\r\n- Ideas for making the creation and maintenance of documentation an integral part of development process \r\n- Tips for helping newbies with reading technical documentation\r\n- Tips for building and engaging your community around your documentation ","notes":"Presentations on YouTube \r\nhttps://www.youtube.com/playlist?list=PLEJ1RnaQ_swh7wiD80NSSLu8UrOv3DiQ6\r\n\r\nJazzCon.tech (start viewing at 1:04:15) https://www.youtube.com/watch?v=RgDFKYURKPA\r\n\r\nCodeNewbie Podcast: http://bit.ly/2oY9y36","audience_level":"All","tag_list":["documentation","community","newbies","writing documentation","reading documentation","commenting code","open source","read me"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-05-07T02:02:44.121Z"},{"name":"Marco Otte-Witte","email":"marco.otte-witte@simplabs.com","avatar":"https://secure.gravatar.com/avatar/3179e6bb62dc91d29bb906ffef4fa2d4?s=500","location":"Munich, Germany","bio":"Marco has been working in web engineering for about 15 years and has used all kinds of technologies in projects of all kinds of sizes. His company simplabs offers custom engineering services, consulting and training. simplabs specializes in Ember.js, Ruby on Rails and Elixir/Phoenix.","twitter":"marcoow","url":"https://simplabs.com","organization":"simplabs","shirt_size":"Men's S","title":"The (crazy) state of modern web dev in 2017","abstract":"Having to solve challenges arising from an ever more capable web platform and increased user expectations leads developers to jump on one hype train after the other, ignoring the downsides. I'll show how conventional and proven technologies can solve the same problems with less boilerplate work.","description":"As the Web Platform becomes ever more capable, web applications are increasingly ambitious and users adopt their expectations along the way. This leaves developers with numerous challenges to solve that were mostly unheard of even one or two year ago. While there is a plethora of solutions to these problems available and new ones are popping up each day, most of these are not yet based on well established patterns and conventions, leaving developers with having to connect the dots themselves. Doing so means teams spend a significant amount of their time not building the core product and generating business value but figuring out solutions to more fundamental challenges.\r\n\r\nIn this talk I'll show how conventional solutions backed by vivid communities as well as established, proven tools liberate teams from solving problems that should not actually be in their problem domain at all. Instead they can focus on iterating on their core product while still keeping up with the latest and greatest in web technology and meeting ever increasing user expectations. We will look at all levels of the stack and cover backend and frontend as well as the data transport layer between the two.","notes":"I'm actually working on a better title for this but haven't really settled on one yet. Currently I'm thinking about \"The hypetrains are going nowhere - join me on the productivity train!\" but it seems slightly too long.\r\n\r\nI will use Ember.js, Elixir/Phoenix, PostgreSQL and JSON API (which is the stack we have lots of experience in) as examples for proven technologies and conventional solutions that liberate devs by imposing constraints on them.\r\n\r\nI have worked with conventional frameworks both on the server as well as on the client side for the last 10 years and wouldn't want to go back to rolling my own solutions again - something I witness a log of developers doing in a false believe that it is somehow necessary to roll your own if you want to build a truly great web app. Many developers would totally ignore the downsides that rolling their own solutions have and won't see how the effect of doing so is often even negative in performance etc. I have also used many of the hyped NoSQL datastores and witnessed all the problems that come with them first hand. I often see teams making the same mistakes that I made and think it's time to rethink what the core of our jobs is which is to create business value and iterate on our core products instead of creating and maintaining our own customized solutions only to (perhaps) optimize everything to the max (which is often irrelevant or results in the opposite even).","audience_level":"Intermediate","tag_list":["javascript","elixir","phoenix","rest","full stack"],"rating":90.0,"state":"accepted","confirmed":false,"created_at":"2017-02-10T16:33:36.600Z"},{"name":"Jacobo Nájera","email":"jacobo@metahumano.org","avatar":"https://secure.gravatar.com/avatar/8758aa97b32abb81451612dc40a45b64?s=500","location":"Unknown","bio":"Me intereso en investigar las relaciones entre ciencia, artesanía y derechos humanos, así como desarrollo redes para infraestructuras y sitios web de medios independientes. He contribuido con investigación y diseño de tecnología para la Free Software Foundation y Wikimedia. Actualmente realizo investigación en Enjambre Digital, opero nodos de la red Tor e integro el comité de dirección de MayFirst People-Link.","twitter":"","url":"","organization":"","shirt_size":"Men's M","title":"Una perspectiva comunitaria para enfrentar los ataques informáticos","abstract":"Presentación sobre alternativas de aprendizaje y desarrollo para hacer frente a las amenazas que representan los ataques informáticos y sus modelos de negocio.","description":"Los ataques informáticos como negocio lucrativo cada vez se discuten más públicamente por sus escalas, complejidad, organización e impacto en las infraestructuras de comunicaciones. Por lo que las capacidades de contención de los mismos se vuelven crecientes. En la presente ponencia nos enfocamos en alternativas concretas de aprendizaje y desarrollo de tecnología comenzadas y mantenidos desde algunas comunidades y sociedad civil para hacer frente a las amenazas, riesgos y efectos que representan los ataques informáticos y sus economías.","notes":"","audience_level":"All","tag_list":["aprendizaje","ataques informáticos","comunidad"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-05-23T05:45:26.690Z"},{"name":"Víctor Leonel Orozco López","email":"victororozco@shekalug.org","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/10312/barcelona.jpg","location":"Guatemala area","bio":"Víctor Orozco holds a master in Computer Science by Universidade Federal de Santa Maria (Brazil) awarded with a scholarship from the Organization of American States.\r\n\r\nCurrently he leads the Guatemala Java Users group (the biggest Java user group in Central America) and is one of the Duke’s Choice Award 2016 winners. Recently he was invited as instructor on the new edx.org micromasters in the course Java Fundamentals for Android.\r\n\r\n“By day” he is the CTO and founder of Nabenik S.A. a software development studio for Central American market, focused on enterprise applications (mostly Java) and mobile development. He is also a member of the computer science deparment at Universidad Rafael Landivar (Guatemala) in charge of AI and Machine Learning areas.\r\n\r\nAs speaker he has participated in the following prestigious events:\r\n\r\n* Reaching the lambda heaven • DevNexus - Atlanta, GA, United States • Feb 2017\r\n\r\n* Increasing the Maturity of Our Java User Groups • Java One - San Francisco, CA, United States • Sep 2016\r\n\r\n* A new approach to improve accuracy in information security risk management • Eighth International Conference on Digital Society - Barcelona, Spain • Mar 2014\r\n\r\n* Opinions classification in information security risk assessments with social networks analysis • XXXIII Congresso da Sociedade Brasileira de Computação (CSBC 2013) - Maceio, AL, Brazil • Apr 2013\r\n\r\n* Distributed compilation with Distcc and Icecream clusters using Gentoo, a benchmarking study case • Forum Internacional de Software Livre (FISL) - Porto Alegre, RS Brazil • Apr 2012","twitter":"tuxtor","url":"https://www.vorozco.com","organization":"Guatemala Java Users Group","shirt_size":"Men's L","title":"The Duke Adventures: How we won the Java's Oscar by Increasing CS literacy in Guatemala","abstract":"Guatemala Java User Group created the project \"Dukes Adventures\", by partnering with education institution, JUG members traveled through the country promoting computer science as a path for development with workshops and conference, winning the prestigious Duke's Choice Award due their efforts.","description":"Guatemala is one of the less developed countries in University attendance between Latin America, currently the government estimates that just only 2% of the university-age population has access to university education and only 7% of the original 2% obtain a university degree -i.e. 0.29% of the population -, being one of the countries with less students pursing degrees in science and technology.\r\n\r\nHowever, it is widely known that you do not need a university degree to shine in the IT field if you work hard. As result, computer science is gaining momentum in Guatemala as a path to personal and economic development.\r\n\r\nIn GuateJUG we wanted to support this task and in 2015 to promote our annual conference \"Java Day Guatemala\" we started a journey through \"forgotten\" places in our country, creating the \"Java Day Guatemala Tour\" project, being renamed as \"The Duke Adventures\".\r\n\r\nWith the collaboration of local study centers -e.g Universities, high-schools and elementary schools- we started a trip to the four coordinates of the republic, combining two of our passions:\r\n\r\n*  Traveling in our country\r\n*  Java\r\n\r\nBy organizing bootcamps, conferences and workshops, GuateJUG members and volunteers shared their knowledge of Java technologies (and related) on any of its platforms, contributing to the development of the country by empowering people with IT tools in order to pursue careers, business and knowledge in computer science.\r\n\r\nFor us, the Duke adventures has been an opportunity to re-discover the country, make friends in each region, and generate a positive impact on people's lives, while generating a positive impact on us. Just needed, a laptop, a backpack and a good excuse :).\r\n\r\nFor the Java Community it meant a successful model for educational outreach, receiving as consequence the most prestigious prize in the Java world, the Duke's Choice Award 2016 (https://www.oracle.com/javaone/dukes-choice-award.html).\r\n\r\nCurrently Guatemala JUG is working in creating new communities and replicating the tour format, which will be described on the talk, as well as our experience on doing nation wide tours.","notes":"You can check out the project at http://www.guate-jug.net/duke-adventures/","audience_level":"Beginner","tag_list":["education","computer science","java"],"rating":90.0,"state":"accepted","confirmed":false,"created_at":"2017-03-03T20:23:38.618Z"},{"name":"Angel Banks","email":"angelicambanks@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/8311/angel_bio.jpg","location":"Atlanta, GA","bio":"Angel Banks specializes in UX strategy and design for enterprise, finance, healthcare, and biotech applications. She currently works as a UX designer at First Data. Angel has a background in project management, product management, and front-end development. Active in the Atlanta tech community, she was a co-organizer of the ATL AngularJS meetup group and is now on the leadership team of Women Who Code Atlanta and a UX and Coding Mentor at General Assembly. ","twitter":"angelmbanks","url":"http://angelbanks.com/","organization":"Women Who Code","shirt_size":"Women's 2XL","title":"When developer must become designer; how to be a one-person UX team","abstract":"This talk will help developers learn the soft skills they need to acquire in order to be \"one-person\" UX team. ","description":"As a developer with limited resources, experience, and time, how can you embrace your inner UX designer? What is UX and why should you care? Is there really a difference between UX and UI? Which design tools should you use? \r\n\r\nIn this session I’ll provide you a UX checklist to take you from developer to designer/developer. ","notes":"","audience_level":"All","tag_list":["ux","ui","toolkit","design","developer","programming"],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-03-30T17:07:40.374Z"},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"​ Overcoming the Challenges of Mentoring","abstract":"Successful mentoring doesn’t just happen, it’s planned. Let’s talk about what mentoring is, what it is not, and what makes for an effective mentorship.","description":"​There is an ongoing mantra within the developer community: that there are far more jobs available then programmers to fill them. Which should be an indication as to the wonderful potential for both business and those learning to code. Yet what often follows such statements are not words of joy but rather a list of frustrations related to the difficulty in finding and retaining enough skilled developers to fill these positions. \r\nThe challenge is not in the number of newbies entering the field but the number who leave because they are not able to bridge the divide between bootcamps, online tutorials, books, videos, etc. to an employable developer who is able to contribute to the team. \r\nKim has years of experience working with learners of various ages in helping them develop the skills they needed to be successful at whatever their chosen goal. She understands that for businesses to be successful, they must develop more effective and efficient ways of recruiting and retaining developers in order to meet organizational benchmarks. \r\nThe developer community is a overwhelmingly generous one and a well designed mentoring or apprenticeship program could be one answer that business leaders and newbies are looking for.\r\n\r\n- The business costs associated with corporate hiring managers inability to recruit and retain skilled workers to fill current and future entry-level positions are increasing (Queen, 2014). \r\n- 89 percent of organizational leaders stated that they are having difficulties filling open positions, which is causing them to either turn down orders, miss key deliverable deadlines or hire individuals from outside of the United States (Aho, 2015). \r\n\r\nAho, K. (2015). The robotics industry: creating jobs, closing the skills gap. Techniques, (7), 22. Retrieved from https://www.acteonline.org/techniques/#.VpMcQq6rR0s\r\n\r\nQueen, J. (2014). Hire power: to close the skills gap, states are teaming up with industries that need, but can't find, qualified workers. State Legislatures, (8), 16. Retrieved from http://www.ncsl.org/bookstore/state-legislatures-magazine.aspx","notes":"Talk ​Details:\r\n1. ​Understanding that there is a difference between personal/professional mentoring and youth/adult mentoring.\r\n2. A clarification of what mentoring is not.\r\n3. An explanation of what mentoring is.\r\n4. A review of factors for effective mentoring for both mentor and mentee.\r\n5. Reasons the development community could benefit from a planned mentoring approach.\r\n6. Several personally designed activities to engage audience participation (depending on the session time-frame)","audience_level":"All","tag_list":["mentoring","junior developers","professional development"],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-03-09T15:07:41.477Z"},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim, a Community Engineer, has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to develop technical people, ideas, organizations, and communities. Her current efforts focus on creating environments that support the sharing of common attitudes, interests, and goals. \r\n\r\nShe is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, KimCrayton1 on Medium.com, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects The ABC’s of Coding, #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"What is Community Engineering?","abstract":"Community Engineering - Is the intentional and skillful effort of creating environments which support the sharing of common attitudes, interests, and goals in order to grow a more diverse and inclusive technology community. ","description":"All too often, efforts for creating more inclusive communities are not successful because of 3 major assumptions held by community members: \r\n1. “They know who we are”\r\n2. “They know what we do”\r\n3. “They will figure it out”\r\n\r\nLet’s explore strategies that can be used to overcome the obstacles related to the 3 assumptions standing in the way of community growth.","notes":"I have years of experience working with diverse communities helping them to better engage and support the initiatives that are meaningful to them. Here are a few testimonials related to my working in various communities (they can be found on my LinkedIn page https://www.linkedin.com/in/kimcrayton/): \r\n\r\n\"Kim is a dynamic community cultivator who brings together two incredible strengths in a rare but essential combination. Firstly, she has a thoroughly infectious personality. Her interactions on stage as well as in person are energizing and inspiring. Secondly, she brings a sharp, effective ability to hone in on what needs to be done and, most importantly, who is going to do it. Kim is a conscientious listener, a gracious mentor and an unparalleled leader with a great heart for developing vital communities. It's my sincerest hope that I will get to work with Kim again!\"\r\n\r\n\"Kim understands that the true challenges of our tech driven world do not lie in finding better coders, but in creating and maintaining a space where a team of creatives can flourish. With her endless energy, motivation and endurance, Kim makes the perfect person to have to get the best out of your team. And with her great network and empathy, Kim has access to a bigger talent pool than anyone I ever met before. I can’t recommend Kim enough, and I’m already looking forward to the time our ways will cross again.\"\r\n\r\n\"Kim is an excellent individual who is very passionate about Tech, as I've come to realize. Her thirst and expertise in meeting people and making connections that matter is second only to her passion and admiration for all things tech.\"","audience_level":"All","tag_list":["community","inclusion","diversity","strategies","technology","open","welcoming"],"rating":70.2,"state":"accepted","confirmed":true,"created_at":"2017-04-06T15:41:19.127Z"},{"name":"gerardsans","email":"gerard.sans@gmail.com","avatar":"https://secure.gravatar.com/avatar/67c5b4074981e4c2b01566d95f9e0a28?s=500","location":"London ☂","bio":"Gerard is very excited about the future of the Web and JavaScript. Always happy Computer Science Engineer and humble Google Developer Expert. He loves to share his learnings by giving talks, trainings and writing about cool technologies. He loves running AngularZone and GraphQL London, mentoring students and giving back to the community.","twitter":"gerardsans","url":"https://medium.com/@gerard.sans","organization":"GraphQL London Community","shirt_size":"Men's XL","title":"Presentando HandsUp: una simple App de codigo libre de preguntas y respuestas para cursos, conferencias o eventos","abstract":"Con esta sencilla Aplicación los asistentes a un evento pueden realizar preguntas que los organizadores pueden usar para paneles o durante charlas sin interrumpir. HandsUp facilita la participación registrando preguntas y votos de los asistentes usando el móvil resultando en una participación mayor.","description":"En esta charla vamos a describir la arquitectura técnica, su uso y como beneficia la dinámica durante cursos, conferencias o eventos. La intención es ayudar a la comunidad con una herramienta gratuita para substituir el gesto de levantar la mano, que no funciona tan bien, durante eventos con muchos asistentes.\r\n\r\nEscribí un articulo explicando como funciona y facilitando acceso al código usando GitHub.\r\nhttps://medium.com/@gerard.sans/building-handsup-an-os-real-time-voting-app-using-graphql-and-react-b2b7dcd0e136\r\n","notes":"Para esta charla necesito mi ordenador con conexión HDMI y acceso a Internet. Tengo la certificación de Google Developer Expert por mis actividades sin animo de lucro para la comunidad: charlas en comunidades locales, ponencias en conferencias en Europa y Estados Unidos, laboratorios y artículos técnicos online.\r\n\r\nhttp://lanyrd.com/profile/gerardsans","audience_level":"Intermediate","tag_list":["apollo client 1.0","react","graphql","javascript"],"rating":80.0,"state":"accepted","confirmed":true,"created_at":"2017-05-18T16:16:16.946Z"},{"name":"George Mandis","email":"george.mandis@gmail.com","avatar":"https://secure.gravatar.com/avatar/251e68e988d4c3b1d05022ffd27ac58e?s=500","location":"A pale blue dot","bio":"George Mandis has been a freelance, full-stack  web developer and consultant to  startups, small businesses, professional sports teams and entrepreneurs for over a decade. Recently he spent a year living as a digital nomad, inadvertently cheated while running a marathon in North Korea and ran a coding bootcamp out of Portland, Oregon. He writes frequently on technology, travel and other things at [his website](http://george.mand.is).","twitter":"georgemandis","url":"http://george.mand.is","organization":"","shirt_size":"Men's M","title":"Make More Than Music with Tiny Computers, JavaScript and MIDI","abstract":"We're living the halcyon days of tiny computers and JavaScript, but MIDI is a technology that's been around for much longer. In this talk we'll explore why it's implementation and prevalence in musical hardware makes for a uniquely intriguing and accessible platform for creative coding.","description":"Tiny computers such as the [RaspberryPi](https://www.raspberrypi.org), [Arduino](https://www.arduino.cc/) and [C.H.I.P.](https://getchip.com/) have finally reached a level of  performance and affordability that makes hardware experimentation accessible to everyone. At the same time, JavaScript has emerged as the lingua franca of web programming and can be found in many places beyond just the browser. \r\n\r\nWhat if I told you there was a mature protocol that's been around since 1983 and was uniquely poised to take advantage of this development?\r\n\r\nWell, wonder no more and [meet MIDI](https://en.wikipedia.org/wiki/MIDI)! \r\n\r\nSitting at convergence of these two things is MIDI — a niche protocol that's been around since 1983 and was originally designed for musical instruments to communicate with one another. It's event-oriented approach to messaging feels right at home in the asynchronous world of JavaScript \u0026 Node, and the prevalence of MIDI support in older musical equipment means you can find unique, hackable and affordable hardware at your local pawnshop or Craig's List.\r\n\r\nThis unlikely tech stack — Tiny Computers + JavaScript + MIDI — can lend itself to creative programming beyond music. George's Talk will explain how to get started, walk through several examples and elaborate on the future of this stack, not only as a platform for experimentation but for education as well.","notes":"About me: I've been a freelance web developer and consultant for over a decade working with startups, small businesses, professional sports teams and entrepreneurs.  Since returning from my year [living as a digital nomad](http://52ltd.com/blog/a-web-developer-on-working-holiday/) I've started teaching programming in various capacities, both to [children](http://saturdayacademy.org) through a supplementary education program here in Portland, Oregon and running a \"coding bootcamp\" through a local [community college](http://www.mhcc.edu/). Prior to all of that I was — and continue to be, albeit in more [part-part-time](http://inkyshado.ws) terms — a musician who has enjoyed dabbling at the intersection of where my career and hobbies meet.\r\n\r\nThrough all these pursuits I feel I'm uniquely suited to give an informative and engaging presentation on the topic as I've outlined it above :)\r\n\r\nYou can watch me give an Ignite presentation about my year as a Digital Nomad here:\r\n\r\n[http://george.mand.is/2016/11/my-ignite-portland-talk/](http://george.mand.is/2016/11/my-ignite-portland-talk/)\r\n\r\nI have two questions:\r\n\r\n- I would like to run a slideshow from my laptop or tablet, but also be able to do a live demonstration onstage using a RasperryPi. If I brought an HDMI switch (Like [this one](https://www.newegg.com/Product/Product.aspx?Item=9SIA8SV3806290\u0026cm_re=HDMI_switch-_-0V5-00M2-001F2-_-Product)) would I be able to switch between my slideshow and the RasperryPi output on the projected screen? Or do you have something like that readily available I could use?\r\n\r\n- Will I be able to include sound in my presentation?","audience_level":"Intermediate","tag_list":["javascript","rasperry pi","node"],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-03-31T20:03:41.409Z"},{"name":"Nick Heiner","email":"nick.heiner+github@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/11410/cousins_party_crop.jpg","location":"Washington, DC","bio":"Nick is a senior software engineer at the [United States Digital Service](https://www.usds.gov/). Prior to that, he worked at Opower, Google, and Microsoft, and graduated from Cornell. He has contributed to open source projects like Eslint, Bower, Foundation, and Chai. [He writes about technology and politics on Medium](https://medium.com/@nickheiner).","twitter":"nickheiner","url":"https://medium.com/@nickheiner","organization":"United States Digital Service","shirt_size":"Men's M","title":"The Most Good You Can Do as a Technologist","abstract":"How can you use your tech powers for good? I've worked at Fortune 100 companies, double-bottom-line companies, and the United States Digital Service at the White House. By the end of the talk, you'll be ready to improve the world with your tech skills, with either a new job or a side project.","description":"A positive ethical impact makes a career much more fulfilling. Millennials disproportionately say they want their work to be mission-driven. And the current political climate has made people more interested in using their powers for good, across the political spectrum. Companies have gotten wise to this, and now almost everyone claims to be mission-driven, almost to the point of absurdity. I'll orient you to the landscape of possibilities.\r\n\r\nThis talk is inspired by Peter Singer's [\"The Most Good You Can Do\"](https://www.amazon.com/Most-Good-You-Can-Effective/dp/0300219865). Singer argues for what he calls \"Effective Altruism\", which is a rationality-based approach to having the greatest positive impact on the world. (This contrasts with what Singer identifies as \"warm-glow giving\", which is optimized to make the philanthropist feel good, but does not accomplish much else.) We'll discuss the ways that you can be an effective altruist in the tech world, with options for different levels of commitment and appetite for risk. And I'll share how you can avoid antipatterns, like vanity projects that look good but do not accomplish much.","notes":"I've spent a lot of time thinking about and working in this space, and I'm excited to share my insights. I want to help people distinguish projects that are real and impactful from those that just look good without producing results.\r\n\r\nHere are my rough notes on what types of opportunities exist:\r\n\r\n* Time intensive\r\n    * Work for a mission-driven, change-oriented part of the government \r\n        * United States Federal Government\r\n            * [USDS](usds.gov): be a consultant on high risk or critical government tech projects.\r\n            * [18F](https://18f.gsa.gov/): build digital services for the American people.\r\n            * [Presidential Innovation Fellows](https://presidentialinnovationfellows.gov/): bring modern tech practices to the government\r\n            * [Office of Science and Technology Policy](https://www.whitehouse.gov/ostp): write better tech policies for the government\r\n        * State and Local Government\r\n            * [Austin Design, Technology, and Innovation Fellows](https://cityofaustin.github.io/innovation-fellows/)\r\n        * Other Governments\r\n            * [Government Digital Service (UK)](https://gds.blog.gov.uk/)\r\n    * Work for a good contractor that works with the government. Easier lifestyle, but less autonomy for the type of impact you have.\r\n        * [Ad-Hoc](https://adhocteam.us/)\r\n        * [Nava](http://navahq.com/)\r\n    * Work at a non-profit outside of government. Easier lifestyle, but potentially less leveraged impact.\r\n        * [Code for America](https://www.codeforamerica.org/)\r\n    * Work for a campaign or political organization. Impact levels depend on how much you agree with a particular political agenda.\r\n        * [Hillary for America Tech Team](https://www.hillaryclinton.com/page/tech/)\r\n        * [Civis Analytics](https://www.civisanalytics.com/)\r\n        * [DNC](https://democrats.org/)\r\n        * [RNC](https://www.gop.com/get-involved/jobs/)\r\n    * Work at a B-corp\r\n        * Tell the audience what the difference between a b-corp and non-profit is, and give examples of each\r\n* Money intensive, low time committment\r\n    * \"Earning to Give\": A method of altruism Singer identifies in which you just earn as much money as possible and then live frugally, donating as much as you can. Of course, it's possible to do this on a sliding scale.\r\n* Not particularly time or money intensive\r\n    * Work for a \"double bottom line\" company. Can feel pretty much like a normal tech job, but the impact is at risk of the senior leadership deciding they are more interested in the fiscal bottom line than the moral one.\r\n    * Work at the social good part of a large company like Alphabet or Microsoft. You get the perks of a top-tier company, but you get to work on something that's fulfilling.\r\n        * [Alphabet Debug Project](https://debugproject.com/)\r\n        * [Microsoft Philanthropies](https://www.microsoft.com/en-us/philanthropies/)\r\n    * Find open source projects from groups like Code For America and contribute to them in your hobby time.\r\n\r\nEach of those options have pros and cons based on what you're looking for. Then, once you know which category you want, you need to determine the efficacy of a given project. Important questions include:\r\n\r\n* How measurable are the outcomes that the project can directly take credit for?\r\n* How long does it take the project's impact to be measurable? Is this a multi-generational change, or something that will start making improvements immediately?\r\n* Does the organization have an environment in which you can get work done?","audience_level":"All","tag_list":["impact","ethics","software-engineering","culture"],"rating":100.0,"state":"accepted","confirmed":false,"created_at":"2017-03-27T19:33:46.702Z"},{"name":"marcos paulo","email":"marcosptf@yahoo.com.br","avatar":"https://secure.gravatar.com/avatar/dda874a39ab072bf18ade8fbc1e75e69?s=500","location":"Unknown","bio":"Master's degree in Software Engineer and Software Developer with 10 years of experience, active contributor to open source projects \r\nlike Netbeans, PHP and Python.\r\nParticipated in projects in finance for banks Itau and Banco ABC.\r\n\r\n+ Open Source contributions\r\nI'm member of NetCat, team of QA in Project from Netbeans :\r\nhttps://netbeans.org/people/155724-marcos-paulo \r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255283\r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255022\r\n\r\nJava plugins to Netbeans IDE using java:\r\nhttp://plugins.netbeans.org/plugin/62803/stackoverflownetbeansplugin\r\nhttp://plugins.netbeans.org/plugin/59448/?show=true\r\nhttps://github.com/marcosptf/YahooSearchToolbar\r\nhttps://github.com/marcosptf/stackoverflowNetbeansPlugin\r\n\r\nI'm so active commiter to php-src core language, writing codes and fixing bugs to this plataform: \r\nhttps://github.com/php/php-src/search?q=marcosptf\r\nhttps://github.com/php/php-src/pulls/marcosptf\r\nhttps://bugs.php.net/search.php?author_email=marcosptf%40yahoo.com.br\u0026cmd=display\u0026status=All\u0026bug_type=All\u0026project=All\r\n\r\nI'm #10 top contributor php-src 2015\r\nhttps://github.com/php/php-src/graphs/contributors?from=2015-01-01\u0026to=2015-12-31\u0026type=c\r\n\r\ncpython contribution, fixing bugs and writing test scripts:\r\nhttp://bugs.python.org/issue24930\r\n\r\nI've won a hacker event develop a web game in javascript\r\nhttps://flic.kr/p/yAZtPN \r\n\r\nTranslate to french language \r\n-i've translate a microframework web site http://respect.github.io/\r\nhttps://github.com/Respect/respect.github.com/commit/fde030abb46af805ba54291b7f2138f83357497f\r\n\r\nTechnical writer in famous blogs\r\nhttp://phpsp.org.br/author/marcosptf/\r\nhttp://www.phpclasses.org/blog/post/386-How-to-Contribute-to-PHP-Development-Writing-phpt-Tests.html\r\nhttps://www.oficinadanet.com.br/autor/428-marcos-paulo\r\n\r\nI'm in list of php7 core developer on Zend oficial blog\r\nhttp://devzone.zend.com/6956/php-7-core-contributors-thankyou/\r\n\r\n\r\n\r\n+ Open Source Key Note\r\n-Tutorial about Flask Python in Python Brazil 11 2015 - Fatec - São José dos Campos/SP\t\t\t\t\r\nhttp://2015.pythonbrasil.org.br/#schedule\t\t\t\t\r\nBuilding microblog with flask\t\t\t\t\r\n\t\t\t\t\r\n-Talk about Flask Python at TDC 2016 - Universidade Anhembi Morumbi - São Paulo/SP\t\t\t\t\r\nhttp://www.thedevelopersconference.com.br/tdc/2016/saopaulo/trilha-python\t\t\t\t\r\nhttp://pt.slideshare.net/tdc-globalcode/tdc2016sp-flask-para-web\t\t\t\t\r\n\t\t\t\t\r\n-Talk about PHP7, C Lang, PHPUNIT at Novatec - São Paulo/SP\t\t\t\t\r\nhttps://twitter.com/phpsp/status/665515671950909440\t\t\t\t\r\n\t\t\t\t\r\n-Talk about how to contribute open sorce projects - PUC/RS - Porto Alegre/RS\r\nhttps://twitter.com/FerPeralesM/status/753681318794371072\t\t\t\t\r\n\t\t\t\t\r\n-Talk about PHPUNIT and RespectPHP at PHP Conference Brazil 2016 - Universidade FIEO - Osasco/SP\t\t\t\t\r\nhttps://www.facebook.com/photo.php?fbid=10208150857914827\u0026set=rpd.720317678\u0026type=3\u0026theater\t\t\t\t\r\n\t\t\t\t\r\n-Talk about Respect microframework at PHP Conference Brazil 2016 - Universidade FIEO - Osasco/SP\t\t\t\t\r\nhttp://phpconference.com.br/trabalho/detalhar-trabalho/id/41\t\t\t\t\r\n\t\t\t\t\r\n-Talk about PHPInternals com PHPUNIT at PHP Conference Brazil 2016 - Universidade FIEO - Osasco/SP\t\t\t\t\r\nhttp://phpconference.com.br/trabalho/detalhar-trabalho/id/42\t\t\t\t\r\n\t\t\t\t\r\n-Talk about how to be a better Software Developer at Mercado Livre - Osasco/SP\t\t\t\t\r\nhttps://www.facebook.com/photo.php?fbid=1342263182493144\u0026set=rpd.720317678\u0026type=3\u0026theater\t\t\t\t\r\n\t\t\t\t\r\n-Talk about  acessibilidade para deficientes visuais com Python - Grupy-SP - Sorocaba/SP\t\t\t\t\r\nhttps://www.meetup.com/Grupy-SP/photos/27666045/\t\t\t\t\r\n\t\t\t\t\r\n-Talk about accessibility for the visually impaired with Python - Grupy-SP - São Paulo/SP\r\nhttps://www.meetup.com/Grupy-SP/photos/27734707/#459590425\t\t\t\t\r\n\r\n","twitter":"marcosptf","url":"","organization":"Locaweb","shirt_size":"Men's L","title":"how to contribute PHP and others open source projects  ","abstract":"Do you want:\n-to contribute to more popular programming language from web?\t\t\t\t\n-to interact with the best software developers around the world?\t\t\t\t\n-grow up your level about software developer?\t\t\t\t\n-to know how a programming language work internally?\n\nThen you can't miss out this presentation !!!","description":"PHP is the more popular web platform made ever, is the better way between your idea and project done.\t\t\t\t\r\nPHP is a open source language and your community is big around the world, but her need your help to keep the PHP \t\t\t\t\r\nbig and strong.\t\t\t\t\r\n\t\t\t\t\r\nMy intension is share my experience like a code contributor in the most important project open source now a days.\t\t\t\t\r\nAnyone can contribute, since write documentation, translate, reporting bugs or write code.\t\t\t\t\r\n\t\t\t\t\r\nAfter this presentation, everyone will be able to contribute with any project open source, specially php-src and write .phpt test code with phpunit.\t\t\t\t\r\n","notes":"+ Follow the topics covered:\t\t\t\t\r\n-\u003ewhat is open source projects\t\t\t\t\r\n-\u003ewhat the open source projects more famous\t\t\t\t\r\n-\u003ephp open source and how to start contribute\t\t\t\t\r\n-\u003ehow php works internally\t\t\t\t\r\n-\u003eknowing PHPQA\t\t\t\t\r\n-\u003ehow to write tests to php-src with phpunit\t\t\t\t\r\n\t\t\t\t\r\n+ Who is this presentation for? \r\nThe proposal this presentation is teach to anyone that want start to contribute a great and mature open source project.\t\t\t\t\r\nNot experience required, if you have write a hello world in any programming language, you are ready! \t\t\t\t\r\n\t\t\t\t\r\n-What's the takeaway for the audience? \r\n-\u003eWhat the PHP project represent to open source community\t\t\t\t\r\n-\u003eHow the PHP works internally\t\t\t\t\r\n-\u003eHow to contribute to PHP project writing code/ reporting bugs/ etc\t\t\t\t\r\n-\u003eKnow interesting and brilliants software developers (network)\t\t\t\t\r\n\t\t\t\t\r\n+Prerequisite knowledge for this presentation \r\n-This information is crucial for attendees. Please describe what skills and knowledge attendees need to have in order to get the most from your talk.\t\t\t\t\r\nIs not required you be a extreme developer like a Linus Torvalds to start to contribute, you do not need to know PHP, C or C++, \t\t\t\t\r\nif you know any other programming language and is junior, intermediate or senior, is enough.\t\t\t\t\r\n\t\t\t\t\r\n+about be and open source contribution\t\t\t\t\r\nI'm Software Developer for 10 years, and i love open source, PHP, Java, Python and Pizza.\t\t\t\t\r\nFollow my recent contributions:\t\t\t\t\r\n\t\t\t\t\r\n+I'm member of NetCat, team of QA in Project from Netbeans :\t\t\t\t\r\nhttps://netbeans.org/people/155724-marcos-paulo\t\t\t\t\r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255283\t\t\t\t\r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255022\t\t\t\t\r\n\t\t\t\t\r\n+Java plugins to Netbeans IDE using java:\t\t\t\t\r\nhttp://plugins.netbeans.org/plugin/62803/stackoverflownetbeansplugin\t\t\t\t\r\nhttp://plugins.netbeans.org/plugin/59448/?show=true\t\t\t\t\r\n\t\t\t\t\r\n+I'm so active commiter to php-src core language, writing QA codes and fixing bugs to this plataform:\t\t\t\t\r\nhttps://github.com/php/php-src/search?q=marcosptf\t\t\t\t\r\nhttps://github.com/php/php-src/pulls/marcosptf\t\t\t\t\r\nhttps://bugs.php.net/search.php?author_email=marcosptf%40yahoo.com.br\u0026cmd=display\u0026status=All\u0026bug_type=All\u0026\t\t\t\t\r\nproject=All\t\t\t\t\r\n\t\t\t\t\r\n+I'm #10 top contributor php-src 2015\t\t\t\t\r\nhttps://github.com/php/php-src/graphs/contributors?from=2015-01-01\u0026to=2015-12-31\u0026type=c\t\t\t\t\r\n\t\t\t\t\r\n+cpython contribution, fixing bugs and writing test scripts:\t\t\t\t\r\nhttp://bugs.python.org/issue24930\t\t\t\t\r\n\t\t\t\t\r\n+I've won a hacker event develop a web game in javascript\t\t\t\t\r\nhttps://flic.kr/p/yAZtPN\t\t\t\t\r\n\t\t\t\t\r\n+Keynote python speaker\t\t\t\t\r\n-talk about flask in #pybr11 (Python Brazil Conference 2015)\t\t\t\t\r\nhttps://www.facebook.com/pythonbrasil/photos/a.802266406462553.1073741826.328258703863328/10414012292157\t\t\t\t\r\n35/?type=3\t\t\t\t\r\n\t\t\t\t\r\n-talk about flask in TDC 2016 Anhembi Morumbi\t\t\t\t\r\nhttps://www.facebook.com/PyLadiesSP/photos/a.1566261870344933.1073741843.1469656506672137/1566264470344\t\t\t\t\r\n673/?type=3\u0026theater\t\t\t\t\r\n\t\t\t\t\r\n+Keynote php speaker Novatec\t\t\t\t\r\n-talk about php7 and c language in #phparty7\t\t\t\t\r\nhttps://twitter.com/phpsp/status/665515671950909440\t\t\t\t\r\n-talk about php-src in #FISL2016\t\t\t\t\r\nhttps://twitter.com/FerPeralesM/status/753681318794371072\t\t\t\t\r\n\t\t\t\t\r\n+Translate to french language\t\t\t\t\r\n-i've translate a microframework web site http://respect.github.io/\t\t\t\t\r\nhttps://github.com/Respect/respect.github.com/commit/fde030abb46af805ba54291b7f2138f83357497f\t\t\t\t\r\n\t\t\t\t\r\n+Technical writer in famous brazilian blogs\t\t\t\t\r\nhttp://phpsp.org.br/author/marcosptf/\t\t\t\t\r\nhttp://www.phpclasses.org/blog/post/386-How-to-Contribute-to-PHP-Development-Writing-phpt-Tests.html\t\t\t\t\r\nhttps://www.oficinadanet.com.br/autor/428-marcos-paulo\t\t\t\t\r\n\t\t\t\t\r\n+I'm in list of php7 core developer on Zend oficial blog\t\t\t\t\r\nhttp://devzone.zend.com/6956/php-7-core-contributors-thankyou/\t\t\t\t\r\n\t\t\t\t\r\n+Keynote Fisl17 - How to contribute to PHP\t\t\t\t\r\nhttp://softwarelivre.org/fisl17\t\t\t\t\r\nhttp://hemingway.softwarelivre.org/fisl17/41c/sala41c-high-201607141700.ogv\t\t\t\t\r\n\t\t\t\t\r\n+PHPConference 2016\t\t\t\t\r\nhttp://phpconf.com.br/trabalho/detalhar-trabalho/id/41\t\t\t\t\r\nhttp://phpconf.com.br/trabalho/detalhar-trabalho/id/42\t\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\r\n","audience_level":"All","tag_list":["phpunit","phpinternals","php-src","php"],"rating":80.0,"state":"accepted","confirmed":true,"created_at":"2017-04-01T17:14:08.759Z"},{"name":"Valessio Brito","email":"valessio@gmail.com","avatar":"https://secure.gravatar.com/avatar/3ae975142268d36bae7f3c64f7e0149d?s=500","location":"Unknown","bio":"Jacobinense, hacker, digital artist and activist of free knowledge. Degree in Social Communication and Postgraduate in Free Software Development. He worked at Digital Inclusion Partnership Wave Program, developed by UFBA - Federal University of Bahia, from 2009 to 2012, developed virtual environments and other actions for Cooperative Free Technologies - COLIVRE. It was a consultant to design and open technologies in the Ministry of Justice and the General Secretariat of the Presidency.","twitter":"valessiobrito","url":"http://valessiobrito.com.br","organization":"","shirt_size":"Men's L","title":"How To Make Money with Free Software","abstract":"Different ways to work with open source and earn money honestly. Report and personal experience of the work done autonomously, in coperative, companies and consulting for government.","description":"","notes":"","audience_level":"Beginner","tag_list":["startup","entrepreneur","floss","marketing"],"rating":80.0,"state":"accepted","confirmed":false,"created_at":"2017-02-13T21:27:55.304Z"},{"name":"Cam Buckingham","email":"cameron.p.buckingham@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/4339/Cam_Buckingham-1898.jpg","location":"Unknown","bio":"Cameron Buckingham is an evangelist and a graduate of the Galvanize full stack immersive program. He previously served in the United States Coast Guard and worked as a production manager for a DC startup, where he discovered his passion for code. After graduating from Galvanize, he worked in big data at American Express to support companies such as Uber and McDonald's to drive a quicker pay-with-points system still in use by customers today.","twitter":"cpbuckingham","url":"https://cpbuckingham.ghost.io/","organization":"no affiliations","shirt_size":"Men's L","title":"How to Commit to your Commits - A 365-day Commit Streak Journey ","abstract":"Over the last year I have completed a 365-day commit streak. I have dedicated myself to exploring and contributing to open-source projects that help to better my understanding of coding. I documented my dedication by writing a blog that accounts for this year-long effort. ","description":"Over the last year I have completed a 365-day commit streak. Github is a tool that many programmers use to collaborate on coding projects. Github currently tracks each user's contributions on a image calendar. That is the platform in which I have used to measure my progress. I have dedicated myself to exploring and contributing to open-source projects that help to better my understanding of coding. I documented my dedication by writing a blog that accounts for this year-long effort. I would like to discuss how to do this and how a little bit of discipline everyday can lead to a great benefits. I come from a non-technical background, so many people who are approaching an interest in technology as a profession will find this very informative. \r\n\r\nSince last year, I have gotten married, started a new job, moved across the country, and bought a home. Many things have changed, one thing remains constant, I have been coding everyday for the last year. I would like the opportunity to discuss the challenges, rewards, and lessons learned about this experience!","notes":"","audience_level":"All","tag_list":["blogging","soft","technical"],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-03-04T14:35:49.844Z"},{"name":"PJ Hagerty","email":"pjhagerty@gmail.com","avatar":"https://secure.gravatar.com/avatar/632f4d3e6f9533628387e49bf3c282e9?s=500","location":"Amherst, NY","bio":"Developer, writer, speaker, musician, and Developer Advocate at Logz.io, PJ is known to travel the world speaking about programming and the way people think and interact.  He is also known for wearing hats.","twitter":"aspleenic","url":"http://iampj.xyz","organization":"Logz.io","shirt_size":"Men's XL","title":"From Turing to Big Data: A Look at Computing and Analytics","abstract":"The basis of all DevOps and development starts with our measurements.  We need to understand what role analytics and metrics plays in modern computing.  To find out, we look at where analytics began in the advent of computer science and where we stand today, with an eye toward the future.","description":"A look at where computing and analytics began and where it is headed.\r\nThe basis of all DevOps and development starts with our measurements.  We need to understand what role analytics and metrics plays in modern computing.  To find out, we look at where analytics began in the advent of computer science and where we stand today, with an eye toward the future.","notes":"A look at where computing and analytics began and where it is headed.\r\nThe basis of all DevOps and development starts with our measurements.  We need to understand what role analytics and metrics plays in modern computing.  To find out, we look at where analytics began in the advent of computer science and where we stand today, with an eye toward the future.","audience_level":"Beginner","tag_list":["big data","analytics"],"rating":87.5,"state":"accepted","confirmed":true,"created_at":"2017-05-16T11:37:30.155Z"},{"name":"Ilker Güller","email":"ilker.guller.777@gmail.com","avatar":"https://secure.gravatar.com/avatar/fcb8c0a2b99e4f7eada29957c4c65486?s=500","location":"Unknown","bio":"Who am I?\r\n=========\r\n* First Website at 11 (1998)\r\n* 10 Years experience on Development (more as Freelancer)\r\n* Started as FullStack Dev, Now Frontend Dev, Future, who knows..\r\n* JS, C#, PHP, Ruby, Classic ASP,.... Now also elixir\r\n* Trying to be drummer\r\n* Hardcore Gamer\r\n* Food Maniac\r\n\r\nWhy Should you listen to me?\r\n========================\r\n* Excited about new technologies \u0026 web system securities\r\n* I \u003c3 Open Source (and help to grow)\r\n* Experience on startup / small / big projects\r\n* Just check him on Twitter (mostly it looks like bot account)\r\n","twitter":"the_bluescreen","url":"http://ilkerguller.com","organization":"Hungryhouse","shirt_size":"Men's L","title":"Error monitoring on React Native","abstract":"React Native is perfect for the universal projects. You can export to android, ios, even windows and mac os. But if you have one app on 4 platforms, how can you handle the errors? On this talk, we will talk about how to handle errors on react native and how can we get happy users.","description":"React Native is perfect for the universal projects. You can export to android, ios, even windows and mac os. But if you have one app on 4 platforms, how can you handle the errors? On this talk, we will talk about how to handle errors on react native and how can we get happy users.","notes":"","audience_level":"Intermediate","tag_list":["react native","react","mobile apps","error","bug"],"rating":87.5,"state":"accepted","confirmed":true,"created_at":"2017-04-04T20:29:16.246Z"},{"name":"Ozkar L. Garcell","email":"codeshard@openmailbox.org","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/9080/oz.png","location":"Unknown","bio":"Intro\r\n-------------\r\n\r\nMy name is Ozkar L. Garcell and I am a full-stack Web Application Developer and Software Developer.  I am both driven and self-motivated, and I am constantly experimenting with new technologies and techniques. I am very passionate about Web Development, and strive to better myself as a developer, and the development community as a whole.\r\n\r\nInterests\r\n-------------\r\n\r\nI have been studying web development since 2005 and I develop in both Python and PHP, though I primarily use Python. I am experienced in both front and back-end development, and I am proficient in HTML/HTML5, CSS/CSS3, LESS, SASS, XML, JavaScript, jQuery, AJAX, and SQL/MySQL/PostgreSQL, to name a few. Right now I'm trying o make myself a ReactJS/ExpressJS/SequelizeJS jedi.","twitter":"codeshard","url":"http://codeshard.github.io","organization":"CubanTech, GUTL","shirt_size":"Men's M","title":"Better way of creating APIs with Flask and Graphene","abstract":"How to built the simplest and fastest  web APIs using Flask Framework and Graphene.","description":"Get motivated to explore the next generation  faster and reliable web APIs using Flask Framework and Graphene. Make a clean, simple, superfast, flexible web API using two technologies that works great with each other.","notes":"","audience_level":"All","tag_list":["graphene","sequelizejs","expressjs","nodejs","reactjs","flask","django","python"],"rating":87.5,"state":"accepted","confirmed":true,"created_at":"2017-05-19T12:39:43.342Z"},{"name":"Scott Feinberg","email":"feinberg.scott@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/2/10547287_1449381938671422_1249243637_n.jpg","location":"SF/NYC/BOS","bio":"Scott is the Technical Lead on the New York Times Cooking Product, a part of our Beta Group. In addition to working at The Times, Scott is the CEO of PaperCall.io, helping events find qualified speakers.","twitter":"scottefein","url":"http://cooking.nytimes.com","organization":"The New York Times Company","shirt_size":"Men's L","title":"Continuously Cooking: Our Path to Continuous Delivery","abstract":"It's easy to continuously deliver a relatively simple app with low traffic, but the stakes get a lot higher when you have millions of users and four years of legacy code. We'll talk about how NYT Cooking has gone from shipping stale code every few weeks to shipping fresh code everyday. ","description":"Four years ago, The New York Times launched NYT Cooking, a cooking-specific vertical showcasing 165 years of New York Times Recipes. That Rails Monolith is still in use today, delivering recipes, guides, and how-to videos to millions of users a month. \r\n\r\nAfter three years of legacy and working on a deprecated infrastructure, we were lucky if we shipped once every few weeks, and even then often led to deployment failures. Since then we've gone from shipping our monolith with very our fingers crossed to shipping every day with confidence. We'll look at how we changed our development practices, improved what and how we test, and automated our workflows. We'll also examine some of the unique enterprise concerns around continuous delivery and how we adapted and evolved our process so our engineering team works in tandem with design, and product to ship as often as possible.\r\n\r\nIntended Audience: Developers, DevOps people who are working on complicated/large scale applications and haven't been able to recognize the benefits of continuous delivery. Audience members should walk away with some actionable takeaways about how they can ship faster, and how they can sell shipping faster to the rest of their organization.","notes":"","audience_level":"All","tag_list":["rails","ruby","continuous delivery","devops"],"rating":100.0,"state":"accepted","confirmed":false,"created_at":"2017-05-19T23:19:56.777Z"},{"name":"Mark Bates","email":"mark@markbates.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1/markbates_headshot.jpg","location":"Boston, MA","bio":"Mark Bates is a full stack web developer with over 17 years of experience building high quality scalable applications for companies such as Apple, USA Today, Klarna, and Palm. He has written three books, “Distributed Programming with Ruby”, “Programming in CoffeeScript”, and “Conquering the Command Line”. Mark has spoken at conferences around the world, has led user groups such as Boston Ruby and Boston Golang, and has helped to organize conferences such as GothamGo and GopherCon.\r\n\r\nMark is also the co-founder of [PaperCall.io](http://www.papercall.io/speakers/markbates), a platform for connecting technical events with high quality content and speakers.","twitter":"markbates","url":"http://www.markbates.com","organization":"@markbates","shirt_size":"Men's XL","title":"A History of Programming and Other Such Ridiculous Things","abstract":"This is a fun, entertaining, and enlighting talk. It is designed to inform developers of where they came from so they can better understand where we're going.","description":"Alan Turing, Ada Lovelace, Mark Zuckerberg, Steve Wozniak. These are all people who’ve never been in my kitchen. I’ve never had even a passing head nod with whilst coming out of the bathroom. What size shoes do they wear? What’s their favorite color? Do they know all the lyrics to Katy Perry’s Roar? I don’t know. But perhaps by taking a look at our collective past we can find these answers, and maybe learn a little bit about our future. Or at the very least we’ll get to see pictures of really big computers from the olden days!","notes":"This is a fun, entertaining, and enlighting talk. It is designed to inform developers of where they came from so they can better understand where we're going.\r\n\r\nHere is a video of me giving the talk in 2014 at [Bacon](http://devslovebacon.com/conferences/bacon-2014/talks/a-history-of-programming-and-other-such-ridiculous-things). Spoiler alert, you'll learn who I am if you watch the video. :)","audience_level":"All","tag_list":[],"rating":100.0,"state":"accepted","confirmed":false,"created_at":"2017-02-06T19:44:22.826Z"},{"name":"Inaury Portuondo Cárdenas","email":"inaury@patrimonio.ohc.cu","avatar":"https://secure.gravatar.com/avatar/bcfddfabe49be932614d129bdd3f93c2?s=500","location":"Unknown","bio":" Inaury Portuondo Cárdenas\r\nCubana de 39 años\r\n Sexo Femenino\r\nLicenciada en Pedagogía en la Especialidad de Historia\r\nGraduada en el Instituto Superior Pedagógico Enrrique Jose Varona. 2000\r\nIdiomas: ingles e italiano \r\nProfesora de Nivel Medio Superior  de 2000 -2003\r\nProfesora Adjunta Universitaria de 2004-2009  \r\nMuseóloga Especialista en Estudios Socioestéticos y Culturales en Museo Nacional Ernest Hemingway, Cuba  desde 2004 hasta 2011\r\nMuseóloga Especialista en Estudiso Socioestéticos y Culturales en Museo en Complejo de museos históricos Miltares  Morro-Cabaña 2012 (3 meses)\r\nMuseóloga Especialista en Estudios Socioestéticos y Culturales en Museo Casa de Africa OHC, 2012 hasat la fecha \r\nMaestrante en Gestión y Conservación del Patrimonio (en proceso de tesis)\r\nParticipacion en eventos nacionales e internacionales relacionados con el patrimonio\r\n 1er premio por dos ocasiones en festival de Raíces africanas Wemilere 2013 y 2016\r\n Asitencia en traducción e interpretación de idioma ingles e italiano\r\n Amplia experiencia en curaduria y comisaria de exposiciones patrimoniales  y artísticas\r\nExperiencia enel trabajo comunitario desde la visión de la educación patrimonial.\r\n\r\n","twitter":"","url":"","organization":" Museo Casa de Africa Oficina del Historiador de la  Ciudad. La Habana,Cuba  ","shirt_size":"Women's M","title":"Espacios culturales de la esclavitud urbana  en la Habana Vieja","abstract":"En el  Decenio de los afrodescendientes  visualizar este legado cultural es eje tranversal del trabajo en las comunidades. La esclavitud urbana es una arista poco estudiada y difundida con  grandes aportes a la cultura cubana.Acercarnos a estos y a su diversidad cultural  es  viable con las hightec","description":"El trabajo está encaminado en visualizar un contenido histórico patrimonial que existe en la Habana Vieja y está relacionado con el legado cultural de la esclavitud donde ademas la mujer tiene gran prescencia . Por la importancia del tema en la identidad cultural de Cuba es necesario que este contenido sea accesible a todos y a las nuevas generaciones en particular .De la misma forma que los pobladores en su condición de portadores culturales conozcan cuanto hay del período de esclavitud en sus comunidades y que no se conoce, como llega hasta nuestros días esta parte de la historia universal y de Cuba. El mayor acceso a esta informacion se ha realizado  a través de mapilary  y openstreetmap donde ya se ubican muchos de los sitios históricos y sus actualizaciones; con gran acogida general pero se hace necesario continuar e incrementar el trabajo incorporando las diversas alternativas en correspondencia con la situacion tecnológica real de Cuba . Esperamos que este encuentro sea una plataforma para dialogar e intercambiar nuestras experiencias . Se podrán apreciar espacios culturales donde otrora estuvieron cabildos (asociaciones de ayuda mutua   representado por diversos grupos etnicos africanos), la existencia de espacios para los oficios que solo eran realizados por los africanos y sus descendientes libres o esclavos entre SXVI y SXIX; lugares reservados para la venta , castigo o trabajo esclavo, lugares representativos de la prostitucion como forma de esclavitud para los negros etc.  estos espacios devienen actuales sitios culturales de patrimonio vivo por la alta prescencia de la cultura de origen afro en Cuba y otras expresiones extraescolares de educación : como vestuario ,culinaria , peinados estilo afro etc.\r\n","notes":"Para la intervencion se necesita un sopoprte para proyectar diapositivas que seran explicadas por el conferencista, la proyeccion de audio y video complementara la visualizacion del proyecto en curso. En mi caso en cuanto a la temática referida al legado de la esclavitud en la Habana Vieja es un tema que trabajo  desde hace algunos años confrontando investigaciones de predecesores y antropologos quecentraron  su trabajo de academia y la redacción de bibliografia especializada . Actulamnete  soy Museóloga en el Museo Casa de Africa de la Oficina del Historiador de la Habana, investigo colecciones relacionadas con la africania en Cuba    y soy maestrante de Gestión y Conservación del Patrimonio Cultural ","audience_level":"All","tag_list":[],"rating":80.0,"state":"accepted","confirmed":true,"created_at":"2017-02-10T23:09:23.149Z"},{"name":"Rodrigo Rodriguez","email":"rodrigo.linuxero@gmail.com","avatar":"https://secure.gravatar.com/avatar/7ad85e55eb2797e58e79f88199b8167c?s=500","location":"Unknown","bio":"Venezolano, Tecnólogo con intereses en la Investigación, Diseño e Innovación. Con experiencia en sistemas basados en FOSS, soluciones en redes de comunicación y manufactura de equipos de computación.","twitter":"RodrigoRdgz","url":"","organization":"","shirt_size":"Men's XL","title":"Reciclaje de hardware con GNU/Linux","abstract":"Uno de los problemas que generan el uso de PC es la acumulación de equipos en desuso por su obsolecencia. Las organizaciones no solucionan este problema y se ven obligados a retirarlos.  Aplicando los conceptos de reciclaje al hardware se pueden obtener soluciones sencillas a problemas cotidianos.","description":"Palabras claves: Reciclaje, Software libre, Hardware, GNU/Linux\r\n\r\nIntroducción:\r\nUno de los principales problemas que generan el uso de computadores es la acumulación de equipos en desuso por la falsa creencia de la obsolecencia de los mismos. En muchos casos las organizaciones no encuentran una solución efectiva a este problema y se ven obligados a donar o eliminar estos equipos.   \r\n\r\nSi se aplica los conceptos de reciclaje al hardware se pueden obtener soluciones sencillas a problemas cotidianos. En esta presentación se describe como podemos recuperar equipos en desuso utilizando el sistema operativo GNU/Linux.\r\n\r\nReciclar hardware con Linux\r\n\r\nSe puede decir que el núcleo del sistema es un medio importante para reciclar hardware principalmente porque esta diseñados para correr en equipos con procesadores o arquitecturas sencillas.\r\n\r\nUn ejemplo claro se ve con la plataforma Intel x86, el kernel fue diseñado para un computador con un procesador 386, y esa misma filosofía se mantiene hasta el día de hoy. Es por ello que podemos ejecutar algún kernel moderno en un equipo con un procesador 486.\r\n\r\n¿Por qué reciclar hardware?\r\n\r\nPara aprender, el reciclaje de equipos viejos permite conocer arquitecturas antiguas y a la vez experimentar con servicios y configuraciones.\r\nPara reutilizar recursos, de esta manera se puede ahorrar recursos financieros de la organización y no se acumularía hardware de desecho.\r\nPara resolver un problema, no siempre es necesario invertir una cantidad de dinero para solucionar pequeños problemas si se tiene en cuenta que la organización posee hardware en desuso.\r\n\r\nAlgunas aplicaciones reales basadas en hardware reciclado:\r\n- Router hecho en casa\r\n- Servidor sencillo con pocos clientes\r\n- Estaciones de trabajo\r\n- Terminales de Sistema Distribuidos.","notes":"","audience_level":"All","tag_list":["free software","linux","hardware"],"rating":80.0,"state":"accepted","confirmed":true,"created_at":"2017-02-10T12:37:10.294Z"},{"name":"Nick Heiner","email":"nick.heiner+github@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/11410/cousins_party_crop.jpg","location":"Washington, DC","bio":"Nick is a senior software engineer at the [United States Digital Service](https://www.usds.gov/). Prior to that, he worked at Opower, Google, and Microsoft, and graduated from Cornell. He has contributed to open source projects like Eslint, Bower, Foundation, and Chai. [He writes about technology and politics on Medium](https://medium.com/@nickheiner).","twitter":"nickheiner","url":"https://medium.com/@nickheiner","organization":"United States Digital Service","shirt_size":"Men's M","title":"An Accessible Guide to Accessibility","abstract":"ARIA? WCAG? JAWS? Web accessibility is often thought of as scary voodoo magic. But it doesn't have to be this way. With the right mindset, anyone can build accessible web content. Come learn how to make design, build, and test with disabled users in mind.","description":"Making your app accessible increases the size of your user base, often promotes search rankings, allows you to sell to the government, and is just the right thing to do. In this talk, we'll discuss:\r\n\r\n* Starting with an accessible design, instead of trying to shoehorn accessibility in later\r\n* Writing semantic HTML that can be understood by assistive technologies \r\n* Avoiding common design and implementation anti-patterns that hurt accessibility\r\n* Understanding accessibility standards such as WCAG 2.0\r\n* Ensuring that frameworks like Angular and React play nicely with accessibility\r\n* Performing real-world testing that accurately assesses how a disabled user would interact with your app\r\n\r\nYou don't need to be a world-class developer to make accessible web content. With mindfulness and adherence to a few simple principles, you can broaden your user base and make the digital world a more inclusive place!","notes":"# Why I want to give this talk\r\nI'm inspired to give this talk after my experience working with teams trying to make web content accessible in both the public and private sector. In the private sector, when I worked at Opower, people were initially afraid of client commitments that required making content accessible. Senior execs would even say \"wow, you folks are really going to hate this.\" Then, I started working with the government, and I encountered an agency project where people were angry with each other and the product was not going to launch because of fear, uncertainty, and doubt around accessibility. After I solved the accessibility problems for the app, I had a lot more work left to do helping all the people involved think about accessibility in the right way. We launched on time, and now I want to save other teams from this unnecessary heartburn.\r\n\r\nAccessibility is an important topic. It helps app creators, by expanding their possible audience. And it helps disabled users, who deserve just as much access to content as anyone else. I see a lot of projects where accessibility is completely ignored because people think it's too hard. I'd like to give people the mindset and knowledge they need to get started building accessible content. Even if they just pick off the low-hanging fruit, it'll make the web a better place because there will be fewer sites that are completely unusable.\r\n\r\n# Details\r\nI've written two similar blog post drafts about this topic. One is now published on the [USDS Medium channel](https://medium.com/the-u-s-digital-service/mythbusters-guide-to-accessibility-92ccd88655c6#.i42s8d5oe). The other is copied below, and will not be published. If I give this talk at CubaConf, it'll have less of a government tilt.\r\n\r\n# An Accessible Guide to Accessibility: How We Approach Building for Everyone\r\n\r\nAs modern technology improves, there's incredible opportunity to build services for people that stand to make a huge positive difference in their lives. But this will only be possible if the services and products we create are accessible to everyone. Too often, accessibility is seen as an intimidating topic, so it's neglected entirely, or it's slapped on to a product at the end. \r\n\r\nIt doesn't have to be that way. This article aims to provide an introduction to accessibility that's approachable by all technologists, not just accessibility experts. \r\n\r\nIn government, accessibility is defined by Section 508, enacted as an amendment to the Rehabilitation Act of 1973 to knock down barriers in information technology for the disabled. This article will talk specifically about Section 508, but as you'll see, general accessiblity and Section 508 compliance align perfectly.\r\n\r\n## The Law\r\nSection 508 is not complicated. At its core, it says:\r\n\r\n\u003e [I]ndividuals with disabilities ... have access to and use of information and data that is comparable to that provided to ... individuals with[out] disabilities. [*-Section 508 1194.1*](https://www.access-board.gov/guidelines-and-standards/communications-and-it/about-the-section-508-standards/section-508-standards#subpart_a)\r\n\r\nTranslated into plain human-speak:\r\n\r\n\u003e Everyone should be able to use government services, even if they have disabilities.\r\n\r\n### WCAG\r\nThe [Web Content Accessibility Guidelines (WCAG)](https://www.w3.org/WAI/intro/wcag) is a set of principles for designing accessible user experiences on the web. Section 508 lines up almost exactly with the recommendations found in WCAG 2.0, authored by industry experts, and backed by the [World Wide Web Consortium](https://www.w3.org/), which defines standards for the web.\r\n\r\n#### How to meet WCAG\r\n\r\nWCAG 2.0 is written as a set of technology-agnostic criteria, such as: \r\n\r\n\u003e 1.4.1 Use of Color: Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element. \r\n\r\n\u003e 2.4.2 Page Titled: Web pages have titles that describe topic or purpose.\r\n\r\nIf all these statements apply to your web content, then it meets WCAG. Note that these statements are the \"what,\" not the \"how.\" WCAG makes no statements about implementation decisions – that's left to your discretion as the creator. And 508 itself says that the goal is a comparable experience for users with disabilities, not adherence to any particular suggestion that 508 contains for how to do that.\r\n\r\nWCAG provides a [set of techniques](https://www.w3.org/TR/WCAG20-TECHS/Overview.html), which are suggestions for how to meet the success criteria. For instance, [H51](https://www.w3.org/TR/WCAG20-TECHS/H51.html) provides methods for creating tables.\r\n\r\nWhen you're trying to meet 508, people may tell you that you **must** adhere to a specific WCAG technique. This is simply not true. For example, there are several tactics that are no longer applicable, advocate a deprecated approach, or create a bad outcome for users. You can use your discretion to decide what to follow and what makes sense for your service.\r\n\r\n## Mindset\r\nThinking about 508 the right way will make it easier to follow.\r\n\r\nWhether content is 508 conformant is largely a judgement call. The concrete requirements are minimal; the key goal of a \"comparable\" experience for disabled users is not an objective determination. There will always be improvements that can be made to the assisted user experience, just like there will always be improvements that can be made to the mobile or desktop experience. The fact that some aspect could be made better does not mean that content is not 508 conformant. Product owners needs to make a decision about how many resources shall be invested in UX. At a certain point, you have to say that the content is good enough and it's time to ship.\r\n\r\n## US Web Design Standards\r\nThe [US Web Design Standards](https://18f.gsa.gov/2015/09/28/web-design-standards/) provide guidance for accessibility out of the box. If you're working for the goverment, you can start with the US Web Design Standards and know that you're getting a good, accessible foundation. Additionally, each UI components offers guidance for how to ensure that it's accessible.\r\n\r\n## Design\r\nAccessibility is easiest when you build it in from the beginning. Just like mobile has different design considerations than desktop, so does accessibility. Some designs are going to be onerous to make accessible after the fact. You can save a ton of development time and headaches by baking accessibility in upfront.\r\n\r\nVisually-impaired users interact with a UI in a fundamentally different way than sighted users. Sighted users can visually absorb the entire page at once, and quickly jump around to what appears to be the most relevant content. Non-sighted users perceive the page linearly, as a single stream of text served through a screenreader. Designers should consider both methods of interaction. **And to validate both these approaches, user testing should be done with both sighted and non-sighted users.** \r\n\r\nThere are some aspects of design that are part of the UX for disabled users, but not for people without disabilities. For instance, tables can include optional explanatory text to help make it comprehensible for a non-sighted user. The design should specify whether this additional text is needed for a table, and if so, what that text is. In lieu of an affirmatively stated spec, developers and 508 testers are liable to make their own decisions and write their own user-facing text, which is likely to not be as thoughtfully-constructed as what the design team would produce.\r\n\r\nIn other places, designers may wish to specify an alternate UX for non-sighted users. For instance, there may be a tooltip that contains additional explanation text when a user hovers over a word in a paragraph:\r\n\r\n![popover image](https://cloud.githubusercontent.com/assets/829827/18794219/726088d6-818c-11e6-8c1c-2c57c6f97e9c.png)\r\n\r\nThis could be painful for someone using a screenreader, since it could be tricky to open and close the popover using the keyboard. Instead, the design could specify that for screenreaders, the popover should be hidden, and the text it contains should be in a parenthetical in the paragraph itself that's only visible for screenreaders.\r\n\r\nSome interactions are difficult when using a screenreader. Perhaps a design requires using non-standard keystrokes to operate an app. If these keystrokes conflict with the extra key commands that a screenreader introduces, then it may create confusion. For instance, JAWS users press `control+left arrow` to read the next piece of content. If a design calls for `control+left arrow` to make the app behave in a certain way, then making that behavior accessible to JAWS users requires overriding the JAWS keyboard commands, which can be very confusing. Instead, it's better to stick to standard keyboard operations, like pressing the enter key to submit a form.\r\n\r\n## Implementation\r\nAchieving 508 compliance is much easier when you build accessibility support in from the beginning. Remediating content to add it is much more expensive. Here are some suggestions for how to build web content in an accessible way.\r\n\r\nIf you write semantic, standards-conformant code, you'll get a lot of accessibility support out of the box. You can use [ARIA](https://www.w3.org/WAI/intro/aria) to provide additional support to screenreaders to communicate things that may be obvious visually but not just by inspecting the markup itself. There are plenty of resources for learning about ARIA; this document will just give a taste of what is possible to inspire you to learn more.\r\n\r\n### ARIA Roles\r\n[ARIA roles](https://www.w3.org/TR/wai-aria/roles) let you use non-semantic markup, which is sometimes desirable.\r\n\r\nFor instance, if you can use a `\u003cbutton\u003e` element for all your buttons, the screenreader will be able to figure out what's going on. However, sometimes you may have a UI component that semantically is a button, but you represent it with an `\u003ca\u003e`. In that case, you help the screenreader by adding ARIA attributes:\r\n\r\n```html\r\n\u003ca role=\"button\"\u003eUnleash the Sloths\u003c/a\u003e\r\n```\r\n\r\nARIA is also useful for UI components that don't have a semantic equivalent in HTML. For instance, you can use [`role=\"search\"`](https://www.w3.org/TR/wai-aria/roles#search) to indicate that an element provides the capability to search something. The more semantic information you can provide about your content, the better job a screenreader can do of presenting it to a user.\r\n\r\n### ARIA Properties\r\n\r\nYou can apply attributes like [`aria-labelledby`](https://www.w3.org/TR/wai-aria/states_and_properties#aria-labelledby), [`aria-label`](https://www.w3.org/TR/wai-aria/states_and_properties#aria-label), and [`aria-describedby`](https://www.w3.org/TR/wai-aria/states_and_properties#aria-describedby) liberally, to give a screenreader more clues about how your content is structured.\r\n\r\nFor instance, consider the following table:\r\n\r\n![screenshot of a table with a header](https://cloud.githubusercontent.com/assets/829827/18794651/851e4682-818e-11e6-9411-8c5b1d807148.png)\r\n\r\nTo a sighted user, it's obvious that the title \"Overview By Tax Year\" is related to the table. However, just by looking at the markup, a screenreader may not be able to draw the same conclusion:\r\n\r\n```html\r\n\u003ch3\u003eOverview By Tax Year\u003c/h3\u003e\r\n\u003ctable\u003e\r\n  \u003c!-- ... --\u003e\r\n```\r\n\r\nTo explicitly link the two, we use `aria-labelledby`:\r\n\r\n```html\r\n\u003ch3 id=\"overview-by-tax-year-table-title\"\u003eOverview By Tax Year\u003c/h3\u003e\r\n\u003ctable aria-labelledby=\"overview-by-tax-year-table-title\"\u003e\r\n  \u003c!-- ... --\u003e\r\n```\r\n\r\nThis way, the screenreader is able to provide a richer experience.\r\n\r\n### ARIA Hidden\r\nThe [`aria-hidden`](https://www.w3.org/TR/wai-aria/states_and_properties#aria-hidden) attribute causes the screenreader to ignore an element. This comes in handy in a few situations. For instance, if content is purely decorative, WCAG 2.0 states that it should be hidden from screen reader users, as it just slows them down without adding value. An example of this is a site logo at the top of the page that takes the user back to the home page:\r\n\r\n```html\r\n\u003ca href=\"/home\" aria-label=\"link to home page\"\u003e\r\n    \u003cimg src=\"logo.png\" aria-hidden=\"true\" alt=\"FooCorp logo\" /\u003e\r\n\u003c/a\u003e\r\n```\r\n\r\nBecause the image is purely decorative, presenting it to screen readers would not help those users understand the page. Instead, we put an `aria-label` on the link, which has a purpose, and hide the image, which does not. \r\n\r\nAnother case where `aria-hidden` is helpful is when you're using a modal. \r\n\r\n![modal screenshot](https://cloud.githubusercontent.com/assets/25331532/22992826/dc1e140e-f38e-11e6-95e1-727936e22f22.png)\r\n\r\nFor sighted users, the modal has an overlay over the background. This provides visual focus, and it prevents the user from interacting with the rest of the page. However, this overlay will not automatically do the same thing for screen readers. To achieve this effect, we use `aria-hidden`. We apply that attribute to the background.\r\n\r\n```html\r\n\u003cbody\u003e\r\n  \u003cdiv class=\"main-content\" aria-hidden=\"true\"\u003e\r\n    \u003c!-- ... --\u003e\r\n  \u003c/div\u003e\r\n  \u003cdiv class=\"modal\"\u003e\r\n    \u003c!-- ... --\u003e\r\n  \u003c/div\u003e\r\n\u003c/body\u003e\r\n```\r\n\r\n### Keyboard Shortcuts\r\nSome people can't use a mouse, but are able to use a keyboard. To support these people, [WCAG 2.0 requires that all content be accessible using only the keyboard.](https://www.w3.org/TR/WCAG20/#keyboard-operation) Fortunately, it's easy to set up keyboard shortcuts with JS libraries like [Mousetrap](https://github.com/ccampbell/mousetrap):\r\n\r\n```js\r\n// single keys\r\nMousetrap.bind('?', () =\u003e /* do something */);\r\n\r\n// combinations\r\nMousetrap.bind(\r\n  'up up down down left right left right b a enter', \r\n  () =\u003e /* do something */\r\n);\r\n```\r\n\r\n### Cognitive Impairments\r\nSome people have cognitive impairments which make them take more time to process what's on a page. To help these people, [WCAG 2.0 requires that timed content is designed appropriately.](https://www.w3.org/TR/WCAG20/#time-limits) For instance, if you have a news feed, you should not auto-update it and push content down the page. If someone is reading slowly, the updates could come so fast that they can't absorb the content. Instead, it's better to tell users that new content is available, and let them read it at their own pace:\r\n\r\n![Twitter screenshot](https://cloud.githubusercontent.com/assets/25331532/22994076/6daf605e-f393-11e6-8439-cfa548bc25ef.png)\r\n\r\n## Testing\r\n508 testing should be done continuously throughout development, just like content that supports mobile is continuously tested to ensure that it looks good on a phone.\r\n\r\n### Test with assistive technology\r\n508 testing must be done with assistive technologies to produce a meaningful result; merely looking at the code itself will not provide adequate assurance that the product is accessible.\r\n\r\nThe most expensive assistive technology, like JAWS, tends to cost over a thousand dollars. For most dev shops, this will be a trivial amount of money relative to other expenses like payroll. However, if your project does not have budget for JAWS, many operating systems (including Android, macOS, and iOS) have free assistive technology built in. VoiceOver is how your assistive technology users on iOS will interact with your site, so using VoiceOver is a good test.\r\n\r\nThere are also automated scanners, like Google's [Accessibility Developer Tools](https://chrome.google.com/webstore/detail/accessibility-developer-t/fpkknkljclfencbdbgkenhalefipecmb?hl=en), that will catch some common errors. However, these are just the beginning of making content accessible. They will catch low-hanging fruit, but there are accessibility issues that automated scanners can't catch.\r\n\r\n### Screenreaders aren't perfect\r\nEven if the code is perfectly standards-conformant, screenreaders may still do weird things. VoiceOver iOS will duplicate certain elements. JAWS will read Angular templates before they're compiled. Android TalkBack will say \"double tap to activate\" on static elements. Trying to achieve perfection is a waste of time, because the screenreaders themselves aren't good enough. The 508 law does not require a flawless experience for disabled users; it requires an experience that's \"comparable\" to what non-disabled users get.\r\n\r\nIn particular, if a screenreader does something odd on all web pages, then it's not a defect with your code, and you should not try to work around it. You can go down a rabbit hole of trying to polish an experience for on screenreader with really complicated markup, only to find that approach degrades the experience for other screenreaders. Instead, just focus on writing semantic, standards-conformant code, and let screenreaders do the best they can.\r\n\r\n### Assistive Technology Can Be Hard to Use\r\nAs a tester, you're trying to make a judgement about whether an experience is comparable for someone with a disability. If you don't have a disability yourself, and you're not a routine user of the assistive technology you're testing with, this could be a hard call to make. If possible, seek out disabled users to validate your assumptions. (Of course, just like any other user testing, it's possible to get distorted results from a small sample size, or by taking everything the users say at face value. The best practices of user testing apply here as well.)\r\n\r\nAdditionally, be careful about flagging issues that only appear problematic because you aren't an experienced user of the software. 508 itself warns about this:\r\n\r\n\u003e It always should be kept in mind that assistive technologies, such as screen readers, are complex programs and take extensive experience to master. For this reason, a novice user may obtain inaccurate results that can easily lead to frustration and a belief that the page does not comply with the standards. ([*Access Board: Guide To The Section 508 Standards*](https://www.access-board.gov/guidelines-and-standards/communications-and-it/about-the-section-508-standards/guide-to-the-section-508-standards/web-based-intranet-and-internet-information-and-applications-1194-22))\r\n\r\n### Picking the Right Assistive Technology is Important\r\nWhen a web app is being built, developers target certain browser / OS combos. The rationale for which platforms to support is generally based on market share. Assistive technologies are no different. The testers should pick a set of assistive technologies and justify them with market share data. (For an authoritative, industry-respected source of market share data, see the [WebAIM studies](http://webaim.org/projects/screenreadersurvey6/#browsercombos).)\r\n\r\n[WebAIM's 2009 study](http://webaim.org/projects/screenreadersurvey/#updates) showed that users rapidly upgrade their assistive technology:\r\n\r\n![assistive technology update](https://cloud.githubusercontent.com/assets/25331532/22665520/04408ec0-ec83-11e6-8984-d62fe9412cac.PNG)\r\n\r\nThis means that the best way to support users is to test against the newest technology, since that's what most users have. If you have the budget to test against older assistive technology, that's great too, but it shouldn't come at the expense of testing against the latest.\r\n\r\nOlder assistive technologies are doubly bad: they lack support for modern standards, like ARIA, so it'll be costlier to support them. And, [research shows](http://webaim.org/projects/screenreadersurvey6/#updates) that very few users are still on old assistive technology. So targeting an older version means spending many resources for few users, at the expense of spending resources on the assistive technologies where most users are.\r\n\r\n## The Takeaway\r\n508 and accessibility don't have to be scary. Here are the key points to remember:\r\n\r\n1. 508 compliance is a judgement call as to whether disabled users have a \"comparable\" experience.\r\n1. The authority on what type of experience disabled users have are disabled users themselves — consult them whenever possible. (But as with all user testing, take any individual's feedback with a grain of salt.)\r\n1. Design for and support accessibility from the beginning.\r\n1. Comply with WCAG 2.0, and you're in good shape.\r\n1. Aim for standards-conformant code with a generous smattering of ARIA helpers.\r\n1. Test on modern assistive technologies if you want meaningful test results.","audience_level":"All","tag_list":["web","html","accessibility","design","javascript"],"rating":80.0,"state":"accepted","confirmed":false,"created_at":"2017-03-27T19:32:59.746Z"},{"name":"William Cabrera","email":"cabrerawilliam@gmail.com","avatar":"https://secure.gravatar.com/avatar/fb8985d77e00f7ddc269f2d79047328e?s=500","location":"Unknown","bio":"Soy venezolano, tecnico superior en electrónica, activista por el software libre y el conocimiento libre, pertenezco al capítulo de Wikimedia Venezuela, trabajo en la empresa de ensamblaje de computadoras VIT, trabajé para el proyecto de la distribución nacional Canaima GNU/Linux, me gusta la programación y la electrónica, las películas de ciencia ficción y los libros de divulgación científica y autobiográficos","twitter":"willicab","url":"https://willicab.com.ve","organization":"Personal","shirt_size":"Men's XL","title":"Creación de un sistema de domótica de bajo costo con Raspberry Pi","abstract":"En esta charla se hablará, a través de ejemplos prácticos, como se puede crear un sistema domótico extendible de manera sencilla con tecnologías libres y a bajo costo, se explicará el uso de telegram, programación de bots con lenguajes de alto nivel y electrónica basica todo desde Raspberri Pi","description":"Hasta hace poco más de una década el hecho de tener automatizada la gestión de una edificación que resultara accesible para la mayoría de las personas resultaba impensable, esto debido a los altos costos de implementación y mantenimiento, además de que era necesario equipos especializados para llevar esto a cabo y la programación de dichos equipos era muy compleja, ya que requieren conocimientos de programación en C o Ensamblador en algunos casos.\r\nCon el pasar de los años el precio de los equipos de computación se han abaratado enormemente, además han salido proyectos de micro computadoras que llevan puertos de Entrada/Salida de Propósito General (GPIO por sus siglas en inglés) los cuales permiten controlar otros dispositivos externos a este de manera más sencilla pudiendo usar lenguajes de programación de alto nivel.\r\nUno de los dispositivos mas famosos en la actualidad ha sido el Raspberry Pi, Creado por  por una fundación caritativa en Reino Unido, con el fin inicial de crear una computadora que animara alos niños a aprender informática, pero rápidamente se hizo famoso en una gran comunidad de entusiastas, debido por un lado a su bajo costo y a su gran versatilidad, este es un microcomputador que posee, además de puertos GPIO, puertos USB y de red cableada, lo que lo convierte en uno de los mejores candidatos para crear dispositivos conectados con diferentes propósitos.\r\nEn esta presentación se mostrará como a través de diferentes tecnologías de hardware y Software Libre, puede construirse un sistema domótico que incluya el manejo remoto de diferentes aparatos de la casa o   vigilancia, entre otros temas, usando Raspberry Pi como núcleo del proyecto y el cliente de mensajería Telegram como el cliente de control.","notes":"Para la charla solo necesitaré conexión a internet y una mesa donde colocar los dispositivos que mostraré como ejemplo.\r\nNo se si soy la mejor persona para dar esta charla, pero dada mi experiencia en programación de bots y electrónica, como puede apreciarse en [mi blog](https://blog.willicab.com.ve) y [mi canal de youtube](https://www.youtube.com/channel/UCbBjUsWaxYI0QndSJGTdNZQ), considero que tengo la capacidad suficiente para hablar sobre el tema que he propuesto y en un lenguaje que personas con poco conocimiento del tema puedan entenderlo y comenzar a aplicarlo","audience_level":"Beginner","tag_list":["electrónica","python","php","bots","telegram","domótica","raspberry pi"],"rating":90.0,"state":"accepted","confirmed":true,"created_at":"2017-02-07T20:34:31.749Z"},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"How I Went From Newbie to Open Source Project Owner","abstract":"This is the story of how focusing first on building a community of individuals who care about mentoring has allowed me to turn the idea of mentor matching for people learning to code into a multi-platform open source project.","description":"As someone new to the development community, finding your way around can be a daunting task. There are no defined paths, there's an overwhelming amount of information to ingest, and focus is an almost impossible task. Becoming an active member of open source projects is a great way for newbies to practice their coding skills, develop meaningful community relationships, and become a part of and add value to something bigger than themselves. You only have to look around you to see that individuals thrive when they feel that they have strong relationships and belong to a community.\r\n\r\n1. Understanding the value of the Open Source Community as a newbie\r\n2. Strategies for building community offline and online\r\n3. Brining the community together to work on something that matters to them\r\n","notes":"","audience_level":"All","tag_list":["open source","community","github","newbie","open source project"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-03-09T15:06:37.383Z"},{"name":"Rob Savoye","email":"rob@senecass.com","avatar":"https://secure.gravatar.com/avatar/ea543e539878722646f6899d4e6484a0?s=500","location":"Unknown","bio":"I'm been a free software developer for 30 years, and winner of the FSF award for the Advancement of Free Software. I've been a core developer of many projects, primarily the GNU toolchain and Gnash. I've also done much GNU/Linux work for many organizations, including Redhat, Cannonical, Debian, FAA, NASA, etc...  In addition to being a hacker, I'm also a long-time climber, fire fighter and rescue volunteer up here in the Rocky Mountains of Colorado.\r\n","twitter":"","url":"http://www.senecass.com","organization":"Seneca Software \u0026 Solar, Inc.","shirt_size":"Men's M","title":"Open Data For Emergency Response","abstract":"This is a talk about finding open GIS data, and using open source tools to extend and manipulate the data to produce custom mobile maps that work offline.","description":"The goal of this project was to produce maps of the response area for my rural fire departments. Some of this involves utility programs I wrote that work with Open Street Map data. The process of making these maps can be done by anyone wanting to produce their on maps that work offline. I'll go over the quick and dirty of making maps, and drop down into more detail on working with the data sets.","notes":"You can see the maps and data sets I've been producing here: http://senecass.com/projects/Mapping/. I've gone far beyond just producing data sets and maps for my local fire departments. I've been adapting my tools and techniques to be more general purpose, for example making hiking maps of Cuba for my trip. I'll bring some huge data sets with me, as downloading them could take days. I'm both a long time software engineer and an officer in my local fire department.\r\n\r\nAlthough I said this was a talk, it could also be a workshop or hack session, or even both. All I need is a projector.\r\n","audience_level":"All","tag_list":["open data","mapping"],"rating":100.0,"state":"accepted","confirmed":false,"created_at":"2017-02-09T18:38:03.785Z"},{"name":"Sergey Bolshchikov","email":"sergey@bolshchikov.net","avatar":"https://secure.gravatar.com/avatar/f0fbd607aab5c6ec39213d2a24fbf339?s=500","location":"Israel","bio":"Team Lead at Wix with great passion to technology and knowledge sharing with 9 years of experience. Co-organizer of YouGottaLoveFrontend Conference and Ember-IL meetup group in Tel Aviv, Israel. \r\nM.Sc. in Information Systems from Technion - Israel Institute of Technology.\r\nhttp://bolshchikov.net ","twitter":"bolshchikov","url":"http://bolshchikov.net","organization":"Wix","shirt_size":"Men's M","title":"How to make a dev advocate from every engineer inside the company","abstract":"Developer relations of a company is not the job of 1 person or a team. It's a responsibility of every engineer in a company. \nIn this talk we will discuss how to promote the dev rel culture though out all developers. How to manage open source projects, encourage and facilitate meetups and more. ","description":"## Issue\r\nDeveloper relations for a IT company is not an easy way. It's a hard problem that solved in many different way, different heuristic approach.\r\nAt Wix, the company with over 500 engineers, we believe it's work not of 1 person or a team. It is a responsibility of everyone.\r\nWe all want to feed proud by the engineering part of a company where we work.\r\nBut how to achieve this? There's no silver bullet though.\r\n\r\n## Solution\r\nIn this talk we will discuss different approaches that worked and not so much at tackling problems:\r\n* open source projects\r\n* speaking at meetups\r\n* organizing workshops\r\n* organizing conferences, and more\r\n\r\nWe will try to answer \"simple\" question: how to convert every engineer to a dev rel of your company.","notes":"","audience_level":"All","tag_list":["developer","meetups","conference","relations","opensource","marketing","devrel"],"rating":87.5,"state":"accepted","confirmed":true,"created_at":"2017-05-03T16:04:50.472Z"},{"name":"Alicia V Carr","email":"fineblkwoman@me.com","avatar":"https://secure.gravatar.com/avatar/8a68115929998ab691a97e356a9e4d74?s=500","location":"Atlanta Georgia","bio":"About Alicia Carr \r\nIn 2012, while standing online at the Apple store waiting to buy my second generation iPad I met a 16-year-old young man. I asked him how did he get the money to buy an iPad and he told me he made a lot of money creating apps. Then I asked him how did he learn how to create an app. He said from youtube and That’s when I turn to my husband and told him “I want to do that.”\r\nI started learning how to code in May 2012. On November 2, 2012 (will never forget the day) my husband told me to quit my job to follow my dream to become a iOS developer.\r\nIt took me 1½ years to learn Objective C. After books and online courses I went through, I started working on the Purple Pocketbook in January 2014 and finished the first version in March 2014. After a month of submitting the app to Apple, it finally got approved on May 2, 2014.\r\nPurple Pocketbook is now Purple Evolution, Inc, (PEVO) the first domestic violence app for the state of Georgia which is now a national app.\r\nEarly 2014 I found and join the group called Women Who Code and I was so excited to be with other ladies wanting to connect and learn from each other that where coders as well. I then started the group within WWCODE called women iOS (WiOS) Developer Group.\r\nI became such an active member of the group over two years working with WWCODE that Erica Stanley Founder/Director of WWCode Atlanta and Alaina Percival CEO/Founder WWCode felt I was an excellent fit for the Director of the Atlanta chapter.\r\nAnd I love Women Who Code it like family.\r\nLiving my dream\r\nI am 53 years old, been married for 35 years, have 3 children and 8 grandchildren. I love life, and I am experiencing my dreams as often and as soon as I can achieve them. My passion in life has been to be an entrepreneur and help others to see life differently with strength and passion.\r\n\r\nWWDC2015 Morning Keynote\r\nhttp://www.apple.com/live/2015-june-event/322cd98d-5368-4c7b-891b-d7dff96b6714/\r\n\r\nI also premiered in Apple newBeginning Video\r\nhttps://www.youtube.com/watch?v=nJt871shTho\r\n\r\n","twitter":"fineblkwoman","url":"http://www.pevo.us","organization":"Women Who Code/ Purple Evolution, Inc. (PEVO)","shirt_size":"Women's 3XL","title":"Is it too late to learn how to program and how being a developer change my life","abstract":"How I became a developer in my 50th. the challenges, the assumption and the victories and how women are not being recognized as an important part of the tech community.","description":" I will talk about how and why I wanted to be an iOS mobile developer at the age of 51. How a 16 year inspire me to learn to code and the challenges I face after becoming an iOS developer being the first self-taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse and how Apple found me and was highlight at WWDC 2015 and 2016 keynote event.  Some people want to believe that people my age are out of touch with technology and as a woman, I have seen the best and the worst in the tech community but I know now that there is a solution at the end of the rainbow.\r\n\r\nI will talk about how early adopters no longer look like the stereotypical hoodie-wearing gadget nerd obsessing over the specs of the latest iPhone—in part because they’re no longer men. Today young women are beating men to technology trends.\r\n\r\nI also will talk about what people don't know is 70% of women are more active on our mobile device than men, women are more active with social media, shopping, photo apps, are more connected to entertainers and play more games on their smartphones. \r\n\r\nWith that being said we the tech community need to open up our arm and embrace the change and think about how women in tech can change the way we see and create apps. \r\n","notes":"Alicia V. Carr is the first self-taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse. She knew she had to utilize her acquired skills as a developer to make a difference.\r\n\r\nAlicia decided to combine her new learned skills and long-time passion for domestic violence prevention to create Purple Evolution, Inc (PEVO) App. \r\n\r\nEarly 2014 I join the group called Women Who Code and is now one of three Director of the Atlanta chapter.\r\n\r\nAlso, Apple has acknowledged me at the WWDC15 and 16 events.\r\nWWDC2015 Morning Keynote - http://www.apple.com/live/2015-june-event/322cd98d-5368-4c7b-891b-d7dff96b6714/\r\nApple newBeginning Video - https://www.youtube.com/watch?v=nJt871shTho\r\n","audience_level":"All","tag_list":["android","ios","women","women in tech","swift","java","javascript","dirversity"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-03-09T14:59:44.087Z"},{"name":"Ismael Olea","email":"ismael@olea.org","avatar":"https://secure.gravatar.com/avatar/8ff03356b634e87000204e165d0a3ab1?s=500","location":"Unknown","bio":"Tecnólogo y dinamizador de comunidades relacionadas con software libre.","twitter":"olea","url":"http://olea.org","organization":"HackLab Almería","shirt_size":"Men's 3XL","title":"HackLab Almería, un modelo de dinamización tecnológica hiperlocal","abstract":"Este trabajo resume varios años de actividad de dinamización tecnóloga en una ciudad mediana-pequeña española fuera de los ejes tecnológicos e industriales de España.","description":"HackLab Almería (http://hacklabalmeria.net/) es una «organización fluida» con vocación muy local de dinamización tecnóloga/tecnófila. Estimular la iniciativa personal, el auto aprendizaje, la experimentación tecnológica y las inquietudes STEM son todo un reto en Almería, una menos que mediana ciudad española situada en la periferia de los centros tecnológicos y científicos de España y Europa.  Más aún cuando se trata de una organización informal y sin recursos económicos.\r\n\r\n En este trabajo se expone una retrospectiva de nuestra actividad y hallazgos durante los años 2013, 14, 15 y 16.","notes":"\r\nUna versión previa de las transparencias: https://olea.org/conferencias/doc-conf-20161124-Encuentro-IBM/\r\nUna versión más completa, en formato Freemind: https://olea.org/diario/2016/09/26/Retrospectiva-HackLab_Almeria.html","audience_level":"All","tag_list":[],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-02-14T09:24:28.984Z"},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"Coding Education For All","abstract":"An approach to teaching coding that does not create a false sense of competence.","description":"Long gone are the days when technology was just for the \"nerds\". Today, technology touches every industry and many parts of our personal lives and this trend will only continue to grow. Moving forward, those with the ability to understand the language of technology will be better positioned to take advantage of what lies ahead yet very few non-techies understand or even recognize the shifts that are taking place. As technology continues to move forward, the non-technical continue to fall further behind. In an effort to address this issue, I propose an introduction to technology process that will make becoming technically literate an option for the masses.\r\n\r\nDetails:\r\n1. The importance of being code literate \r\n2. The challenges with current coding education platforms \r\n3. Let’s start with the basics\r\n","notes":"","audience_level":"All","tag_list":["learning to code","newbies","developers","programming","bootcamps"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-03-09T15:07:15.482Z"},{"name":"#Geochicas","email":"seleneyang1@gmail.com","avatar":"https://secure.gravatar.com/avatar/f5c68815369c7e114111a907eede5eb0?s=500","location":"Unknown","bio":"","twitter":"srta_peperina / mapeadora ","url":"https://geochicas.github.io/","organization":"GeoChicas OpenStreetMap","shirt_size":"Women's M","title":"Panel sobre #GeoChicas Rol y participación de las mujeres en comunidades tecnológicas ","abstract":"El colectivo #Geochicas de OpenStreetMap realizará un panel sobre el rol y la participación de las mujeres en comunidades tecnológicas abiertas. El panel es parte del seguimiento y recorrido de un análisis de situación iniciado en Noviembre en Sao Paulo para el State of the Map Latam. ","description":"El panel está abierto a aquellas mujeres que quieran participar de la discusión sobre la importancia del cierre de la brecha de género en las comunidades tecnológicas. En el caso de #Geochicas, se hablará desde la comunidad de OpenStreetMap, sin embargo todas las mujeres que  participen del Cubaconf podrán ser parte de la mesa para socializar, conocer y reconocer nuevas experiencias sobre el rol y la participación de las mujeres en las diferentes comunidades.","notes":"La realización de este panel es parte de un proyecto latinoamericano a largo plazo desde donde #Geochicas queremos socializar las diferentes formas en que se construye la pertenencia en comunidades como OpenStreetMap, al igual que en otras comunidades abiertas. El colectivo de #GeoChicas cuenta con casi 30 participantes de 12 países distintos que trabajamos conjunta y participativamente para cerrar la brecha de género en OSM. ","audience_level":"All","tag_list":["mujeres","genero","geochicas","openstreetmap"],"rating":100.0,"state":"accepted","confirmed":false,"created_at":"2017-02-10T18:18:27.744Z"},{"name":"Leonel Salazar Videaux","email":"leonel.lordford@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/12897/me02.jpg","location":"Holguín, Cuba","bio":"Ing. en Ciencias Informáticas;\r\nusuario de GNU/Linux desde 2003;\r\nfundador del GUTL;\r\nparticipante en FLISOL desde 2009;\r\nProgramador;\r\nentusiasta del SWL","twitter":"","url":"http://debianhlg.cubava.cu","organization":"Universidad de Holguín","shirt_size":"Men's M","title":"Experiencias de la comunidad de usuarios de Debian GNU/Linux en la Cuba Profunda","abstract":"Participar en un taller sobre comunidades de Debian GNU/Linux para intercambiar experiencias sobre actividades, uso de recursos, divulgación, buenas prácticas, etc... principalmente desde el enfoque de las ciudades alejadas de los centros de avanzada en materia de tecnología.","description":"Participar en un taller sobre comunidades de Debian GNU/Linux para intercambiar experiencias sobre actividades, uso de recursos, divulgación, buenas prácticas, etc... principalmente desde el enfoque de las ciudades alejadas de los centros de avanzada en materia de tecnología. Pensamos mostrar resultados de trabajos comunitarios realizados en le Oriente de Cuba, en particular Holguín y Manzanillo (provincia Granma), pero con el ánimo de sumar a todos los interesados en cualquiera de las acciones que se puedan realizar.","notes":"","audience_level":"Beginner","tag_list":["taller","debian","comunidad"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-04-28T17:43:38.972Z"},{"name":"Karina Serfaty","email":"keserfaty@gmail.com","avatar":"https://secure.gravatar.com/avatar/3378b062dd744115ccca258215ebcec6?s=500","location":"Unknown","bio":"Mi nombre es Karina Serfaty soy programadora con un altísimo amor por generar proyectos gratuitos, pequeños y de código abierto. Soy además Licenciada en Ciencias de la Educación y estudiante de Ingeniería Eletrónica. Trabajo hace 5 años contribuyendo a la comunidad docente y, actualmente, coorganizando eventos como Meetup.js en Buenos Aires en donde tenemos por objetivo este año difundir la programación entre grupos más diversos de la sociedad.\r\nAdemás de todo esto todo el piano, me gusta muchísimo la matemática y leer libros de historia.","twitter":"keyserfaty","url":"","organization":"Wingu Ambassador \u0026 Senior Javascript Engineer en Shiftgig","shirt_size":"Women's S","title":"¿Cómo conectar alumnos, maestros y escuelas con software libre?","abstract":"Contaré acerca de mi experiencia capacitando a 600 docentes en el uso de tecnologías que los ayudaron a mejorar su forma de dar clase, su conexión con las familias de los estudiantes y con la comunidad escolar. Presentaré además una herramienta de código abierto que colabora con este propósito.","description":"¿Cómo sería un sistema educativo en que los maestros pudieran saber de cada paso que sus alumnos están haciendo en su aprendizaje? ¿O uno en el que los padres y maestros pudieran estar en contacto todo el tiempo?; ¿o en el que directivos pudieran saber exactamente la situación en sus aulas? \r\nEn esta charla me propongo contarles acerca de nuestra experiencia en Wingu capacitando a 600 docentes de un municipio en el uso de tecnologías gratuitas para escuelas. Estas capacitaciones no fueron solo acerca de cómo usar una herramienta particular, fueron fundamentalmente sobre cómo usar las herramientas que los docentes ya tenían de formas creativas para comunicarse mejor entre ellos y con la comunidad.\r\nAlgunos de los proyectos de los docentes que surgieron después de estas capacitaciones fueron una carpeta compartida entre docentes con planificaciones de clase, documentos compartidos entre padres y maestros para acordar sobre fechas de reuniones, correcciones en tiempo real de los trabajos de los estudiantes y muchísimas más cosas.\r\nAdemás de esta experiencia, aprovecharé para presentar una herramienta gratuita y de código abierto para que los maestros tengan mejor feedback a lo largo de sus clases.","notes":"Los únicos requerimientos técnicos son un cable HDMI y un proyector para mostrar la presentación. Si hubiera conexión a internet (aunque sea de muy baja velocidad) podría invitar a toda la gente de la audiencia a utilizar en tiempo real conmigo la herramienta que me gustaría presentar (esta herramienta está pensada especialmente para conexiones de internet de baja velocidad porque tienen que funcionar en escuelas con los dispositivos móviles que tengan los estudiantes).","audience_level":"All","tag_list":["tecnología","educación"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-02-10T13:58:01.656Z"},{"name":"Diego Accorinti","email":"diegoacco@gmail.com","avatar":"https://secure.gravatar.com/avatar/bf55ec8b1282a6b54eb55a7c30aa202f?s=500","location":"Unknown","bio":"Soy Diego Accorinti y vivo en Ciudad de Buenos Aires, Argentina. Soy diseñador multimedial y programador. Tengo 35 años.\r\nActualmente trabajo en el Equipo de desarrollo de Huayra gnu/linux, el sistema operativo libre educativo del Programa Conectar Igualdad. Viajo mucho recorriendo provincias y difundiendo software libre y su filosofía.\r\nDesde 2015 soy Coordinador Nacional del capítulo Argentina de FLISOL -festival latinoamericano de instalación de software libre-  con más de cuarenta sedes, se trata de un evento de la comunidad para la comunidad, federal, independiente, plural e inclusivo.","twitter":"diegoacco","url":"http://www.enmanosdenadie.com.ar/diego/","organization":"FLISOL Argentina · Educ.AR (Ministerio de Educación de la Nación Argentina)","shirt_size":"Men's 2XL","title":"Huayra GNU/Linux,  experiencias con software libre en el Programa Conectar Igualdad de Argentina","abstract":"Mi charla es sobre el proceso de desarrollo y la implementación de una distribución de gnu/linux educativa -Huayra GNU/Linux- en el sistema educativo argentino, a través de una política de inclusión digital y social llamada Programa Conectar Igualdad. Aciertos, errores y futuro.","description":"Huayra gnu/linux pudo haber sido la revolución educativa argentina,  en mi charla propongo recorrer los inicios del proyecto que acompaño a otro no menos ambicioso, el Programa Conectar Igualdad entregó 5 millones de computadoras a todos los estudiantes de nivel medio de escuelas públicas en Argentina.  La mayoría de esos equipos salieron con doble-boot  donde Huayra era la opción de software libre, completamente diseñado por un equipo local y adaptado a las necesidades socio-económicas y geográficas de los docentes y estudiantes argentinos.  Planteo analizar aciertos y errores del proyecto,  su alcance y proyección futura.  ","notes":"Diego Accorinti es Coordinador Nacional de FLISOL en Argentina [ www.flisol.org.ar ]","audience_level":"All","tag_list":["tic's","pedagogía","inclusión digital","educación","programa conectar igualdad","huayra gnu/linux"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-03-02T17:54:16.175Z"},{"name":"Patrick Kettner","email":"patrickkettner@gmail.com","avatar":"https://secure.gravatar.com/avatar/3fada965c1f65adc0599bb9cd606524d?s=500","location":"seattle","bio":"Patrick Kettner won an 8th grade talent show singing Gloria Gaynor's 1978 disco hit \"I Will Survive\", and things have been looking up ever since. He has traded in the golden microphone for a PM position on Microsoft Edge, as well as being the lead developer for Modernizr. He lives in Seattle with his wonderful partner Katrina, son Holden, and dog Baxter.","twitter":"patrickkettner","url":"https://github.com/patrickkettner","organization":"Microsoft","shirt_size":"Men's L","title":"javascript without javascript","abstract":"Via amazing open source libraries, we can now transpile nearly any programming language to JS, making it a sort of modern assembly language. In a fun and code heavy talk, I'll show how to leverage pre existing libraries today in order to get amazing performance and features in your current web apps.","description":"My talks are code heavy and full of real world use cases. It pushes the limits of what can (or should) be possible on the web today, but there are many takeaways that can be applied to most production environments today.To top it off, a sneak peak into what the future of web perf could look like.\r\n","notes":"","audience_level":"All","tag_list":[],"rating":75.0,"state":"submitted","confirmed":false,"created_at":"2017-05-13T08:01:42.043Z"},{"name":"Patrick Kettner","email":"patrickkettner@gmail.com","avatar":"https://secure.gravatar.com/avatar/3fada965c1f65adc0599bb9cd606524d?s=500","location":"seattle","bio":"Patrick Kettner won an 8th grade talent show singing Gloria Gaynor's 1978 disco hit \"I Will Survive\", and things have been looking up ever since. He has traded in the golden microphone for a PM position on Microsoft Edge, as well as being the lead developer for Modernizr. He lives in Seattle with his wonderful partner Katrina, son Holden, and dog Baxter.","twitter":"patrickkettner","url":"https://github.com/patrickkettner","organization":"Microsoft","shirt_size":"Men's L","title":"progressive what apps?","abstract":"PWAs are one of the hottest things to come to the web in years, but is it just hot air? In a hands on talk, I'll show how PWAs are truly meant to be progressive - building on an evolution of web tech nearly as old as the web itself, and still let you ship one of the most cutting edge web apps around","description":"Using real world code examples, i'll show how I built offline apps for browsers from nearly 20 years ago! Attendees will be able to learn how you can start to use these new shiny web platform features today - resulting in lighting fast web apps, and web sites too","notes":"https://www.youtube.com/watch?v=04PLreql9Iw\r\nhttp://www.creativebloq.com/netmag/new-issue-net-out-now-use-tomorrows-techniques-today-71621162","audience_level":"All","tag_list":["javascript","pwa","progressive web apps"],"rating":50.25,"state":"submitted","confirmed":false,"created_at":"2017-05-13T08:00:35.718Z"},{"name":"Selene Yang - Celine Jacquin","email":"seleneyang1@gmail.com","avatar":"https://secure.gravatar.com/avatar/f5c68815369c7e114111a907eede5eb0?s=500","location":"Unknown","bio":"","twitter":"srta_peperina / mapeadora","url":"https://geochicas.github.io/","organization":"GeoChicas OpenStreetMap","shirt_size":"Women's M","title":"Taller de mapeo con enfoque de género","abstract":"Realizaremos un taller de mapeo con enfoque de género que se dividirá en 3 momentos\n1er: Lluvia de ideas y mapeo conceptual con participantes\n2do: Capacitación con herramientas y presentación de metodología de mapeo.\n3er: Salidas al barrio para mapeo y análisis de datos.","description":"Parte del colectivo de mujeres #GeoChicas, grupo de mujeres latinoamericanas colaboradoras del proyecto de OpenStreetMap, seremos las responsables facilitadoras del taller de mapeo de recursos urbanos. El objetivo es poder explorar y reconocer la diferencia de género, a través del cómo los individuos utilizan, perciben y se proyectan en el espacio que les rodea. El taller está enfocado especialmente en la construcción de cartografías con un enfoque social dirigido hacia las necesidades de las niñas y mujeres en la comunidad, entendiendo los mapas como un reflejo político, social y cultural de quienes lo producen.","notes":"Realización del taller:\r\n-Mini presentaciones sobre la cartografía participativa como motor de planeación urbana y desarrollo equitativo. \r\nDiscusión grupal a modo de Grupo Focal y “mapeo mental” para pre/identificar los elementos del barrio más importantes según esta comunidad de mujeres.\r\n-Presentación de la metodología, y del mapeo con Field Papers, organización de los grupos y la dinámica.\r\n-Mapeo por grupos alrededor de la Escuelita, por sectores geográficos utilizando Field Papers. Los asistentes que cuentan con teléfono móvil y acceso a Internet utilizarán una app móvil de mapeo (OSM-Tracker). Se identificarán los puntos de interés útiles que aporten a un desarrollo integral de la comunidad, así como los “no-lugares” y zonas de inseguridad que afectan especialmente a las mujeres.\r\n\r\nEl taller estará a cargo de Celine Jacquin (@mapeadora) de OSM México, RepuBikla, Selene Yang (@seleneyang) de Nicaragua, Noemi Ticona Angles (@nah_omy) de Bolivia.","audience_level":"All","tag_list":["openstreetmap","genero"],"rating":100.0,"state":"accepted","confirmed":true,"created_at":"2017-02-10T17:08:32.491Z"},{"name":"Andrés Mijares","email":"andresmijares@gmail.com","avatar":"https://secure.gravatar.com/avatar/0c761ae74284a41e40aed5c0822cc02f?s=500","location":"Argentina","bio":"I'm a software engineer, former elite athlete, currently working as Front-end Director at Shiftgig. I also collaborate with several organizations in Buenos Aires to deliver free software lessons for anyone who is interested in learning.","twitter":"andresmijares25","url":"http://andresmijares.com","organization":"Shiftgig","shirt_size":"Men's M","title":"From a chaotic MVP to scalable React application in only 3 months.","abstract":"A business perspective of how we went from a chaotic application focus on time to market to a scalable, tested and reliable solution using the React ecosystem and all the other stuff that they don't teach you on `todo` samples.","description":"Technology for the sake of technology is a lie, when time to market is the most important quality attribute; developers and business rarely go hand in hand. According to an AngelList search, there are more than 20000 technology startups only in the San Francisco Bay area by 2016, this coupled with a best seller predicating the importance of the Minimum Viable Product compromise in most cases the quality of the code which we deal on daily basis in a industry where shipping features is more important than their quality per se. In particular, this paper looks at one specific conflict that a company deals with on early stages when creating software products, 'the gap between quality of the code and the business goals'. I will present a case in how after a few rounds of founding and getting more than 33 millions USD, we were forced to start from scratch and build an application which not only satisfy the market and the investors expectations but also make the ongoing day of front end developers more enjoyable using nothing more but the tools exposed by the React ecosystem and finally how a decision like this taken from early stages could also solve most of the issues that we deal with when work on legacy code according to the 20/80 rule also known as a Pareto distribution.","notes":"This is a high level talk, it's related to management, how you pass from zero to giant after a founding meeting, applications are growing in size, resources and persons involved, actually, this a topic that no-one is talking about, no-one tells you how to deal with an application that you can control anymore, no-one tells about the job they have left cause code that affect your mental health, and at the end of the day, technical and business skills really matters, and why it's important to manage Front end teams as business unit. I've done this only using the React Ecosystem, an amazing team and process, process process... and finally I really want to share it.","audience_level":"Advanced","tag_list":["react"],"rating":75.0,"state":"submitted","confirmed":false,"created_at":"2017-05-03T15:41:08.420Z"},{"name":"Artem Denysov","email":"denysov.artem@gmail.com","avatar":"https://secure.gravatar.com/avatar/c21649784274bf95bbaf8ca28d160ae3?s=500","location":"Ukraine","bio":"I'm software engineer spending free time helping different Open Source projects. \r\nI've been helping guys from [@marionettejs](https://marionettejs.com/), [@brunch](http://brunch.io/). With collaboration with other guys built [pwmetrics](https://github.com/paulirish/pwmetrics/) and other small stuff.","twitter":"denar90_","url":"https://github.com/denar90","organization":"Open Source","shirt_size":"Men's M","title":"Improve your web application performance using Progressive Web Metrics","abstract":"Defining performance bottlenecks is a hard task.  Progressive Web Metrics are the latest number of metrics used for making this task easier. Using it, different techniques, Open Source tools altogether for real project, performance can be improved in 2x time really easy.","description":"Measuring page load is hard. Are there better metrics then ‘load’ event for representing page load time? How to represent user’s performance perception? Etc...\r\nI’ll talk about \"Progressive Web Metrics\" which are going to solve these problems. Explain how to measure web page load (based on last Google/Chrome dev team researchers) and improve it using as example real Open Source project. Which tools are available for taking these measurements. The profit you can achieve using them.","notes":"Last time I've been working together with Paul Irish and other folks on [pwmetrics](https://github.com/paulirish/pwmetrics) project and wrote a simple [article](https://medium.com/@denar90/easy-progressive-web-metrics-9afa5ed857c2) which helps people identify performance bottlenecks in their applications. So I can explain how in limited networks, slow connection and other stuff improve application performance using real Open Source project (for my previous talk, I used babel.js site as an example for improving performance and made [pull request](https://github.com/babel/babel.github.io/pull/1234) but for future talk, another open source project might be chosen).\r\nI already have a presentation and can talk with my own laptop. So I just need a place to stay and ticket if it's possible. Thanks.","audience_level":"All","tag_list":["metrics","performance","javascript"],"rating":70.0,"state":"submitted","confirmed":false,"created_at":"2017-05-03T14:19:10.087Z"},{"name":"Philip Ballew","email":"philipballew@gmail.com","avatar":"https://secure.gravatar.com/avatar/41a37b2380dfeca48bf6436d145291e4?s=500","location":"Unknown","bio":"Philip Ballew is a dedicated Ubuntu user, community grower, and all around proponent of the growth of free software in our world. Philip has traveled all over the world and spoken at major free software conferences from Fosdem to SCALE. Philip calls California home and can not wait to meet even more open source users there, and abroad. \r\n","twitter":"philipballew","url":"","organization":"Ubuntu","shirt_size":"Men's M","title":"Customize the Ubuntu Desktop: Hacks, Apps and Snaps.","abstract":"My talk will go over how to make the Ubuntu Desktop loaded with even more features. I will talk about how to change and add features to the Ubuntu desktop, as well as new package management methods. in addition, I will show some system files I have edited to make the desktop more feature filled.","description":"I will go over the Ubuntu Desktop and show you how to customize the desktop, from editing Unity to have even more features, do adding custom scripts that will allow you to increase productivity. I will go over Gnome, the desktop Ubuntu is switching to, showing the differences between Gnome, Unity and how to make the switch from one to the other. I will then show people how to add containerized applications that can install multiple versions of software with Snaps, Ubuntu's new packaging format. From editing what happens when your laptop suspends, such as adding features you can not find on the System Settings, all the way to adding and implementing custom desktop files that will make Ubuntu perform additional features, this talk will have it all. \r\n","notes":"I cannot wait to come and speak and also come and see Cuba. It will be my first time there and I am very excited to come if I am selected. ","audience_level":"All","tag_list":["linux","ubuntu"],"rating":70.0,"state":"submitted","confirmed":false,"created_at":"2017-04-12T01:28:38.754Z"},{"name":"Drasko DRASKOVIC","email":"drasko.draskovic@gmail.com","avatar":"https://secure.gravatar.com/avatar/41e30e441274d438333adaf6db8f8b9d?s=500","location":"Unknown","bio":"Draško is an Electronics Engineed and has over 15 years of professional experience gained in Fortune 500 companies as well as technological start-ups - companies like Texas Instruments, Sequans Communications, Alcatel-Lucent and NOKIA - where he was working on embedded systems, semiconductor and telecommunication technologies.\r\n\r\nAdditionally, Draško earned his reputation in Open Source community by being constantly involved and contributing to projects dealing with low-level kernel programming and Linux device drivers like OpenWrt platform, OpenOCD JTAG debugger, Linux kernel and RIOT RTOS.\r\n\r\nDuring these years Draško gained valuable expertise in software and hardware networking technology, distributed networks, wireless communication, smart devices, microcontrollers, sensor networks, gateways, mobile telecommunications, radio frequency technology and interconnection of networked embedded devices with higher-level applications using Web technologies.\r\n\r\nHe holds MSc degree in Electrical Engineering from Belgrade University.","twitter":"draskodraskovic","url":"https://github.com/Mainflux/mainflux","organization":"Mainflux","shirt_size":"Men's L","title":"Open Source IoT: Acrhitecture, Requirements and Implementation","abstract":"IoT device management and multi-protocol messaging platform demands specific architectural decisions and high-concurrency approaches due to the massive number of devices we expect to be connected in the near future. Open source SW offers very good benefits and can adequately respond to the problem.","description":"## IoT Platforms \r\nIoT platforms are most often used as a middleware, that means as a SW server (set of servers in fact) that provides several functionalities and services that are usually needed in designing IoT applications. They often have following roles:\r\n\r\n- Device manager - accepts device connections on southbound interface\r\n- Application manager - accepts application connections on northbound interface\r\n- Messaging bridge - relays messages between devices and applications\r\n- Time-series storage engine - stores and queries measurements datapoints in the time-series format\r\n- CEP machine with rules engine - it does Complex Event Processing of incoming time-series streams and can automatize triggers and actions based on configurable set of rules\r\n\r\nMost often they need to be \"multi-protocol\" in order to support several networking protocols that proliferate in IoT world:\r\n\r\n- HTTP\r\n- WebSocket\r\n- MQTT\r\n- CoAP\r\n\r\nWe will analyze an architecture, implementation and testing procedures needed for creating an industry-grade IoT platform on the example of popular open-source project Mainflux (https://github.com/Mainflux/mainflux).\r\n\r\n## Mainflux\r\nMainflux IoT Platform provides a set of clean and open APIs to easily connect, monitor, manage and provision any device or sensor, enabling IoT products and systems, simplifying entire IoT development process.\r\n\r\nIn order to enable high scalability needed for IoT stampede of devices, Mainflux has been written in highly concurrent languages – notably in Go (with some Erlang components). Over two years of iterations and tuning we came to the architecture that we think is adequate for large-scale deployments.\r\n\r\nSystem has been secured with custom scheme based on scoped JWTs used for device and application API keys which tens to be simple but effective and capable to provide fine-grained security.\r\n\r\nBeing device and protocol agnostic, Mainflux can be used for development of various IoT use-cases. One of particularly interesting scenarios is using Mainflux based network as LoRaWAN LPWAN networking infrastructure, where it can be used by IoT operators in Smart City context.\r\n\r\n## LoRaWAN\r\nLoRaWAN is a Low Power Wide Area Network with features that support low-cost, mobile, and secure bi-directional communication for Internet of Things (IoT), machine-to-machine (M2M), and smart city, and industrial applications. LoRaWAN is optimized for low power consumption and is designed to support large networks with millions and millions of devices. Innovative features of LoRaWAN include support for redundant operation, geolocation, low-cost, and low-power - devices can even run on energy harvesting technologies enabling the mobility and ease of use of Internet of Things.\r\n\r\nLoRaWAN server (https://github.com/brocaar/loraserver) is equally written in Go, using GRPC for internal component communication. It exposes HTTP and MQTT interfaces to which Mainflux hooks-up, making complete low-power long-range IoT solution.","notes":"I am a main architect and author of Mainflux project: https://github.com/Mainflux/mainflux. I am also a telecom engineer with over 15 years of industry experience, out of which last 5 oriented towards IoT. Prior to starting Mainflux project, I have designed WeIO IoT hardware (http://we-io.net/), which was funded on Indiegogo (https://www.indiegogo.com/projects/weio-platform-for-web-of-things#/) gained huge many awards (http://www.postscapes.com/internet-of-things-awards/winners/).\r\nI have held many conferences world-wide (http://conferences.oreilly.com/oscon/oscon2014/public/schedule/speaker/173105, https://archive.fosdem.org/2016/schedule/event/mainflux/, https://ons2017.sched.com/event/9x8L/tutorial-iot-and-networking-introduction-architecture-requirements-implementation-drasko-draskovic-janko-isidorovic-mainflux) on the subject of IoT, LPWAN and embedded systems on some of the biggest open-source conferences. ","audience_level":"All","tag_list":["security","docker","iot","webservices"],"rating":80.0,"state":"submitted","confirmed":false,"created_at":"2017-04-05T23:02:33.401Z"},{"name":"Hector Manuel","email":"refucktor@aleph.engineering","avatar":"https://secure.gravatar.com/avatar/bbe23b30d95afebb4c330a039cf5ea65?s=500","location":"Unknown","bio":"","twitter":"","url":"","organization":"aleph.engineering","shirt_size":"Men's S","title":"Bring color to your work","abstract":"HAL is an small opensource project to use led bulbs on your projects, Continuous Integration System and so on. Simplest API to have access to colors changing on bulbs and triggers.","description":"# Happy Light (HAL)\r\nHAL is an small opensource project to use led bulbs on your projects, Continuous Integration System and so on. Simplest API to have access to colors changing on bulbs and triggers.","notes":"# Happy Light (HAL)\r\nHAL is an small opensource project to use led bulbs on your projects, Continuous Integration System and so on. Simplest API to have access to colors changing on bulbs and triggers.","audience_level":"All","tag_list":["jenkins","api","nodejs","python"],"rating":50.2,"state":"submitted","confirmed":false,"created_at":"2017-03-31T20:15:45.973Z"},{"name":"Matias Insaurralde","email":"matiasbaruchinsaurralde@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/5240/brooklyn_bridge.jpg","location":"Paraguay","bio":"I'm a software engineer (most of the time) :)","twitter":"matias_baruch","url":"http://matias.insaurral.de/","organization":"Tyk Technologies Ltd.","shirt_size":"Men's M","title":"Una historia de APIs y open source","abstract":"Me gustaría compartir mi experiencia trabajando en Tyk, un API gateway open source que actualmente tiene miles de usuarios en todo el mundo.\nSomos una pequeña empresa de Inglaterra, fundada en el 2015 y con un modelo de negocio construido sobre open source.","description":"La idea de la charla es comentar un poco sobre cómo llegamos a este punto, cuál es la visión y la cultura de la empresa y cómo nos conectamos con la comunidad.\r\nPueden encontrar más sobre Tyk en Github: https://github.com/TykTechnologies/tyk","notes":"","audience_level":"All","tag_list":["open source","apis"],"rating":70.0,"state":"submitted","confirmed":false,"created_at":"2017-03-29T07:13:58.849Z"},{"name":"Nick Heiner","email":"nick.heiner+github@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/11410/cousins_party_crop.jpg","location":"Washington, DC","bio":"Nick is a senior software engineer at the [United States Digital Service](https://www.usds.gov/). Prior to that, he worked at Opower, Google, and Microsoft, and graduated from Cornell. He has contributed to open source projects like Eslint, Bower, Foundation, and Chai. [He writes about technology and politics on Medium](https://medium.com/@nickheiner).","twitter":"nickheiner","url":"https://medium.com/@nickheiner","organization":"United States Digital Service","shirt_size":"Men's M","title":"How to Run a High Functioning Team","abstract":"Many teams have superficially similar processes, but not all teams are equal. What's the secret to high functioning teams that consistently produce great results? In this highly-opinionated talk, I'll share lessons from Google and Microsoft, mixed remote teams, a startup, and the US government.","description":"What's the difference between teams that hit their goals quarter after quarter, and those that miss? How does a team get the most value out of a practice like standups, and when is it just going through the motions? In this talk, we'll discuss common software engineer practices and the high- and low- functioning ways to do them:\r\n\r\n* Standup\r\n* Retro\r\n* Code review\r\n* 1:1s\r\n* Sprint planning / backlog grooming / task decomposition\r\n* Role of embedded QAs\r\n* Handling remote teammates\r\n\r\nBy the end, you'll be inspired to process-hack on your own team to improve velocity and team happiness!","notes":"I have a two rough drafts of Medium posts that have some of this content: [What a High-Functioning Team Looks Like](https://medium.com/@nickheiner/a-gentle-introduction-to-agile-or-what-a-high-functioning-team-looks-like-1465358de46a) and [\"I'm Allergic to Process\"](https://medium.com/@nickheiner/im-allergic-to-process-6b1f2432ccc2). They're not exactly what I'd present, and if I publish those posts, I'll present something different, but they gives you an idea of what I'm talking about.\r\n\r\nI've worked with a ton of different types of teams, which has given me a broad perspective on what works and what doesn't:\r\n\r\n* Cornell – undergrads with high aptitude but low experience trying to figure things out as we went\r\n* Microsoft – a company that got successful in the waterfall era, trying to move to agile\r\n* Google – one of the highest-functioning organizations in the world\r\n* Opower – an organization maturing its people, tech, and processes from cowboy-coding startup to established, stable public company\r\n* USDS – Various high- and low- functioning teams in the US government. I've worked on a high functioning team that successfully launched a product in Afghanistan, and low functioning teams that had a 45 minute standup every day with 37 people on the call.\r\n\r\nI've also spent a lot of time talking to friends at other companies about what works and doesn't on their teams. Across this experience, I've seen:\r\n\r\n* Teams stick together for years and invite each other to their weddings\r\n* Teams almost tear themselves apart because of divergent personalities\r\n* Teams be successful at having remote teammates\r\n* Teams fail at having remote teammates\r\n* Teams build the right thing for their users\r\n* Teams waste a year building the wrong thing\r\n* QA workflows that deliver stable software\r\n* QA workflows that consume calories without providing value\r\n* 1:1s that keep the manager and managee on the same page and feeling good\r\n* 1:1s that make the managee want to quit\r\n\r\nI would like to distill the lessons learned separating the successes from the failures so we can have more high-functioning teams in the world.","audience_level":"All","tag_list":["process","agile","team-dynamic","software-engineering","distributed-teams"],"rating":70.0,"state":"submitted","confirmed":false,"created_at":"2017-03-27T19:33:32.427Z"},{"name":"Alizishaan Khatri","email":"alizishaan.khatri@gmail.com","avatar":"https://secure.gravatar.com/avatar/11666cbce9f44e9389caa6e274a1144f?s=500","location":"Buffalo/Niagara, New York Area","bio":"Alizishaan's professional passions revolve around two things : using technology to solve real-world problems and sharing solutions with the community. Over the summer of 2016, he designed and built a status communication system for a Silicon Valley company that minimized false alerts. He is currently building a price-prediction system for a New York startup. \r\n\r\nOutside of work, Alizishaan's passions include mountaineering, skiing, travelling and photography.  ","twitter":"","url":"https://www.linkedin.com/in/alizishaan-khatri-32a20637/","organization":"ACV Auctions","shirt_size":"Men's M","title":"Simplifying Component Status Communication","abstract":"Are false-positive alerts giving your operations’ team sleepless nights?\n\nThis talk will take a look at simplifying status reporting from the operations’ team and the end consumers’ perspectives. Using cutting-edge tech, you will learn how to build a version-controlled status reporting system.","description":"Monitoring alerts from APM and other tools are being notoriously linked to alert-fatigue among the on-call operations team members. A significant fraction of these are false positives which end up wasting engineering / troubleshooting time. It is also not unusual to have different APM software to monitor different parts of the tech stack. Also, the potential for output customization in APM software is limited.\r\n\r\nYou will learn how to build a customizable status communication system / pipeline. You will gain insights into effective status communication strategies and tricks to minimize false positive alerts. Last, you will learn how to leverage version control to seamlessly switch between different status communication / alerting configurations. (Potentially perform Blue-Green deployments and/or AB Testing of the dashboard)","notes":"The proposed system leverages the use of a could-based on-demand computing service like AWS Lambda for the purpose of status communication. I will draw from my experience of building a status communication system for a Silicon Valley company.","audience_level":"All","tag_list":["#python","#reliability","#visualization","#architecture","#big data"],"rating":50.25,"state":"submitted","confirmed":false,"created_at":"2017-03-13T21:00:09.471Z"},{"name":"Mark Bates","email":"mark@markbates.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1/markbates_headshot.jpg","location":"Boston, MA","bio":"Mark Bates is a full stack web developer with over 18 years of experience building high quality scalable applications for companies such as Apple, USA Today, Klarna, and Palm. He has written three books, “Distributed Programming with Ruby”, “Programming in CoffeeScript”, and “Conquering the Command Line”. Mark has spoken at conferences around the world, has led user groups such as Boston Ruby and Boston Golang, and has helped to organize conferences such as GothamGo and GopherCon.\r\n\r\nMark is the co-founder of [PaperCall.io](http://www.papercall.io/speakers/markbates), a platform for connecting technical events with high quality content and speakers. Mark is also a partner at [Gopher Academy](https://www.gopheracademy.com), the industry leader for Go training and conferences.\r\n\r\nIn his spare time Mark leads development of the Go web framework [Buffalo](http://gobuffalo.io).","twitter":"markbates","url":"http://www.markbates.com","organization":"@markbates","shirt_size":"Men's XL","title":"Getting to Know Go","abstract":"In this laid back session we'll crack open VIM and find out what the buzz around the Go programming language is all about. Live coding, questions, answers, and a whole lot of concurrent fun will be had by all!","description":"When one of the world's largest companies, Google, says they built a language to solve their scalability and reliability issues, don't we owe it to ourselves to listen? [Go](https://golang.org) is that language, and you know what, it's pretty freakin' impressive.\r\n\r\nIn this session we'll open an editor and build some code. This session is laid back, and meant to be interactive. There are few slides and \"prepared content\", instead we'll write some code live and have fun learning Go.\r\n\r\n### Some Topics covered:\r\n\r\n* What is Go?\r\n* Basic language idioms\r\n* Cross platform binaries\r\n* goroutines\r\n* Channels and synchronization\r\n* Embedding and Composition\r\n* Web development [Buffalo](http://gobuffalo.io)\r\n\r\nWhile these topics can only be covered at high-level due to time constraints the audience will come away with a deep understanding of what Go is (and isn't) and when it should be used (and should not).","notes":"","audience_level":"All","tag_list":["go","buffalo","web","golang"],"rating":83.3333333333333,"state":"submitted","confirmed":false,"created_at":"2017-03-13T14:11:22.105Z"},{"name":"Mark Bates","email":"mark@markbates.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1/markbates_headshot.jpg","location":"Boston, MA","bio":"Mark Bates is a full stack web developer with over 17 years of experience building high quality scalable applications for companies such as Apple, USA Today, Klarna, and Palm. He has written three books, “Distributed Programming with Ruby”, “Programming in CoffeeScript”, and “Conquering the Command Line”. Mark has spoken at conferences around the world, has led user groups such as Boston Ruby and Boston Golang, and has helped to organize conferences such as GothamGo and GopherCon.\r\n\r\nMark is also the co-founder of [PaperCall.io](http://www.papercall.io/speakers/markbates), a platform for connecting technical events with high quality content and speakers.","twitter":"markbates","url":"http://www.markbates.com","organization":"@markbates","shirt_size":"Men's XL","title":"Buffalo: Rapid Web Development in Go","abstract":"Put the fun back in writing Go web applications using the [Buffalo](http://gobuffalo.io) framework. A Ruby on Rails inspired, idiomatic, web framework written in Go. Fun, Fast, and easy!","description":"I have spent the past 18 years building web applications. Starting with ASP 3.0, then to Java, then to Php, then to Ruby, now Go. I have seen it all. I love Go, but the current state of web development is painful. I continually keep turning to Ruby on Rails. This needs to stop now. Welcome [Buffalo](http://gobuffalo.io)!\r\n\r\nThis talk goes in-depth into Buffalo; the Go web framework. Inspired by Ruby on Rails, this framework aims to make web development in Go both fun, and easy. By curating the best, and most stable, packages, wrapping them together in a friendly, and idiomatic, way, with a dash of code generation, Buffalo takes back web development from languages like Ruby and Python and makes building fast, scalable, web applications a joy in Go!\r\n\r\nThis talk gives a high level overview of the following sections of Buffalo:\r\n\r\n* Routing\r\n* Middleware\r\n* Templating/Rendering\r\n* Testing\r\n* Asset Pipeline\r\n* Database Access\r\n* Deploying\r\n\r\nBy the end of this workshops attendees will understand the power of Buffalo to build a full CRUD based web applications. \r\n\r\nFrom `buffalo new \u003cmyapp\u003e` to `buffalo build` this talk will empower attendees to bring web development to Go!","notes":"","audience_level":"All","tag_list":["buffalo","web","rails","http","golang","go"],"rating":75.0,"state":"submitted","confirmed":false,"created_at":"2017-02-06T19:44:02.282Z"},{"name":"Mark Bates","email":"mark@markbates.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1/markbates_headshot.jpg","location":"Boston, MA","bio":"Mark Bates is a full stack web developer with over 17 years of experience building high quality scalable applications for companies such as Apple, USA Today, Klarna, and Palm. He has written three books, “Distributed Programming with Ruby”, “Programming in CoffeeScript”, and “Conquering the Command Line”. Mark has spoken at conferences around the world, has led user groups such as Boston Ruby and Boston Golang, and has helped to organize conferences such as GothamGo and GopherCon.\r\n\r\nMark is also the co-founder of [PaperCall.io](http://www.papercall.io/speakers/markbates), a platform for connecting technical events with high quality content and speakers.","twitter":"markbates","url":"http://www.markbates.com","organization":"@markbates","shirt_size":"Men's XL","title":"Understanding FUD","abstract":"FUD is everywhere. You can't escape it. It's in our advertising, our politics, and most frightening of all, our code! ","description":"FUD is everywhere. You can't escape it. It's in our advertising, our politics, and most frightening of all, our code! \r\n\r\nIn this talk we are going to learn how to understand FUD. We'll delve deep into the psychology behind FUD. We'll learn how to recognize it. We'll learn how to stop FUD right in its tracks.\r\n\r\nFUD can kill a community, a framework, a library. It can prevent good people from speaking up. It can hurt people. Let's all learn how to put an end to this beast in improve all of our lives in the process.","notes":"","audience_level":"All","tag_list":["distractions","community_leadership","fud"],"rating":50.25,"state":"submitted","confirmed":false,"created_at":"2017-02-06T19:43:46.422Z"},{"name":"Mark Bates","email":"mark@markbates.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1/markbates_headshot.jpg","location":"Boston, MA","bio":"Mark Bates is a full stack web developer with over 17 years of experience building high quality scalable applications for companies such as Apple, USA Today, Klarna, and Palm. He has written three books, “Distributed Programming with Ruby”, “Programming in CoffeeScript”, and “Conquering the Command Line”. Mark has spoken at conferences around the world, has led user groups such as Boston Ruby and Boston Golang, and has helped to organize conferences such as GothamGo and GopherCon.\r\n\r\nMark is also the co-founder of [PaperCall.io](http://www.papercall.io/speakers/markbates), a platform for connecting technical events with high quality content and speakers.","twitter":"markbates","url":"http://www.markbates.com","organization":"@markbates","shirt_size":"Men's XL","title":"Butterfly in Reverse: From SOA to Monolith","abstract":"SOA, SPA, JSON APIs, all the big buzz words. I spend my days building these for my clients. When I started working on my startup we were going to build it \"the right way\". So why is it a single monolith with full page refreshes and almost no JavaScript? Excellent question!","description":"Service Oriented Architecture, Single Page Web Apps, JSON APIs, all of the big buzz words. I love all of them. I spend my days building these types of systems for my clients. That's why when I started working on my side project startup with a friend we chose Go, Angular, and SOA. We were going to build this application \"the right way\".\r\n\r\nSo why, if you go to the site now, is it a single Rails monolith with full page refreshes and almost no JavaScript? That's an excellent question, and the subject of this talk.\r\n\r\nDuring this talk we'll look at how I started building my application \"correctly\" and ended up with the classic monolith architecture you hear people warning against. We'll talk about why Go, SOA, and Angular were all the wrong choices for this app, and why the monolith was the right answer.\r\n\r\nAlong the way you might learn something or two about making the correct architectual choices for your organization, at the very least you'll hear some funny stories about my pain and a few choice animated GIFs as well.","notes":"This talk will cover trade-offs of different architectures of the modern web application. Choosing the right language, the right framework, the right split of concerns, etc... can be difficult. Balance all of that against time to market, resources, and effort can make for difficult decisions.\r\n\r\nBy sharing my story, with the stumbles, pivots, and bad decisions that went along with it, I hope to help people avoid these mistakes and get their applications to market faster and correctly.\r\n\r\nThis talk is not about hating on any of these technologies, in fact I will praise them, but only in certain contexts.","audience_level":"All","tag_list":[],"rating":62.5,"state":"submitted","confirmed":false,"created_at":"2017-02-06T19:43:05.337Z"}]