[
  {
    "name": "Kim Crayton",
    "email": "kmcrayton7@yahoo.com",
    "avatar": "https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500",
    "location": "United States",
    "bio": "​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode",
    "twitter": "KimCrayton1",
    "url": "http://www.KimCrayton.com/",
    "organization": "Kim Crayton LLC",
    "shirt_size": "Women's L",
    "title": "How I Went From Newbie to Open Source Project Owner",
    "abstract": "This is the story of how focusing first on building a community of individuals who care about mentoring has allowed me to turn the idea of mentor matching for people learning to code into a multi-platform open source project.",
    "description": "As someone new to the development community, finding your way around can be a daunting task. There are no defined paths, there's an overwhelming amount of information to ingest, and focus is an almost impossible task. Becoming an active member of open source projects is a great way for newbies to practice their coding skills, develop meaningful community relationships, and become a part of and add value to something bigger than themselves. You only have to look around you to see that individuals thrive when they feel that they have strong relationships and belong to a community.\r\n\r\n1. Understanding the value of the Open Source Community as a newbie\r\n2. Strategies for building community offline and online\r\n3. Brining the community together to work on something that matters to them\r\n",
    "notes": "",
    "audience_level": "All",
    "tag_list": [
      "open source",
      "community",
      "github",
      "newbie",
      "open source project"
    ],
    "rating": 100
  },
  {
    "name": "Sergey Bolshchikov",
    "email": "sergey@bolshchikov.net",
    "avatar": "https://secure.gravatar.com/avatar/f0fbd607aab5c6ec39213d2a24fbf339?s=500",
    "location": "Israel",
    "bio": "Team Lead at Wix with great passion to technology and knowledge sharing with 9 years of experience. Co-organizer of YouGottaLoveFrontend Conference and Ember-IL meetup group in Tel Aviv, Israel. \r\nM.Sc. in Information Systems from Technion - Israel Institute of Technology.\r\nhttp://bolshchikov.net ",
    "twitter": "bolshchikov",
    "url": "http://bolshchikov.net",
    "organization": "Wix",
    "shirt_size": "Men's M",
    "title": "How to make a dev advocate from every engineer inside the company",
    "abstract": "Developer relations of a company is not the job of 1 person or a team. It's a responsibility of every engineer in a company. \nIn this talk we will discuss how to promote the dev rel culture though out all developers. How to manage open source projects, encourage and facilitate meetups and more. ",
    "description": "## Issue\r\nDeveloper relations for a IT company is not an easy way. It's a hard problem that solved in many different way, different heuristic approach.\r\nAt Wix, the company with over 500 engineers, we believe it's work not of 1 person or a team. It is a responsibility of everyone.\r\nWe all want to feed proud by the engineering part of a company where we work.\r\nBut how to achieve this? There's no silver bullet though.\r\n\r\n## Solution\r\nIn this talk we will discuss different approaches that worked and not so much at tackling problems:\r\n* open source projects\r\n* speaking at meetups\r\n* organizing workshops\r\n* organizing conferences, and more\r\n\r\nWe will try to answer \"simple\" question: how to convert every engineer to a dev rel of your company.",
    "notes": "",
    "audience_level": "All",
    "tag_list": [
      "developer",
      "meetups",
      "conference",
      "relations",
      "opensource",
      "marketing",
      "devrel"
    ],
    "rating": 100
  },
  {
    "name": "Alicia V Carr",
    "email": "fineblkwoman@me.com",
    "avatar": "https://secure.gravatar.com/avatar/8a68115929998ab691a97e356a9e4d74?s=500",
    "location": "Atlanta Georgia",
    "bio": "About Alicia Carr \r\nIn 2012, while standing online at the Apple store waiting to buy my second generation iPad I met a 16-year-old young man. I asked him how did he get the money to buy an iPad and he told me he made a lot of money creating apps. Then I asked him how did he learn how to create an app. He said from youtube and That’s when I turn to my husband and told him “I want to do that.”\r\nI started learning how to code in May 2012. On November 2, 2012 (will never forget the day) my husband told me to quit my job to follow my dream to become a iOS developer.\r\nIt took me 1½ years to learn Objective C. After books and online courses I went through, I started working on the Purple Pocketbook in January 2014 and finished the first version in March 2014. After a month of submitting the app to Apple, it finally got approved on May 2, 2014.\r\nPurple Pocketbook is now Purple Evolution, Inc, (PEVO) the first domestic violence app for the state of Georgia which is now a national app.\r\nEarly 2014 I found and join the group called Women Who Code and I was so excited to be with other ladies wanting to connect and learn from each other that where coders as well. I then started the group within WWCODE called women iOS (WiOS) Developer Group.\r\nI became such an active member of the group over two years working with WWCODE that Erica Stanley Founder/Director of WWCode Atlanta and Alaina Percival CEO/Founder WWCode felt I was an excellent fit for the Director of the Atlanta chapter.\r\nAnd I love Women Who Code it like family.\r\nLiving my dream\r\nI am 53 years old, been married for 35 years, have 3 children and 8 grandchildren. I love life, and I am experiencing my dreams as often and as soon as I can achieve them. My passion in life has been to be an entrepreneur and help others to see life differently with strength and passion.\r\n\r\nWWDC2015 Morning Keynote\r\nhttp://www.apple.com/live/2015-june-event/322cd98d-5368-4c7b-891b-d7dff96b6714/\r\n\r\nI also premiered in Apple newBeginning Video\r\nhttps://www.youtube.com/watch?v=nJt871shTho\r\n\r\n",
    "twitter": "fineblkwoman",
    "url": "http://www.pevo.us",
    "organization": "Women Who Code/ Purple Evolution, Inc. (PEVO)",
    "shirt_size": "Women's 3XL",
    "title": "Is it too late to learn how to program and how being a developer change my life",
    "abstract": "How I became a developer in my 50th. the challenges, the assumption and the victories and how women are not being recognized as an important part of the tech community.",
    "description": " I will talk about how and why I wanted to be an iOS mobile developer at the age of 51. How a 16 year inspire me to learn to code and the challenges I face after becoming an iOS developer being the first self-taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse and how Apple found me and was highlight at WWDC 2015 and 2016 keynote event.  Some people want to believe that people my age are out of touch with technology and as a woman, I have seen the best and the worst in the tech community but I know now that there is a solution at the end of the rainbow.\r\n\r\nI will talk about how early adopters no longer look like the stereotypical hoodie-wearing gadget nerd obsessing over the specs of the latest iPhone—in part because they’re no longer men. Today young women are beating men to technology trends.\r\n\r\nI also will talk about what people don't know is 70% of women are more active on our mobile device than men, women are more active with social media, shopping, photo apps, are more connected to entertainers and play more games on their smartphones. \r\n\r\nWith that being said we the tech community need to open up our arm and embrace the change and think about how women in tech can change the way we see and create apps. \r\n",
    "notes": "Alicia V. Carr is the first self-taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse. She knew she had to utilize her acquired skills as a developer to make a difference.\r\n\r\nAlicia decided to combine her new learned skills and long-time passion for domestic violence prevention to create Purple Evolution, Inc (PEVO) App. \r\n\r\nEarly 2014 I join the group called Women Who Code and is now one of three Director of the Atlanta chapter.\r\n\r\nAlso, Apple has acknowledged me at the WWDC15 and 16 events.\r\nWWDC2015 Morning Keynote - http://www.apple.com/live/2015-june-event/322cd98d-5368-4c7b-891b-d7dff96b6714/\r\nApple newBeginning Video - https://www.youtube.com/watch?v=nJt871shTho\r\n",
    "audience_level": "All",
    "tag_list": [
      "android",
      "ios",
      "women",
      "women in tech",
      "swift",
      "java",
      "javascript",
      "dirversity"
    ],
    "rating": 100
  },
  {
    "name": "Kim Crayton",
    "email": "kmcrayton7@yahoo.com",
    "avatar": "https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500",
    "location": "United States",
    "bio": "​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode",
    "twitter": "KimCrayton1",
    "url": "http://www.KimCrayton.com/",
    "organization": "Kim Crayton LLC",
    "shirt_size": "Women's L",
    "title": "Coding Education For All",
    "abstract": "An approach to teaching coding that does not create a false sense of competence.",
    "description": "Long gone are the days when technology was just for the \"nerds\". Today, technology touches every industry and many parts of our personal lives and this trend will only continue to grow. Moving forward, those with the ability to understand the language of technology will be better positioned to take advantage of what lies ahead yet very few non-techies understand or even recognize the shifts that are taking place. As technology continues to move forward, the non-technical continue to fall further behind. In an effort to address this issue, I propose an introduction to technology process that will make becoming technically literate an option for the masses.\r\n\r\nDetails:\r\n1. The importance of being code literate \r\n2. The challenges with current coding education platforms \r\n3. Let’s start with the basics\r\n",
    "notes": "",
    "audience_level": "All",
    "tag_list": [
      "learning to code",
      "newbies",
      "developers",
      "programming",
      "bootcamps"
    ],
    "rating": 100
  },
  {
    "name": "Mark Bates",
    "email": "mark@markbates.com",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1/markbates_headshot.jpg",
    "location": "Boston, MA",
    "bio": "Mark Bates is a full stack web developer with over 17 years of experience building high quality scalable applications for companies such as Apple, USA Today, Klarna, and Palm. He has written three books, “Distributed Programming with Ruby”, “Programming in CoffeeScript”, and “Conquering the Command Line”. Mark has spoken at conferences around the world, has led user groups such as Boston Ruby and Boston Golang, and has helped to organize conferences such as GothamGo and GopherCon.\r\n\r\nMark is also the co-founder of [PaperCall.io](http://www.papercall.io/speakers/markbates), a platform for connecting technical events with high quality content and speakers.",
    "twitter": "markbates",
    "url": "http://www.markbates.com",
    "organization": "@markbates",
    "shirt_size": "Men's XL",
    "title": "A History of Programming and Other Such Ridiculous Things",
    "abstract": "This is a fun, entertaining, and enlighting talk. It is designed to inform developers of where they came from so they can better understand where we're going.",
    "description": "Alan Turing, Ada Lovelace, Mark Zuckerberg, Steve Wozniak. These are all people who’ve never been in my kitchen. I’ve never had even a passing head nod with whilst coming out of the bathroom. What size shoes do they wear? What’s their favorite color? Do they know all the lyrics to Katy Perry’s Roar? I don’t know. But perhaps by taking a look at our collective past we can find these answers, and maybe learn a little bit about our future. Or at the very least we’ll get to see pictures of really big computers from the olden days!",
    "notes": "This is a fun, entertaining, and enlighting talk. It is designed to inform developers of where they came from so they can better understand where we're going.\r\n\r\nHere is a video of me giving the talk in 2014 at [Bacon](http://devslovebacon.com/conferences/bacon-2014/talks/a-history-of-programming-and-other-such-ridiculous-things). Spoiler alert, you'll learn who I am if you watch the video. :)",
    "audience_level": "All",
    "tag_list": [],
    "rating": 100
  },
  {
    "name": "Leonel Salazar Videaux",
    "email": "leonel.lordford@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/c542344b773c50b74c2d9f87f417e234?s=500",
    "location": "Unknown",
    "bio": "Ing. en Ciencias Informáticas;\r\nusuario de GNU/Linux desde 2003;\r\nfundador del GUTL;\r\nparticipante en FLISOL desde 2009;\r\nProgramador;\r\nentusiasta del SWL",
    "twitter": "",
    "url": "http://debianhlg.cubava.cu",
    "organization": "Universidad de Holguín",
    "shirt_size": "Men's M",
    "title": "Experiencias de la comunidad de usuarios de Debian GNU/Linux en la Cuba Profunda",
    "abstract": "Participar en un taller sobre comunidades de Debian GNU/Linux para intercambiar experiencias sobre actividades, uso de recursos, divulgación, buenas prácticas, etc... principalmente desde el enfoque de las ciudades alejadas de los centros de avanzada en materia de tecnología.",
    "description": "Participar en un taller sobre comunidades de Debian GNU/Linux para intercambiar experiencias sobre actividades, uso de recursos, divulgación, buenas prácticas, etc... principalmente desde el enfoque de las ciudades alejadas de los centros de avanzada en materia de tecnología. Pensamos mostrar resultados de trabajos comunitarios realizados en le Oriente de Cuba, en particular Holguín y Manzanillo (provincia Granma), pero con el ánimo de sumar a todos los interesados en cualquiera de las acciones que se puedan realizar.",
    "notes": "",
    "audience_level": "Beginner",
    "tag_list": [
      "taller",
      "debian",
      "comunidad"
    ],
    "rating": 100
  },
  {
    "name": "Karina Serfaty",
    "email": "keserfaty@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/3378b062dd744115ccca258215ebcec6?s=500",
    "location": "Unknown",
    "bio": "Mi nombre es Karina Serfaty soy programadora con un altísimo amor por generar proyectos gratuitos, pequeños y de código abierto. Soy además Licenciada en Ciencias de la Educación y estudiante de Ingeniería Eletrónica. Trabajo hace 5 años contribuyendo a la comunidad docente y, actualmente, coorganizando eventos como Meetup.js en Buenos Aires en donde tenemos por objetivo este año difundir la programación entre grupos más diversos de la sociedad.\r\nAdemás de todo esto todo el piano, me gusta muchísimo la matemática y leer libros de historia.",
    "twitter": "keyserfaty",
    "url": "",
    "organization": "Wingu Ambassador & Senior Javascript Engineer en Shiftgig",
    "shirt_size": "Women's S",
    "title": "¿Cómo conectar alumnos, maestros y escuelas con software libre?",
    "abstract": "Contaré acerca de mi experiencia capacitando a 600 docentes en el uso de tecnologías que los ayudaron a mejorar su forma de dar clase, su conexión con las familias de los estudiantes y con la comunidad escolar. Presentaré además una herramienta de código abierto que colabora con este propósito.",
    "description": "¿Cómo sería un sistema educativo en que los maestros pudieran saber de cada paso que sus alumnos están haciendo en su aprendizaje? ¿O uno en el que los padres y maestros pudieran estar en contacto todo el tiempo?; ¿o en el que directivos pudieran saber exactamente la situación en sus aulas? \r\nEn esta charla me propongo contarles acerca de nuestra experiencia en Wingu capacitando a 600 docentes de un municipio en el uso de tecnologías gratuitas para escuelas. Estas capacitaciones no fueron solo acerca de cómo usar una herramienta particular, fueron fundamentalmente sobre cómo usar las herramientas que los docentes ya tenían de formas creativas para comunicarse mejor entre ellos y con la comunidad.\r\nAlgunos de los proyectos de los docentes que surgieron después de estas capacitaciones fueron una carpeta compartida entre docentes con planificaciones de clase, documentos compartidos entre padres y maestros para acordar sobre fechas de reuniones, correcciones en tiempo real de los trabajos de los estudiantes y muchísimas más cosas.\r\nAdemás de esta experiencia, aprovecharé para presentar una herramienta gratuita y de código abierto para que los maestros tengan mejor feedback a lo largo de sus clases.",
    "notes": "Los únicos requerimientos técnicos son un cable HDMI y un proyector para mostrar la presentación. Si hubiera conexión a internet (aunque sea de muy baja velocidad) podría invitar a toda la gente de la audiencia a utilizar en tiempo real conmigo la herramienta que me gustaría presentar (esta herramienta está pensada especialmente para conexiones de internet de baja velocidad porque tienen que funcionar en escuelas con los dispositivos móviles que tengan los estudiantes).",
    "audience_level": "All",
    "tag_list": [
      "tecnología",
      "educación"
    ],
    "rating": 100
  },
  {
    "name": "Diego Accorinti",
    "email": "diegoacco@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/bf55ec8b1282a6b54eb55a7c30aa202f?s=500",
    "location": "Unknown",
    "bio": "Soy Diego Accorinti y vivo en Ciudad de Buenos Aires, Argentina. Soy diseñador multimedial y programador. Tengo 35 años.\r\nActualmente trabajo en el Equipo de desarrollo de Huayra gnu/linux, el sistema operativo libre educativo del Programa Conectar Igualdad. Viajo mucho recorriendo provincias y difundiendo software libre y su filosofía.\r\nDesde 2015 soy Coordinador Nacional del capítulo Argentina de FLISOL -festival latinoamericano de instalación de software libre-  con más de cuarenta sedes, se trata de un evento de la comunidad para la comunidad, federal, independiente, plural e inclusivo.",
    "twitter": "diegoacco",
    "url": "http://www.enmanosdenadie.com.ar/diego/",
    "organization": "FLISOL Argentina · Educ.AR (Ministerio de Educación de la Nación Argentina)",
    "shirt_size": "Men's 2XL",
    "title": "Huayra GNU/Linux,  experiencias con software libre en el Programa Conectar Igualdad de Argentina",
    "abstract": "Mi charla es sobre el proceso de desarrollo y la implementación de una distribución de gnu/linux educativa -Huayra GNU/Linux- en el sistema educativo argentino, a través de una política de inclusión digital y social llamada Programa Conectar Igualdad. Aciertos, errores y futuro.",
    "description": "Huayra gnu/linux pudo haber sido la revolución educativa argentina,  en mi charla propongo recorrer los inicios del proyecto que acompaño a otro no menos ambicioso, el Programa Conectar Igualdad entregó 5 millones de computadoras a todos los estudiantes de nivel medio de escuelas públicas en Argentina.  La mayoría de esos equipos salieron con doble-boot  donde Huayra era la opción de software libre, completamente diseñado por un equipo local y adaptado a las necesidades socio-económicas y geográficas de los docentes y estudiantes argentinos.  Planteo analizar aciertos y errores del proyecto,  su alcance y proyección futura.  ",
    "notes": "Diego Accorinti es Coordinador Nacional de FLISOL en Argentina [ www.flisol.org.ar ]",
    "audience_level": "All",
    "tag_list": [
      "tic's",
      "pedagogía",
      "inclusión digital",
      "educación",
      "programa conectar igualdad",
      "huayra gnu/linux"
    ],
    "rating": 100
  },
  {
    "name": "Selene Yang - Celine Jacquin",
    "email": "seleneyang1@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/f5c68815369c7e114111a907eede5eb0?s=500",
    "location": "Unknown",
    "bio": "",
    "twitter": "srta_peperina / mapeadora",
    "url": "https://geochicas.github.io/",
    "organization": "GeoChicas OpenStreetMap",
    "shirt_size": "Women's M",
    "title": "Taller de mapeo con enfoque de género",
    "abstract": "Realizaremos un taller de mapeo con enfoque de género que se dividirá en 3 momentos\n1er: Lluvia de ideas y mapeo conceptual con participantes\n2do: Capacitación con herramientas y presentación de metodología de mapeo.\n3er: Salidas al barrio para mapeo y análisis de datos.",
    "description": "Parte del colectivo de mujeres #GeoChicas, grupo de mujeres latinoamericanas colaboradoras del proyecto de OpenStreetMap, seremos las responsables facilitadoras del taller de mapeo de recursos urbanos. El objetivo es poder explorar y reconocer la diferencia de género, a través del cómo los individuos utilizan, perciben y se proyectan en el espacio que les rodea. El taller está enfocado especialmente en la construcción de cartografías con un enfoque social dirigido hacia las necesidades de las niñas y mujeres en la comunidad, entendiendo los mapas como un reflejo político, social y cultural de quienes lo producen.",
    "notes": "Realización del taller:\r\n-Mini presentaciones sobre la cartografía participativa como motor de planeación urbana y desarrollo equitativo. \r\nDiscusión grupal a modo de Grupo Focal y “mapeo mental” para pre/identificar los elementos del barrio más importantes según esta comunidad de mujeres.\r\n-Presentación de la metodología, y del mapeo con Field Papers, organización de los grupos y la dinámica.\r\n-Mapeo por grupos alrededor de la Escuelita, por sectores geográficos utilizando Field Papers. Los asistentes que cuentan con teléfono móvil y acceso a Internet utilizarán una app móvil de mapeo (OSM-Tracker). Se identificarán los puntos de interés útiles que aporten a un desarrollo integral de la comunidad, así como los “no-lugares” y zonas de inseguridad que afectan especialmente a las mujeres.\r\n\r\nEl taller estará a cargo de Celine Jacquin (@mapeadora) de OSM México, RepuBikla, Selene Yang (@seleneyang) de Nicaragua, Noemi Ticona Angles (@nah_omy) de Bolivia.",
    "audience_level": "All",
    "tag_list": [
      "openstreetmap",
      "genero"
    ],
    "rating": 100
  }
]
