[{"name":"Chelsea Bullock","email":"chelsea.bullock@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/8391/VSCO_Cam-1.jpg","location":"Atlanta, GA","bio":"Chelsea Bullock is a UX Researcher for IBM at The Weather Company, specializing in research that directs strategy and shapes product design. In a past professional life she taught university students how to critically think about the politics of reality television. She most loves projects that enable her to combine cultural critical inquiry with technological innovation. She organizes events around Atlanta with Women Who Code: Atlanta. Her personal website is chelseabullock.com. Chelsea holds a BA in English from Columbus State University and a PhD from University of Oregon in English and Media Studies.","twitter":"chelsea_bullock","url":"http://www.chelseabullock.com","organization":"IBM at The Weather Company","shirt_size":"Women's L","title":"How to Make Your AI a Better Person","abstract":"As AI technologies evolve, we must be mindful of progressing the politics composing them. How do we render these politics transparent and develop rigorous processes for interrogating them? This talk will consider how to influence the politics of building AI and cognitive technologies.","description":"I want to present some thoughtful strategies for evaluating bias built into cognitive technologies. I will equip people with tools that might look like a checklist/rubric of questions developed to interrogate bias from an intersectional feminist perspective concerned with social justice across identities varied in race, gender, class, and sexuality. As a UX Researcher, I am not an AI developer, but I partner with teams building those technologies and maximize opportunities for interventions like these. I want to encourage others to do the same, even in varied technological capacities and proximities to AI/cognitive technology development.","notes":"I will need projection with (possibly) video + audio.","audience_level":"All","tag_list":["ai","cognitive","politics","feminism","emerging technologies","feminisms","ethics","bias","research"],"rating":87.5},{"name":"Bhavani Shankar","email":"right2bhavi@gmail.com","avatar":"https://secure.gravatar.com/avatar/78ec69a957b136c0d733f40ebdd1d1c9?s=500","location":"Unknown","bio":"Bhavani Shankar is a cerebral palsy affected guy who has around 7 years of experience in the IT industry, presently working as a senior consultant in Accion Labs Pvt limited in an automation specialist role.\r\n\r\nApart from his work at Accion Labs he is an active ubuntu community contributor from the past 8 years in various roles from being an active contributing member to a developer to being on the governance councils in the ubuntu community.\r\n\r\nMore info about his ubuntu work\r\n\r\nLaunchpad Profile: https://launchpad.net/~bhavi\r\nWiki page: https://wiki.ubuntu.com/BhavaniShankar\r\n\r\nA recipient of various international awards too for his work in the opensource and disability sector. Some of them below\r\n\r\nA silver medal and an achievement award from UNESCAP, United Nations, Bangkok, in October 2013, for his outstanding performance in Global IT challenge for youth with disabilities event\r\n\r\nAwarded Helen Keller Award as a role model for persons with disabilities for his work in IT and open source in December 2013.\r\n\r\nhttp://dnis.org/NCPEDP-Shell-Helen-Keller-Award-Brochure-2013.pdf\r\n(Page no 10 has citation of his work)\r\n\r\nAwarded Aryabhata International award 2013 in the state of Karnataka for his contributions to IT field.\r\n(http://www.ibcnews.in/2014/06/18/aryabhata-awards-for-the-year-2013-announced-to-be-presented-on-22nd-june-at-ravindra-kalakshetra/)\r\n\r\nNominated for National Award as a role model with disabilities by Govt of India 2013, 2014, 2016 ","twitter":"","url":"https://launchpad.net/~bhavi","organization":"Accion Labs, Ubuntu community","shirt_size":"Men's XL","title":"Python + Rest API's +UI = A tester's treat in openstacky way :)","abstract":"A common notion is that python is majorly a scripting language widely used for some automation tasks or a developer oriented tightly coupled language.\n\nThis talk would give an overview and a treatise on Automation testing with selenium and would give a 30k feet view of automation simplified.  ","description":"This talk would mainly focus on using python as a language and a framework for automation testing where I would intend to cover the below with Opencafe and selenium with python.\r\n\r\n- ReST API/SoAP API automation framework development using opencafe\r\n- Rigging up tests for API testing using roast part of opencafe\r\n- Performance testing of API\r\n- Regression testing\r\n- Integration of opencafe stuff with a CI like Jenkins\r\n\r\nApart from this I would like also to give an overview of integration of vanilla selenium with python for UI and browser testing.\r\n\r\n\r\n","notes":"This talk would require a basic linux or mac system preferably running python 2.7 (recommended)","audience_level":"Beginner","tag_list":[],"rating":87.5},{"name":"Dario Badagnani","email":"dario.badagnani@gmail.com","avatar":"https://secure.gravatar.com/avatar/097e8912bf64837fc6fc3b81d329fb14?s=500","location":"Unknown","bio":"Born in Mar del Plata, Arg. Graphic designer, and for the last 12 years an activist promoting open source software.\r\n ","twitter":"DaFeBa_foto","url":"http://vamox.blogspot.com","organization":"VMO design","shirt_size":"Men's XL","title":"Vamox Project, 10 years on the Libre side ","abstract":"Vamox started while in the University, we want to learn without been called \"pirates\". As graphic designers we wanted to help in the Software Libre community, and making a statement of what should be the content in Public Universities. A Graduation Thesis and much more stuff made for an open ideal.","description":"in 2007 We started a migration to open source software for graphic design, and starting to think what our graduation thesis should be. In one hand many people told us horror stories of great ideas being stolen, in the other we wanted to help our University and community. Why not both?\r\n\r\nFrom them we did a lot of research, of the problems in our education, what was \"free as in freedom\" and a research about the history of the GUI.\r\nWe had a crazy idea: making a complete redesign of a Operating System, showing what you can do with open tools, on a open OS, and sharing the result. In 2008 we needed to convince our professors of this crazy idea, and then making it.\r\n\r\nIn december 2008 we completed our graduation thesis, and hours later was online, with many unexpected results: hosting bandwidth exhausted, many sites thought it was a new distro, lots of downloads in gnome-look.\r\n\r\nSince then we keep using open source tools, making activities to promote them, fighting those who gain from ignorance and fear.","notes":"","audience_level":"All","tag_list":["interface","design","gui","icons","graphic design"],"rating":87.5},{"name":"Sumanth Damarla","email":"damarla.sumanth@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/2495/sims.jpg","location":"India","bio":"Security Evangelist, Mozilla Tech Speaker from Mozilla, India. Conducted series of events related to Web security.Part of Mozilla team which represented FOSSASIA 2015. Done a project for Mozilla Security team under MWoS 2014. Worked with former security developer at US NSA under OWASP Summer code sprint 2015. Invited as sponsored facilitator for Mozfest 2015 (London), Mozilla Leadership Summit 2016 (Singapore) and Mozfest 2016 (London). Invited as speaker for FOSSASIA 2015, I.T.A.K.E Unconference'16(Romania), OSCAL'16(Albania), Riviera Dev 2016 (France), FOSDEM 2017 (Belgium), United Dev Conf 2017 (Minsk, Belarus) and cf.Objective() 2017 (Washington DC, USA). Recent talk was given at Voxxed Days 2017 (Bristol,UK) on Web Security.  Trained by \"Denise Graveline\" (The Eloquent Woman) as part of tech speaker training at Mozilla.","twitter":"Sumanth_Damarla","url":"https://sumanthmoz.wordpress.com","organization":"Mozilla (volunteer role)","shirt_size":"Men's L","title":"Securing the Web","abstract":"With the right skills, tools and software, you can protect yourself and remain secure. This session will take attendees from no knowledge of open source web security tools to a deep understanding of how to use them and their growing set of capabilities.","description":"This session focuses on building Web Security Awareness. Its helps the attendees to build their web applications more securely using Web Security Tools. With the help of websecurity tools, People can attack their own designed Web applications and check for the vulnerabilities in their applications and code it more securely.  \r\n\r\nFor an instance, Assume a coder created Login page, He can use ZAP (Mozilla Security Automation Project) to attack his Login page and sort out the ways to trace out the flaws. In this way ZAP gives the coder chance to build their Web Application more securely. (Though its only one of the many features of ZAP).\r\n\r\n### Session Plan: [Talk duration: 45min]\r\n\r\n-\u003e Importance of Web Secuirty - 5min\r\n\r\n-\u003e Discussing OWASP Top 10 vulneribities [Each vulnerabity will take 1min for discussion] - 10min\r\n\r\n-\u003e Discussing on available open source security tools such as OWASP ZAP, Vega Scanner, Open VAS, Nikto and Uniscan. [5 tools X 3min] - 15min\r\n\r\n-\u003e Live Demo [Scanning vulnerable web application to detect vulnerabilities and various other features of the ZAP] - 10min\r\n\r\n-\u003e QA - 5min\r\n\r\n### Outcome:\r\n\r\nThis session would be able to show path for the attendees how he/she can contribute to Mozilla in Security Aspects. The participant can be able to learn following areas:\r\n\r\n→ Participant will grasp detailed knowledge on how a web application functions on browser and how he/she detect vulnerabilities. (By learning from OWASP Top ten vulnerabilities )\r\n\r\n→ Solving vulnerabilities.\r\n\r\n→ Contributing to open source security tools.\r\n\r\n→ Working on bugs related to vulnerabilities issues.\r\n\r\n→ Start contributing to ZAP or other open source security projects in both tech/non-tech aspects.","notes":"This talk focuses on bringing awareness on importance of web security for Web Developers. The talks deals with the major threats posed for web applications and the ways to overcome them. I am going to introduce an open source web application tool which ranked first as Top Web Security tool be \"toolswatch.org\". It is ZAP(Zed Attack Proxy). I am ZAP Evangelist for India. The session would also focus on other available open source web security tools to make session technology agonistic. I had worked on a project for ZAP under Mozilla Winter of Security 2014 with Mozilla Cloud Security team. I have experience of taking sessions related to web security. My recent talk was given at “Voxxed Days 2017” happened in Watershed at Bristol, United Kingdom. I am part of Mozilla Tech Speakers team. I am comfortable to speak about different security aspects. I have experience of working with former Security Developer from US NSA(National Security Agency) as Summer Intern at OWASP. Trained by \"Denise Graveline\" (The Eloquent Woman) as part of tech speaker training at Mozilla. These all experiences will make me right person to handle this session with at-most organized way.\r\n","audience_level":"Intermediate","tag_list":["pentester","security","html","java","opensource"],"rating":100.0},{"name":"Patrick Kettner","email":"patrickkettner@gmail.com","avatar":"https://secure.gravatar.com/avatar/3fada965c1f65adc0599bb9cd606524d?s=500","location":"seattle","bio":"Patrick Kettner won an 8th grade talent show singing Gloria Gaynor's 1978 disco hit \"I Will Survive\", and things have been looking up ever since. He has traded in the golden microphone for a PM position on Microsoft Edge, as well as being the lead developer for Modernizr. He lives in Seattle with his wonderful partner Katrina, son Holden, and dog Baxter.","twitter":"patrickkettner","url":"https://github.com/patrickkettner","organization":"Microsoft","shirt_size":"Men's L","title":"Modern Websites for the Modern Web","abstract":"You shouldn't wait to use the latest browser APIs. Through progressive enhancement and some clever JS, I will discuss creating feature rich and super fast front end applications, integrating over a dozen cutting edge web features, all while supporting even the oldest of web clients.","description":"It seems like new APIs for the web are released every week. It would be cool to be able to use them, but if you need to make websites for the average user, you won't be able to use them for years - right? Wrong. I will go over how creating feature rich and super fast front end applications, integrating over a dozen cutting edge web features, all while supporting even the oldest of web clients. If you want to see a 100% client side offline enabled application work in every browser to Mosiac, and even be ported to a command line GUI (yes GUI), come check it out!","notes":"As both an employee of a browser, and the lead developer for Modernizr, I am very well equipped to discuss cutting edge APIs and what is plausible on the web. But even more so, I am skilled creating a progressively enhanced version of the latest and greatest so that the web \"just works\", for everyone. It would be an absolute honor to share my experiences with you, and to learn even more from the attendees and other speakers.","audience_level":"All","tag_list":[],"rating":100.0},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim, a Community Engineer, has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to develop technical people, ideas, organizations, and communities. Her current efforts focus on creating environments that support the sharing of common attitudes, interests, and goals. \r\n\r\nShe is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, KimCrayton1 on Medium.com, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects The ABC’s of Coding, Tech Talk For Non-Techies, #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"What The Doc?!?! How to Write and Read Documentation That Allows You To Get Shit Done!","abstract":"Documentation tells the story of your code, application or community and like any great story, effective communication is key. ","description":"Details:\r\nOften documentation is treated as an afterthought and an undesirable part of the creative process but it doesn’t have to be. Documentation can be seen as your effective and efficient method for you to tell your story in a comprehensive and engaging way. What the Doc?!?! will help both the writer and reader \r\n\r\nLearning Outcomes:\r\n- The development of a checklist of issues to consider when writing technical documentation\r\n- Ideas for making the creation and maintenance of documentation an integral part of development process \r\n- Tips for helping newbies with reading technical documentation\r\n- Tips for building and engaging your community around your documentation ","notes":"Presentations on YouTube \r\nhttps://www.youtube.com/playlist?list=PLEJ1RnaQ_swh7wiD80NSSLu8UrOv3DiQ6\r\n\r\nJazzCon.tech (start viewing at 1:04:15) https://www.youtube.com/watch?v=RgDFKYURKPA\r\n\r\nCodeNewbie Podcast: http://bit.ly/2oY9y36","audience_level":"All","tag_list":["documentation","community","newbies","writing documentation","reading documentation","commenting code","open source","read me"],"rating":100.0},{"name":"Jacobo Nájera","email":"jacobo@metahumano.org","avatar":"https://secure.gravatar.com/avatar/8758aa97b32abb81451612dc40a45b64?s=500","location":"Unknown","bio":"Me intereso en investigar las relaciones entre ciencia, artesanía y derechos humanos, así como desarrollo redes para infraestructuras y sitios web de medios independientes. He contribuido con investigación y diseño de tecnología para la Free Software Foundation y Wikimedia. Actualmente realizo investigación en Enjambre Digital, opero nodos de la red Tor e integro el comité de dirección de MayFirst People-Link.","twitter":"","url":"","organization":"","shirt_size":"Men's M","title":"Una perspectiva comunitaria para enfrentar los ataques informáticos","abstract":"Presentación sobre alternativas de aprendizaje y desarrollo para hacer frente a las amenazas que representan los ataques informáticos y sus modelos de negocio.","description":"Los ataques informáticos como negocio lucrativo cada vez se discuten más públicamente por sus escalas, complejidad, organización e impacto en las infraestructuras de comunicaciones. Por lo que las capacidades de contención de los mismos se vuelven crecientes. En la presente ponencia nos enfocamos en alternativas concretas de aprendizaje y desarrollo de tecnología comenzadas y mantenidos desde algunas comunidades y sociedad civil para hacer frente a las amenazas, riesgos y efectos que representan los ataques informáticos y sus economías.","notes":"","audience_level":"All","tag_list":["aprendizaje","ataques informáticos","comunidad"],"rating":100.0},{"name":"Angel Banks","email":"angelicambanks@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/8311/angel_bio.jpg","location":"Atlanta, GA","bio":"Angel Banks specializes in UX strategy and design for enterprise, finance, healthcare, and biotech applications. She currently works as a UX designer at First Data. Angel has a background in project management, product management, and front-end development. Active in the Atlanta tech community, she was a co-organizer of the ATL AngularJS meetup group and is now on the leadership team of Women Who Code Atlanta and a UX and Coding Mentor at General Assembly. ","twitter":"angelmbanks","url":"http://angelbanks.com/","organization":"Women Who Code","shirt_size":"Women's 2XL","title":"When developer must become designer; how to be a one-person UX team","abstract":"This talk will help developers learn the soft skills they need to acquire in order to be \"one-person\" UX team. ","description":"As a developer with limited resources, experience, and time, how can you embrace your inner UX designer? What is UX and why should you care? Is there really a difference between UX and UI? Which design tools should you use? \r\n\r\nIn this session I’ll provide you a UX checklist to take you from developer to designer/developer. ","notes":"","audience_level":"All","tag_list":["ux","ui","toolkit","design","developer","programming"],"rating":100.0},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"​ Overcoming the Challenges of Mentoring","abstract":"Successful mentoring doesn’t just happen, it’s planned. Let’s talk about what mentoring is, what it is not, and what makes for an effective mentorship.","description":"​There is an ongoing mantra within the developer community: that there are far more jobs available then programmers to fill them. Which should be an indication as to the wonderful potential for both business and those learning to code. Yet what often follows such statements are not words of joy but rather a list of frustrations related to the difficulty in finding and retaining enough skilled developers to fill these positions. \r\nThe challenge is not in the number of newbies entering the field but the number who leave because they are not able to bridge the divide between bootcamps, online tutorials, books, videos, etc. to an employable developer who is able to contribute to the team. \r\nKim has years of experience working with learners of various ages in helping them develop the skills they needed to be successful at whatever their chosen goal. She understands that for businesses to be successful, they must develop more effective and efficient ways of recruiting and retaining developers in order to meet organizational benchmarks. \r\nThe developer community is a overwhelmingly generous one and a well designed mentoring or apprenticeship program could be one answer that business leaders and newbies are looking for.\r\n\r\n- The business costs associated with corporate hiring managers inability to recruit and retain skilled workers to fill current and future entry-level positions are increasing (Queen, 2014). \r\n- 89 percent of organizational leaders stated that they are having difficulties filling open positions, which is causing them to either turn down orders, miss key deliverable deadlines or hire individuals from outside of the United States (Aho, 2015). \r\n\r\nAho, K. (2015). The robotics industry: creating jobs, closing the skills gap. Techniques, (7), 22. Retrieved from https://www.acteonline.org/techniques/#.VpMcQq6rR0s\r\n\r\nQueen, J. (2014). Hire power: to close the skills gap, states are teaming up with industries that need, but can't find, qualified workers. State Legislatures, (8), 16. Retrieved from http://www.ncsl.org/bookstore/state-legislatures-magazine.aspx","notes":"Talk ​Details:\r\n1. ​Understanding that there is a difference between personal/professional mentoring and youth/adult mentoring.\r\n2. A clarification of what mentoring is not.\r\n3. An explanation of what mentoring is.\r\n4. A review of factors for effective mentoring for both mentor and mentee.\r\n5. Reasons the development community could benefit from a planned mentoring approach.\r\n6. Several personally designed activities to engage audience participation (depending on the session time-frame)","audience_level":"All","tag_list":["mentoring","junior developers","professional development"],"rating":90.0},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim, a Community Engineer, has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to develop technical people, ideas, organizations, and communities. Her current efforts focus on creating environments that support the sharing of common attitudes, interests, and goals. \r\n\r\nShe is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, KimCrayton1 on Medium.com, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects The ABC’s of Coding, #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"What is Community Engineering?","abstract":"Community Engineering - Is the intentional and skillful effort of creating environments which support the sharing of common attitudes, interests, and goals in order to grow a more diverse and inclusive technology community. ","description":"All too often, efforts for creating more inclusive communities are not successful because of 3 major assumptions held by community members: \r\n1. “They know who we are”\r\n2. “They know what we do”\r\n3. “They will figure it out”\r\n\r\nLet’s explore strategies that can be used to overcome the obstacles related to the 3 assumptions standing in the way of community growth.","notes":"I have years of experience working with diverse communities helping them to better engage and support the initiatives that are meaningful to them. Here are a few testimonials related to my working in various communities (they can be found on my LinkedIn page https://www.linkedin.com/in/kimcrayton/): \r\n\r\n\"Kim is a dynamic community cultivator who brings together two incredible strengths in a rare but essential combination. Firstly, she has a thoroughly infectious personality. Her interactions on stage as well as in person are energizing and inspiring. Secondly, she brings a sharp, effective ability to hone in on what needs to be done and, most importantly, who is going to do it. Kim is a conscientious listener, a gracious mentor and an unparalleled leader with a great heart for developing vital communities. It's my sincerest hope that I will get to work with Kim again!\"\r\n\r\n\"Kim understands that the true challenges of our tech driven world do not lie in finding better coders, but in creating and maintaining a space where a team of creatives can flourish. With her endless energy, motivation and endurance, Kim makes the perfect person to have to get the best out of your team. And with her great network and empathy, Kim has access to a bigger talent pool than anyone I ever met before. I can’t recommend Kim enough, and I’m already looking forward to the time our ways will cross again.\"\r\n\r\n\"Kim is an excellent individual who is very passionate about Tech, as I've come to realize. Her thirst and expertise in meeting people and making connections that matter is second only to her passion and admiration for all things tech.\"","audience_level":"All","tag_list":["community","inclusion","diversity","strategies","technology","open","welcoming"],"rating":70.2},{"name":"gerardsans","email":"gerard.sans@gmail.com","avatar":"https://secure.gravatar.com/avatar/67c5b4074981e4c2b01566d95f9e0a28?s=500","location":"London ☂","bio":"Gerard is very excited about the future of the Web and JavaScript. Always happy Computer Science Engineer and humble Google Developer Expert. He loves to share his learnings by giving talks, trainings and writing about cool technologies. He loves running AngularZone and GraphQL London, mentoring students and giving back to the community.","twitter":"gerardsans","url":"https://medium.com/@gerard.sans","organization":"GraphQL London Community","shirt_size":"Men's XL","title":"Presentando HandsUp: una simple App de codigo libre de preguntas y respuestas para cursos, conferencias o eventos","abstract":"Con esta sencilla Aplicación los asistentes a un evento pueden realizar preguntas que los organizadores pueden usar para paneles o durante charlas sin interrumpir. HandsUp facilita la participación registrando preguntas y votos de los asistentes usando el móvil resultando en una participación mayor.","description":"En esta charla vamos a describir la arquitectura técnica, su uso y como beneficia la dinámica durante cursos, conferencias o eventos. La intención es ayudar a la comunidad con una herramienta gratuita para substituir el gesto de levantar la mano, que no funciona tan bien, durante eventos con muchos asistentes.\r\n\r\nEscribí un articulo explicando como funciona y facilitando acceso al código usando GitHub.\r\nhttps://medium.com/@gerard.sans/building-handsup-an-os-real-time-voting-app-using-graphql-and-react-b2b7dcd0e136\r\n","notes":"Para esta charla necesito mi ordenador con conexión HDMI y acceso a Internet. Tengo la certificación de Google Developer Expert por mis actividades sin animo de lucro para la comunidad: charlas en comunidades locales, ponencias en conferencias en Europa y Estados Unidos, laboratorios y artículos técnicos online.\r\n\r\nhttp://lanyrd.com/profile/gerardsans","audience_level":"Intermediate","tag_list":["apollo client 1.0","react","graphql","javascript"],"rating":80.0},{"name":"George Mandis","email":"george.mandis@gmail.com","avatar":"https://secure.gravatar.com/avatar/251e68e988d4c3b1d05022ffd27ac58e?s=500","location":"A pale blue dot","bio":"George Mandis has been a freelance, full-stack  web developer and consultant to  startups, small businesses, professional sports teams and entrepreneurs for over a decade. Recently he spent a year living as a digital nomad, inadvertently cheated while running a marathon in North Korea and ran a coding bootcamp out of Portland, Oregon. He writes frequently on technology, travel and other things at [his website](http://george.mand.is).","twitter":"georgemandis","url":"http://george.mand.is","organization":"","shirt_size":"Men's M","title":"Make More Than Music with Tiny Computers, JavaScript and MIDI","abstract":"We're living the halcyon days of tiny computers and JavaScript, but MIDI is a technology that's been around for much longer. In this talk we'll explore why it's implementation and prevalence in musical hardware makes for a uniquely intriguing and accessible platform for creative coding.","description":"Tiny computers such as the [RaspberryPi](https://www.raspberrypi.org), [Arduino](https://www.arduino.cc/) and [C.H.I.P.](https://getchip.com/) have finally reached a level of  performance and affordability that makes hardware experimentation accessible to everyone. At the same time, JavaScript has emerged as the lingua franca of web programming and can be found in many places beyond just the browser. \r\n\r\nWhat if I told you there was a mature protocol that's been around since 1983 and was uniquely poised to take advantage of this development?\r\n\r\nWell, wonder no more and [meet MIDI](https://en.wikipedia.org/wiki/MIDI)! \r\n\r\nSitting at convergence of these two things is MIDI — a niche protocol that's been around since 1983 and was originally designed for musical instruments to communicate with one another. It's event-oriented approach to messaging feels right at home in the asynchronous world of JavaScript \u0026 Node, and the prevalence of MIDI support in older musical equipment means you can find unique, hackable and affordable hardware at your local pawnshop or Craig's List.\r\n\r\nThis unlikely tech stack — Tiny Computers + JavaScript + MIDI — can lend itself to creative programming beyond music. George's Talk will explain how to get started, walk through several examples and elaborate on the future of this stack, not only as a platform for experimentation but for education as well.","notes":"About me: I've been a freelance web developer and consultant for over a decade working with startups, small businesses, professional sports teams and entrepreneurs.  Since returning from my year [living as a digital nomad](http://52ltd.com/blog/a-web-developer-on-working-holiday/) I've started teaching programming in various capacities, both to [children](http://saturdayacademy.org) through a supplementary education program here in Portland, Oregon and running a \"coding bootcamp\" through a local [community college](http://www.mhcc.edu/). Prior to all of that I was — and continue to be, albeit in more [part-part-time](http://inkyshado.ws) terms — a musician who has enjoyed dabbling at the intersection of where my career and hobbies meet.\r\n\r\nThrough all these pursuits I feel I'm uniquely suited to give an informative and engaging presentation on the topic as I've outlined it above :)\r\n\r\nYou can watch me give an Ignite presentation about my year as a Digital Nomad here:\r\n\r\n[http://george.mand.is/2016/11/my-ignite-portland-talk/](http://george.mand.is/2016/11/my-ignite-portland-talk/)\r\n\r\nI have two questions:\r\n\r\n- I would like to run a slideshow from my laptop or tablet, but also be able to do a live demonstration onstage using a RasperryPi. If I brought an HDMI switch (Like [this one](https://www.newegg.com/Product/Product.aspx?Item=9SIA8SV3806290\u0026cm_re=HDMI_switch-_-0V5-00M2-001F2-_-Product)) would I be able to switch between my slideshow and the RasperryPi output on the projected screen? Or do you have something like that readily available I could use?\r\n\r\n- Will I be able to include sound in my presentation?","audience_level":"Intermediate","tag_list":["javascript","rasperry pi","node"],"rating":90.0},{"name":"marcos paulo","email":"marcosptf@yahoo.com.br","avatar":"https://secure.gravatar.com/avatar/dda874a39ab072bf18ade8fbc1e75e69?s=500","location":"Unknown","bio":"Master's degree in Software Engineer and Software Developer with 10 years of experience, active contributor to open source projects \r\nlike Netbeans, PHP and Python.\r\nParticipated in projects in finance for banks Itau and Banco ABC.\r\n\r\n+ Open Source contributions\r\nI'm member of NetCat, team of QA in Project from Netbeans :\r\nhttps://netbeans.org/people/155724-marcos-paulo \r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255283\r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255022\r\n\r\nJava plugins to Netbeans IDE using java:\r\nhttp://plugins.netbeans.org/plugin/62803/stackoverflownetbeansplugin\r\nhttp://plugins.netbeans.org/plugin/59448/?show=true\r\nhttps://github.com/marcosptf/YahooSearchToolbar\r\nhttps://github.com/marcosptf/stackoverflowNetbeansPlugin\r\n\r\nI'm so active commiter to php-src core language, writing codes and fixing bugs to this plataform: \r\nhttps://github.com/php/php-src/search?q=marcosptf\r\nhttps://github.com/php/php-src/pulls/marcosptf\r\nhttps://bugs.php.net/search.php?author_email=marcosptf%40yahoo.com.br\u0026cmd=display\u0026status=All\u0026bug_type=All\u0026project=All\r\n\r\nI'm #10 top contributor php-src 2015\r\nhttps://github.com/php/php-src/graphs/contributors?from=2015-01-01\u0026to=2015-12-31\u0026type=c\r\n\r\ncpython contribution, fixing bugs and writing test scripts:\r\nhttp://bugs.python.org/issue24930\r\n\r\nI've won a hacker event develop a web game in javascript\r\nhttps://flic.kr/p/yAZtPN \r\n\r\nTranslate to french language \r\n-i've translate a microframework web site http://respect.github.io/\r\nhttps://github.com/Respect/respect.github.com/commit/fde030abb46af805ba54291b7f2138f83357497f\r\n\r\nTechnical writer in famous blogs\r\nhttp://phpsp.org.br/author/marcosptf/\r\nhttp://www.phpclasses.org/blog/post/386-How-to-Contribute-to-PHP-Development-Writing-phpt-Tests.html\r\nhttps://www.oficinadanet.com.br/autor/428-marcos-paulo\r\n\r\nI'm in list of php7 core developer on Zend oficial blog\r\nhttp://devzone.zend.com/6956/php-7-core-contributors-thankyou/\r\n\r\n\r\n\r\n+ Open Source Key Note\r\n-Tutorial about Flask Python in Python Brazil 11 2015 - Fatec - São José dos Campos/SP\t\t\t\t\r\nhttp://2015.pythonbrasil.org.br/#schedule\t\t\t\t\r\nBuilding microblog with flask\t\t\t\t\r\n\t\t\t\t\r\n-Talk about Flask Python at TDC 2016 - Universidade Anhembi Morumbi - São Paulo/SP\t\t\t\t\r\nhttp://www.thedevelopersconference.com.br/tdc/2016/saopaulo/trilha-python\t\t\t\t\r\nhttp://pt.slideshare.net/tdc-globalcode/tdc2016sp-flask-para-web\t\t\t\t\r\n\t\t\t\t\r\n-Talk about PHP7, C Lang, PHPUNIT at Novatec - São Paulo/SP\t\t\t\t\r\nhttps://twitter.com/phpsp/status/665515671950909440\t\t\t\t\r\n\t\t\t\t\r\n-Talk about how to contribute open sorce projects - PUC/RS - Porto Alegre/RS\r\nhttps://twitter.com/FerPeralesM/status/753681318794371072\t\t\t\t\r\n\t\t\t\t\r\n-Talk about PHPUNIT and RespectPHP at PHP Conference Brazil 2016 - Universidade FIEO - Osasco/SP\t\t\t\t\r\nhttps://www.facebook.com/photo.php?fbid=10208150857914827\u0026set=rpd.720317678\u0026type=3\u0026theater\t\t\t\t\r\n\t\t\t\t\r\n-Talk about Respect microframework at PHP Conference Brazil 2016 - Universidade FIEO - Osasco/SP\t\t\t\t\r\nhttp://phpconference.com.br/trabalho/detalhar-trabalho/id/41\t\t\t\t\r\n\t\t\t\t\r\n-Talk about PHPInternals com PHPUNIT at PHP Conference Brazil 2016 - Universidade FIEO - Osasco/SP\t\t\t\t\r\nhttp://phpconference.com.br/trabalho/detalhar-trabalho/id/42\t\t\t\t\r\n\t\t\t\t\r\n-Talk about how to be a better Software Developer at Mercado Livre - Osasco/SP\t\t\t\t\r\nhttps://www.facebook.com/photo.php?fbid=1342263182493144\u0026set=rpd.720317678\u0026type=3\u0026theater\t\t\t\t\r\n\t\t\t\t\r\n-Talk about  acessibilidade para deficientes visuais com Python - Grupy-SP - Sorocaba/SP\t\t\t\t\r\nhttps://www.meetup.com/Grupy-SP/photos/27666045/\t\t\t\t\r\n\t\t\t\t\r\n-Talk about accessibility for the visually impaired with Python - Grupy-SP - São Paulo/SP\r\nhttps://www.meetup.com/Grupy-SP/photos/27734707/#459590425\t\t\t\t\r\n\r\n","twitter":"marcosptf","url":"","organization":"Locaweb","shirt_size":"Men's L","title":"how to contribute PHP and others open source projects  ","abstract":"Do you want:\n-to contribute to more popular programming language from web?\t\t\t\t\n-to interact with the best software developers around the world?\t\t\t\t\n-grow up your level about software developer?\t\t\t\t\n-to know how a programming language work internally?\n\nThen you can't miss out this presentation !!!","description":"PHP is the more popular web platform made ever, is the better way between your idea and project done.\t\t\t\t\r\nPHP is a open source language and your community is big around the world, but her need your help to keep the PHP \t\t\t\t\r\nbig and strong.\t\t\t\t\r\n\t\t\t\t\r\nMy intension is share my experience like a code contributor in the most important project open source now a days.\t\t\t\t\r\nAnyone can contribute, since write documentation, translate, reporting bugs or write code.\t\t\t\t\r\n\t\t\t\t\r\nAfter this presentation, everyone will be able to contribute with any project open source, specially php-src and write .phpt test code with phpunit.\t\t\t\t\r\n","notes":"+ Follow the topics covered:\t\t\t\t\r\n-\u003ewhat is open source projects\t\t\t\t\r\n-\u003ewhat the open source projects more famous\t\t\t\t\r\n-\u003ephp open source and how to start contribute\t\t\t\t\r\n-\u003ehow php works internally\t\t\t\t\r\n-\u003eknowing PHPQA\t\t\t\t\r\n-\u003ehow to write tests to php-src with phpunit\t\t\t\t\r\n\t\t\t\t\r\n+ Who is this presentation for? \r\nThe proposal this presentation is teach to anyone that want start to contribute a great and mature open source project.\t\t\t\t\r\nNot experience required, if you have write a hello world in any programming language, you are ready! \t\t\t\t\r\n\t\t\t\t\r\n-What's the takeaway for the audience? \r\n-\u003eWhat the PHP project represent to open source community\t\t\t\t\r\n-\u003eHow the PHP works internally\t\t\t\t\r\n-\u003eHow to contribute to PHP project writing code/ reporting bugs/ etc\t\t\t\t\r\n-\u003eKnow interesting and brilliants software developers (network)\t\t\t\t\r\n\t\t\t\t\r\n+Prerequisite knowledge for this presentation \r\n-This information is crucial for attendees. Please describe what skills and knowledge attendees need to have in order to get the most from your talk.\t\t\t\t\r\nIs not required you be a extreme developer like a Linus Torvalds to start to contribute, you do not need to know PHP, C or C++, \t\t\t\t\r\nif you know any other programming language and is junior, intermediate or senior, is enough.\t\t\t\t\r\n\t\t\t\t\r\n+about be and open source contribution\t\t\t\t\r\nI'm Software Developer for 10 years, and i love open source, PHP, Java, Python and Pizza.\t\t\t\t\r\nFollow my recent contributions:\t\t\t\t\r\n\t\t\t\t\r\n+I'm member of NetCat, team of QA in Project from Netbeans :\t\t\t\t\r\nhttps://netbeans.org/people/155724-marcos-paulo\t\t\t\t\r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255283\t\t\t\t\r\nhttps://netbeans.org/bugzilla/show_bug.cgi?id=255022\t\t\t\t\r\n\t\t\t\t\r\n+Java plugins to Netbeans IDE using java:\t\t\t\t\r\nhttp://plugins.netbeans.org/plugin/62803/stackoverflownetbeansplugin\t\t\t\t\r\nhttp://plugins.netbeans.org/plugin/59448/?show=true\t\t\t\t\r\n\t\t\t\t\r\n+I'm so active commiter to php-src core language, writing QA codes and fixing bugs to this plataform:\t\t\t\t\r\nhttps://github.com/php/php-src/search?q=marcosptf\t\t\t\t\r\nhttps://github.com/php/php-src/pulls/marcosptf\t\t\t\t\r\nhttps://bugs.php.net/search.php?author_email=marcosptf%40yahoo.com.br\u0026cmd=display\u0026status=All\u0026bug_type=All\u0026\t\t\t\t\r\nproject=All\t\t\t\t\r\n\t\t\t\t\r\n+I'm #10 top contributor php-src 2015\t\t\t\t\r\nhttps://github.com/php/php-src/graphs/contributors?from=2015-01-01\u0026to=2015-12-31\u0026type=c\t\t\t\t\r\n\t\t\t\t\r\n+cpython contribution, fixing bugs and writing test scripts:\t\t\t\t\r\nhttp://bugs.python.org/issue24930\t\t\t\t\r\n\t\t\t\t\r\n+I've won a hacker event develop a web game in javascript\t\t\t\t\r\nhttps://flic.kr/p/yAZtPN\t\t\t\t\r\n\t\t\t\t\r\n+Keynote python speaker\t\t\t\t\r\n-talk about flask in #pybr11 (Python Brazil Conference 2015)\t\t\t\t\r\nhttps://www.facebook.com/pythonbrasil/photos/a.802266406462553.1073741826.328258703863328/10414012292157\t\t\t\t\r\n35/?type=3\t\t\t\t\r\n\t\t\t\t\r\n-talk about flask in TDC 2016 Anhembi Morumbi\t\t\t\t\r\nhttps://www.facebook.com/PyLadiesSP/photos/a.1566261870344933.1073741843.1469656506672137/1566264470344\t\t\t\t\r\n673/?type=3\u0026theater\t\t\t\t\r\n\t\t\t\t\r\n+Keynote php speaker Novatec\t\t\t\t\r\n-talk about php7 and c language in #phparty7\t\t\t\t\r\nhttps://twitter.com/phpsp/status/665515671950909440\t\t\t\t\r\n-talk about php-src in #FISL2016\t\t\t\t\r\nhttps://twitter.com/FerPeralesM/status/753681318794371072\t\t\t\t\r\n\t\t\t\t\r\n+Translate to french language\t\t\t\t\r\n-i've translate a microframework web site http://respect.github.io/\t\t\t\t\r\nhttps://github.com/Respect/respect.github.com/commit/fde030abb46af805ba54291b7f2138f83357497f\t\t\t\t\r\n\t\t\t\t\r\n+Technical writer in famous brazilian blogs\t\t\t\t\r\nhttp://phpsp.org.br/author/marcosptf/\t\t\t\t\r\nhttp://www.phpclasses.org/blog/post/386-How-to-Contribute-to-PHP-Development-Writing-phpt-Tests.html\t\t\t\t\r\nhttps://www.oficinadanet.com.br/autor/428-marcos-paulo\t\t\t\t\r\n\t\t\t\t\r\n+I'm in list of php7 core developer on Zend oficial blog\t\t\t\t\r\nhttp://devzone.zend.com/6956/php-7-core-contributors-thankyou/\t\t\t\t\r\n\t\t\t\t\r\n+Keynote Fisl17 - How to contribute to PHP\t\t\t\t\r\nhttp://softwarelivre.org/fisl17\t\t\t\t\r\nhttp://hemingway.softwarelivre.org/fisl17/41c/sala41c-high-201607141700.ogv\t\t\t\t\r\n\t\t\t\t\r\n+PHPConference 2016\t\t\t\t\r\nhttp://phpconf.com.br/trabalho/detalhar-trabalho/id/41\t\t\t\t\r\nhttp://phpconf.com.br/trabalho/detalhar-trabalho/id/42\t\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\r\n","audience_level":"All","tag_list":["phpunit","phpinternals","php-src","php"],"rating":80.0},{"name":"Cam Buckingham","email":"cameron.p.buckingham@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/4339/Cam_Buckingham-1898.jpg","location":"Unknown","bio":"Cameron Buckingham is an evangelist and a graduate of the Galvanize full stack immersive program. He previously served in the United States Coast Guard and worked as a production manager for a DC startup, where he discovered his passion for code. After graduating from Galvanize, he worked in big data at American Express to support companies such as Uber and McDonald's to drive a quicker pay-with-points system still in use by customers today.","twitter":"cpbuckingham","url":"https://cpbuckingham.ghost.io/","organization":"no affiliations","shirt_size":"Men's L","title":"How to Commit to your Commits - A 365-day Commit Streak Journey ","abstract":"Over the last year I have completed a 365-day commit streak. I have dedicated myself to exploring and contributing to open-source projects that help to better my understanding of coding. I documented my dedication by writing a blog that accounts for this year-long effort. ","description":"Over the last year I have completed a 365-day commit streak. Github is a tool that many programmers use to collaborate on coding projects. Github currently tracks each user's contributions on a image calendar. That is the platform in which I have used to measure my progress. I have dedicated myself to exploring and contributing to open-source projects that help to better my understanding of coding. I documented my dedication by writing a blog that accounts for this year-long effort. I would like to discuss how to do this and how a little bit of discipline everyday can lead to a great benefits. I come from a non-technical background, so many people who are approaching an interest in technology as a profession will find this very informative. \r\n\r\nSince last year, I have gotten married, started a new job, moved across the country, and bought a home. Many things have changed, one thing remains constant, I have been coding everyday for the last year. I would like the opportunity to discuss the challenges, rewards, and lessons learned about this experience!","notes":"","audience_level":"All","tag_list":["blogging","soft","technical"],"rating":90.0},{"name":"Ilker Güller","email":"ilker.guller.777@gmail.com","avatar":"https://secure.gravatar.com/avatar/fcb8c0a2b99e4f7eada29957c4c65486?s=500","location":"Unknown","bio":"Who am I?\r\n=========\r\n* First Website at 11 (1998)\r\n* 10 Years experience on Development (more as Freelancer)\r\n* Started as FullStack Dev, Now Frontend Dev, Future, who knows..\r\n* JS, C#, PHP, Ruby, Classic ASP,.... Now also elixir\r\n* Trying to be drummer\r\n* Hardcore Gamer\r\n* Food Maniac\r\n\r\nWhy Should you listen to me?\r\n========================\r\n* Excited about new technologies \u0026 web system securities\r\n* I \u003c3 Open Source (and help to grow)\r\n* Experience on startup / small / big projects\r\n* Just check him on Twitter (mostly it looks like bot account)\r\n","twitter":"the_bluescreen","url":"http://ilkerguller.com","organization":"Hungryhouse","shirt_size":"Men's L","title":"Error monitoring on React Native","abstract":"React Native is perfect for the universal projects. You can export to android, ios, even windows and mac os. But if you have one app on 4 platforms, how can you handle the errors? On this talk, we will talk about how to handle errors on react native and how can we get happy users.","description":"React Native is perfect for the universal projects. You can export to android, ios, even windows and mac os. But if you have one app on 4 platforms, how can you handle the errors? On this talk, we will talk about how to handle errors on react native and how can we get happy users.","notes":"","audience_level":"Intermediate","tag_list":["react native","react","mobile apps","error","bug"],"rating":87.5},{"name":"Ozkar L. Garcell","email":"codeshard@openmailbox.org","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/9080/oz.png","location":"Unknown","bio":"Intro\r\n-------------\r\n\r\nMy name is Ozkar L. Garcell and I am a full-stack Web Application Developer and Software Developer.  I am both driven and self-motivated, and I am constantly experimenting with new technologies and techniques. I am very passionate about Web Development, and strive to better myself as a developer, and the development community as a whole.\r\n\r\nInterests\r\n-------------\r\n\r\nI have been studying web development since 2005 and I develop in both Python and PHP, though I primarily use Python. I am experienced in both front and back-end development, and I am proficient in HTML/HTML5, CSS/CSS3, LESS, SASS, XML, JavaScript, jQuery, AJAX, and SQL/MySQL/PostgreSQL, to name a few. Right now I'm trying o make myself a ReactJS/ExpressJS/SequelizeJS jedi.","twitter":"codeshard","url":"http://codeshard.github.io","organization":"CubanTech, GUTL","shirt_size":"Men's M","title":"Better way of creating APIs with Flask and Graphene","abstract":"How to built the simplest and fastest  web APIs using Flask Framework and Graphene.","description":"Get motivated to explore the next generation  faster and reliable web APIs using Flask Framework and Graphene. Make a clean, simple, superfast, flexible web API using two technologies that works great with each other.","notes":"","audience_level":"All","tag_list":["graphene","sequelizejs","expressjs","nodejs","reactjs","flask","django","python"],"rating":87.5},{"name":"Rodrigo Rodriguez","email":"rodrigo.linuxero@gmail.com","avatar":"https://secure.gravatar.com/avatar/7ad85e55eb2797e58e79f88199b8167c?s=500","location":"Unknown","bio":"Venezolano, Tecnólogo con intereses en la Investigación, Diseño e Innovación. Con experiencia en sistemas basados en FOSS, soluciones en redes de comunicación y manufactura de equipos de computación.","twitter":"RodrigoRdgz","url":"","organization":"","shirt_size":"Men's XL","title":"Reciclaje de hardware con GNU/Linux","abstract":"Uno de los problemas que generan el uso de PC es la acumulación de equipos en desuso por su obsolecencia. Las organizaciones no solucionan este problema y se ven obligados a retirarlos.  Aplicando los conceptos de reciclaje al hardware se pueden obtener soluciones sencillas a problemas cotidianos.","description":"Palabras claves: Reciclaje, Software libre, Hardware, GNU/Linux\r\n\r\nIntroducción:\r\nUno de los principales problemas que generan el uso de computadores es la acumulación de equipos en desuso por la falsa creencia de la obsolecencia de los mismos. En muchos casos las organizaciones no encuentran una solución efectiva a este problema y se ven obligados a donar o eliminar estos equipos.   \r\n\r\nSi se aplica los conceptos de reciclaje al hardware se pueden obtener soluciones sencillas a problemas cotidianos. En esta presentación se describe como podemos recuperar equipos en desuso utilizando el sistema operativo GNU/Linux.\r\n\r\nReciclar hardware con Linux\r\n\r\nSe puede decir que el núcleo del sistema es un medio importante para reciclar hardware principalmente porque esta diseñados para correr en equipos con procesadores o arquitecturas sencillas.\r\n\r\nUn ejemplo claro se ve con la plataforma Intel x86, el kernel fue diseñado para un computador con un procesador 386, y esa misma filosofía se mantiene hasta el día de hoy. Es por ello que podemos ejecutar algún kernel moderno en un equipo con un procesador 486.\r\n\r\n¿Por qué reciclar hardware?\r\n\r\nPara aprender, el reciclaje de equipos viejos permite conocer arquitecturas antiguas y a la vez experimentar con servicios y configuraciones.\r\nPara reutilizar recursos, de esta manera se puede ahorrar recursos financieros de la organización y no se acumularía hardware de desecho.\r\nPara resolver un problema, no siempre es necesario invertir una cantidad de dinero para solucionar pequeños problemas si se tiene en cuenta que la organización posee hardware en desuso.\r\n\r\nAlgunas aplicaciones reales basadas en hardware reciclado:\r\n- Router hecho en casa\r\n- Servidor sencillo con pocos clientes\r\n- Estaciones de trabajo\r\n- Terminales de Sistema Distribuidos.","notes":"","audience_level":"All","tag_list":["free software","linux","hardware"],"rating":80.0},{"name":"William Cabrera","email":"cabrerawilliam@gmail.com","avatar":"https://secure.gravatar.com/avatar/fb8985d77e00f7ddc269f2d79047328e?s=500","location":"Unknown","bio":"Soy venezolano, tecnico superior en electrónica, activista por el software libre y el conocimiento libre, pertenezco al capítulo de Wikimedia Venezuela, trabajo en la empresa de ensamblaje de computadoras VIT, trabajé para el proyecto de la distribución nacional Canaima GNU/Linux, me gusta la programación y la electrónica, las películas de ciencia ficción y los libros de divulgación científica y autobiográficos","twitter":"willicab","url":"https://willicab.com.ve","organization":"Personal","shirt_size":"Men's XL","title":"Creación de un sistema de domótica de bajo costo con Raspberry Pi","abstract":"En esta charla se hablará, a través de ejemplos prácticos, como se puede crear un sistema domótico extendible de manera sencilla con tecnologías libres y a bajo costo, se explicará el uso de telegram, programación de bots con lenguajes de alto nivel y electrónica basica todo desde Raspberri Pi","description":"Hasta hace poco más de una década el hecho de tener automatizada la gestión de una edificación que resultara accesible para la mayoría de las personas resultaba impensable, esto debido a los altos costos de implementación y mantenimiento, además de que era necesario equipos especializados para llevar esto a cabo y la programación de dichos equipos era muy compleja, ya que requieren conocimientos de programación en C o Ensamblador en algunos casos.\r\nCon el pasar de los años el precio de los equipos de computación se han abaratado enormemente, además han salido proyectos de micro computadoras que llevan puertos de Entrada/Salida de Propósito General (GPIO por sus siglas en inglés) los cuales permiten controlar otros dispositivos externos a este de manera más sencilla pudiendo usar lenguajes de programación de alto nivel.\r\nUno de los dispositivos mas famosos en la actualidad ha sido el Raspberry Pi, Creado por  por una fundación caritativa en Reino Unido, con el fin inicial de crear una computadora que animara alos niños a aprender informática, pero rápidamente se hizo famoso en una gran comunidad de entusiastas, debido por un lado a su bajo costo y a su gran versatilidad, este es un microcomputador que posee, además de puertos GPIO, puertos USB y de red cableada, lo que lo convierte en uno de los mejores candidatos para crear dispositivos conectados con diferentes propósitos.\r\nEn esta presentación se mostrará como a través de diferentes tecnologías de hardware y Software Libre, puede construirse un sistema domótico que incluya el manejo remoto de diferentes aparatos de la casa o   vigilancia, entre otros temas, usando Raspberry Pi como núcleo del proyecto y el cliente de mensajería Telegram como el cliente de control.","notes":"Para la charla solo necesitaré conexión a internet y una mesa donde colocar los dispositivos que mostraré como ejemplo.\r\nNo se si soy la mejor persona para dar esta charla, pero dada mi experiencia en programación de bots y electrónica, como puede apreciarse en [mi blog](https://blog.willicab.com.ve) y [mi canal de youtube](https://www.youtube.com/channel/UCbBjUsWaxYI0QndSJGTdNZQ), considero que tengo la capacidad suficiente para hablar sobre el tema que he propuesto y en un lenguaje que personas con poco conocimiento del tema puedan entenderlo y comenzar a aplicarlo","audience_level":"Beginner","tag_list":["electrónica","python","php","bots","telegram","domótica","raspberry pi"],"rating":90.0},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"How I Went From Newbie to Open Source Project Owner","abstract":"This is the story of how focusing first on building a community of individuals who care about mentoring has allowed me to turn the idea of mentor matching for people learning to code into a multi-platform open source project.","description":"As someone new to the development community, finding your way around can be a daunting task. There are no defined paths, there's an overwhelming amount of information to ingest, and focus is an almost impossible task. Becoming an active member of open source projects is a great way for newbies to practice their coding skills, develop meaningful community relationships, and become a part of and add value to something bigger than themselves. You only have to look around you to see that individuals thrive when they feel that they have strong relationships and belong to a community.\r\n\r\n1. Understanding the value of the Open Source Community as a newbie\r\n2. Strategies for building community offline and online\r\n3. Brining the community together to work on something that matters to them\r\n","notes":"","audience_level":"All","tag_list":["open source","community","github","newbie","open source project"],"rating":100.0},{"name":"Sergey Bolshchikov","email":"sergey@bolshchikov.net","avatar":"https://secure.gravatar.com/avatar/f0fbd607aab5c6ec39213d2a24fbf339?s=500","location":"Israel","bio":"Team Lead at Wix with great passion to technology and knowledge sharing with 9 years of experience. Co-organizer of YouGottaLoveFrontend Conference and Ember-IL meetup group in Tel Aviv, Israel. \r\nM.Sc. in Information Systems from Technion - Israel Institute of Technology.\r\nhttp://bolshchikov.net ","twitter":"bolshchikov","url":"http://bolshchikov.net","organization":"Wix","shirt_size":"Men's M","title":"How to make a dev advocate from every engineer inside the company","abstract":"Developer relations of a company is not the job of 1 person or a team. It's a responsibility of every engineer in a company. \nIn this talk we will discuss how to promote the dev rel culture though out all developers. How to manage open source projects, encourage and facilitate meetups and more. ","description":"## Issue\r\nDeveloper relations for a IT company is not an easy way. It's a hard problem that solved in many different way, different heuristic approach.\r\nAt Wix, the company with over 500 engineers, we believe it's work not of 1 person or a team. It is a responsibility of everyone.\r\nWe all want to feed proud by the engineering part of a company where we work.\r\nBut how to achieve this? There's no silver bullet though.\r\n\r\n## Solution\r\nIn this talk we will discuss different approaches that worked and not so much at tackling problems:\r\n* open source projects\r\n* speaking at meetups\r\n* organizing workshops\r\n* organizing conferences, and more\r\n\r\nWe will try to answer \"simple\" question: how to convert every engineer to a dev rel of your company.","notes":"","audience_level":"All","tag_list":["developer","meetups","conference","relations","opensource","marketing","devrel"],"rating":87.5},{"name":"Alicia V Carr","email":"fineblkwoman@me.com","avatar":"https://secure.gravatar.com/avatar/8a68115929998ab691a97e356a9e4d74?s=500","location":"Atlanta Georgia","bio":"About Alicia Carr \r\nIn 2012, while standing online at the Apple store waiting to buy my second generation iPad I met a 16-year-old young man. I asked him how did he get the money to buy an iPad and he told me he made a lot of money creating apps. Then I asked him how did he learn how to create an app. He said from youtube and That’s when I turn to my husband and told him “I want to do that.”\r\nI started learning how to code in May 2012. On November 2, 2012 (will never forget the day) my husband told me to quit my job to follow my dream to become a iOS developer.\r\nIt took me 1½ years to learn Objective C. After books and online courses I went through, I started working on the Purple Pocketbook in January 2014 and finished the first version in March 2014. After a month of submitting the app to Apple, it finally got approved on May 2, 2014.\r\nPurple Pocketbook is now Purple Evolution, Inc, (PEVO) the first domestic violence app for the state of Georgia which is now a national app.\r\nEarly 2014 I found and join the group called Women Who Code and I was so excited to be with other ladies wanting to connect and learn from each other that where coders as well. I then started the group within WWCODE called women iOS (WiOS) Developer Group.\r\nI became such an active member of the group over two years working with WWCODE that Erica Stanley Founder/Director of WWCode Atlanta and Alaina Percival CEO/Founder WWCode felt I was an excellent fit for the Director of the Atlanta chapter.\r\nAnd I love Women Who Code it like family.\r\nLiving my dream\r\nI am 53 years old, been married for 35 years, have 3 children and 8 grandchildren. I love life, and I am experiencing my dreams as often and as soon as I can achieve them. My passion in life has been to be an entrepreneur and help others to see life differently with strength and passion.\r\n\r\nWWDC2015 Morning Keynote\r\nhttp://www.apple.com/live/2015-june-event/322cd98d-5368-4c7b-891b-d7dff96b6714/\r\n\r\nI also premiered in Apple newBeginning Video\r\nhttps://www.youtube.com/watch?v=nJt871shTho\r\n\r\n","twitter":"fineblkwoman","url":"http://www.pevo.us","organization":"Women Who Code/ Purple Evolution, Inc. (PEVO)","shirt_size":"Women's 3XL","title":"Is it too late to learn how to program and how being a developer change my life","abstract":"How I became a developer in my 50th. the challenges, the assumption and the victories and how women are not being recognized as an important part of the tech community.","description":" I will talk about how and why I wanted to be an iOS mobile developer at the age of 51. How a 16 year inspire me to learn to code and the challenges I face after becoming an iOS developer being the first self-taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse and how Apple found me and was highlight at WWDC 2015 and 2016 keynote event.  Some people want to believe that people my age are out of touch with technology and as a woman, I have seen the best and the worst in the tech community but I know now that there is a solution at the end of the rainbow.\r\n\r\nI will talk about how early adopters no longer look like the stereotypical hoodie-wearing gadget nerd obsessing over the specs of the latest iPhone—in part because they’re no longer men. Today young women are beating men to technology trends.\r\n\r\nI also will talk about what people don't know is 70% of women are more active on our mobile device than men, women are more active with social media, shopping, photo apps, are more connected to entertainers and play more games on their smartphones. \r\n\r\nWith that being said we the tech community need to open up our arm and embrace the change and think about how women in tech can change the way we see and create apps. \r\n","notes":"Alicia V. Carr is the first self-taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse. She knew she had to utilize her acquired skills as a developer to make a difference.\r\n\r\nAlicia decided to combine her new learned skills and long-time passion for domestic violence prevention to create Purple Evolution, Inc (PEVO) App. \r\n\r\nEarly 2014 I join the group called Women Who Code and is now one of three Director of the Atlanta chapter.\r\n\r\nAlso, Apple has acknowledged me at the WWDC15 and 16 events.\r\nWWDC2015 Morning Keynote - http://www.apple.com/live/2015-june-event/322cd98d-5368-4c7b-891b-d7dff96b6714/\r\nApple newBeginning Video - https://www.youtube.com/watch?v=nJt871shTho\r\n","audience_level":"All","tag_list":["android","ios","women","women in tech","swift","java","javascript","dirversity"],"rating":100.0},{"name":"Kim Crayton","email":"kmcrayton7@yahoo.com","avatar":"https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500","location":"United States","bio":"​Kim has years of experience working with learners of all ages, skill level, and abilities. She is now using her knowledge to help improve technical people, ideas, and organizations. She is the past co-organizer of CodeNewbie-Atlanta, founder of JrDevMentoring, author of the \"Tech Talk For Non-Techies\" blog, and a contributor to the Hypepotamus newsletter. Kim is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Her doctoral study topic is: “Strategies some software development managers use to effectively mentor junior software developers.” She is also working on her passion projects #MentoringMinute, JrDevMentoring.com, @100000Intros and @TheSpectrumCode","twitter":"KimCrayton1","url":"http://www.KimCrayton.com/","organization":"Kim Crayton LLC","shirt_size":"Women's L","title":"Coding Education For All","abstract":"An approach to teaching coding that does not create a false sense of competence.","description":"Long gone are the days when technology was just for the \"nerds\". Today, technology touches every industry and many parts of our personal lives and this trend will only continue to grow. Moving forward, those with the ability to understand the language of technology will be better positioned to take advantage of what lies ahead yet very few non-techies understand or even recognize the shifts that are taking place. As technology continues to move forward, the non-technical continue to fall further behind. In an effort to address this issue, I propose an introduction to technology process that will make becoming technically literate an option for the masses.\r\n\r\nDetails:\r\n1. The importance of being code literate \r\n2. The challenges with current coding education platforms \r\n3. Let’s start with the basics\r\n","notes":"","audience_level":"All","tag_list":["learning to code","newbies","developers","programming","bootcamps"],"rating":100.0},{"name":"Leonel Salazar Videaux","email":"leonel.lordford@gmail.com","avatar":"https://secure.gravatar.com/avatar/c542344b773c50b74c2d9f87f417e234?s=500","location":"Unknown","bio":"Ing. en Ciencias Informáticas;\r\nusuario de GNU/Linux desde 2003;\r\nfundador del GUTL;\r\nparticipante en FLISOL desde 2009;\r\nProgramador;\r\nentusiasta del SWL","twitter":"","url":"http://debianhlg.cubava.cu","organization":"Universidad de Holguín","shirt_size":"Men's M","title":"Experiencias de la comunidad de usuarios de Debian GNU/Linux en la Cuba Profunda","abstract":"Participar en un taller sobre comunidades de Debian GNU/Linux para intercambiar experiencias sobre actividades, uso de recursos, divulgación, buenas prácticas, etc... principalmente desde el enfoque de las ciudades alejadas de los centros de avanzada en materia de tecnología.","description":"Participar en un taller sobre comunidades de Debian GNU/Linux para intercambiar experiencias sobre actividades, uso de recursos, divulgación, buenas prácticas, etc... principalmente desde el enfoque de las ciudades alejadas de los centros de avanzada en materia de tecnología. Pensamos mostrar resultados de trabajos comunitarios realizados en le Oriente de Cuba, en particular Holguín y Manzanillo (provincia Granma), pero con el ánimo de sumar a todos los interesados en cualquiera de las acciones que se puedan realizar.","notes":"","audience_level":"Beginner","tag_list":["taller","debian","comunidad"],"rating":100.0},{"name":"Karina Serfaty","email":"keserfaty@gmail.com","avatar":"https://secure.gravatar.com/avatar/3378b062dd744115ccca258215ebcec6?s=500","location":"Unknown","bio":"Mi nombre es Karina Serfaty soy programadora con un altísimo amor por generar proyectos gratuitos, pequeños y de código abierto. Soy además Licenciada en Ciencias de la Educación y estudiante de Ingeniería Eletrónica. Trabajo hace 5 años contribuyendo a la comunidad docente y, actualmente, coorganizando eventos como Meetup.js en Buenos Aires en donde tenemos por objetivo este año difundir la programación entre grupos más diversos de la sociedad.\r\nAdemás de todo esto todo el piano, me gusta muchísimo la matemática y leer libros de historia.","twitter":"keyserfaty","url":"","organization":"Wingu Ambassador \u0026 Senior Javascript Engineer en Shiftgig","shirt_size":"Women's S","title":"¿Cómo conectar alumnos, maestros y escuelas con software libre?","abstract":"Contaré acerca de mi experiencia capacitando a 600 docentes en el uso de tecnologías que los ayudaron a mejorar su forma de dar clase, su conexión con las familias de los estudiantes y con la comunidad escolar. Presentaré además una herramienta de código abierto que colabora con este propósito.","description":"¿Cómo sería un sistema educativo en que los maestros pudieran saber de cada paso que sus alumnos están haciendo en su aprendizaje? ¿O uno en el que los padres y maestros pudieran estar en contacto todo el tiempo?; ¿o en el que directivos pudieran saber exactamente la situación en sus aulas? \r\nEn esta charla me propongo contarles acerca de nuestra experiencia en Wingu capacitando a 600 docentes de un municipio en el uso de tecnologías gratuitas para escuelas. Estas capacitaciones no fueron solo acerca de cómo usar una herramienta particular, fueron fundamentalmente sobre cómo usar las herramientas que los docentes ya tenían de formas creativas para comunicarse mejor entre ellos y con la comunidad.\r\nAlgunos de los proyectos de los docentes que surgieron después de estas capacitaciones fueron una carpeta compartida entre docentes con planificaciones de clase, documentos compartidos entre padres y maestros para acordar sobre fechas de reuniones, correcciones en tiempo real de los trabajos de los estudiantes y muchísimas más cosas.\r\nAdemás de esta experiencia, aprovecharé para presentar una herramienta gratuita y de código abierto para que los maestros tengan mejor feedback a lo largo de sus clases.","notes":"Los únicos requerimientos técnicos son un cable HDMI y un proyector para mostrar la presentación. Si hubiera conexión a internet (aunque sea de muy baja velocidad) podría invitar a toda la gente de la audiencia a utilizar en tiempo real conmigo la herramienta que me gustaría presentar (esta herramienta está pensada especialmente para conexiones de internet de baja velocidad porque tienen que funcionar en escuelas con los dispositivos móviles que tengan los estudiantes).","audience_level":"All","tag_list":["tecnología","educación"],"rating":100.0},{"name":"Diego Accorinti","email":"diegoacco@gmail.com","avatar":"https://secure.gravatar.com/avatar/bf55ec8b1282a6b54eb55a7c30aa202f?s=500","location":"Unknown","bio":"Soy Diego Accorinti y vivo en Ciudad de Buenos Aires, Argentina. Soy diseñador multimedial y programador. Tengo 35 años.\r\nActualmente trabajo en el Equipo de desarrollo de Huayra gnu/linux, el sistema operativo libre educativo del Programa Conectar Igualdad. Viajo mucho recorriendo provincias y difundiendo software libre y su filosofía.\r\nDesde 2015 soy Coordinador Nacional del capítulo Argentina de FLISOL -festival latinoamericano de instalación de software libre-  con más de cuarenta sedes, se trata de un evento de la comunidad para la comunidad, federal, independiente, plural e inclusivo.","twitter":"diegoacco","url":"http://www.enmanosdenadie.com.ar/diego/","organization":"FLISOL Argentina · Educ.AR (Ministerio de Educación de la Nación Argentina)","shirt_size":"Men's 2XL","title":"Huayra GNU/Linux,  experiencias con software libre en el Programa Conectar Igualdad de Argentina","abstract":"Mi charla es sobre el proceso de desarrollo y la implementación de una distribución de gnu/linux educativa -Huayra GNU/Linux- en el sistema educativo argentino, a través de una política de inclusión digital y social llamada Programa Conectar Igualdad. Aciertos, errores y futuro.","description":"Huayra gnu/linux pudo haber sido la revolución educativa argentina,  en mi charla propongo recorrer los inicios del proyecto que acompaño a otro no menos ambicioso, el Programa Conectar Igualdad entregó 5 millones de computadoras a todos los estudiantes de nivel medio de escuelas públicas en Argentina.  La mayoría de esos equipos salieron con doble-boot  donde Huayra era la opción de software libre, completamente diseñado por un equipo local y adaptado a las necesidades socio-económicas y geográficas de los docentes y estudiantes argentinos.  Planteo analizar aciertos y errores del proyecto,  su alcance y proyección futura.  ","notes":"Diego Accorinti es Coordinador Nacional de FLISOL en Argentina [ www.flisol.org.ar ]","audience_level":"All","tag_list":["tic's","pedagogía","inclusión digital","educación","programa conectar igualdad","huayra gnu/linux"],"rating":100.0},{"name":"Selene Yang - Celine Jacquin","email":"seleneyang1@gmail.com","avatar":"https://secure.gravatar.com/avatar/f5c68815369c7e114111a907eede5eb0?s=500","location":"Unknown","bio":"","twitter":"srta_peperina / mapeadora","url":"https://geochicas.github.io/","organization":"GeoChicas OpenStreetMap","shirt_size":"Women's M","title":"Taller de mapeo con enfoque de género","abstract":"Realizaremos un taller de mapeo con enfoque de género que se dividirá en 3 momentos\n1er: Lluvia de ideas y mapeo conceptual con participantes\n2do: Capacitación con herramientas y presentación de metodología de mapeo.\n3er: Salidas al barrio para mapeo y análisis de datos.","description":"Parte del colectivo de mujeres #GeoChicas, grupo de mujeres latinoamericanas colaboradoras del proyecto de OpenStreetMap, seremos las responsables facilitadoras del taller de mapeo de recursos urbanos. El objetivo es poder explorar y reconocer la diferencia de género, a través del cómo los individuos utilizan, perciben y se proyectan en el espacio que les rodea. El taller está enfocado especialmente en la construcción de cartografías con un enfoque social dirigido hacia las necesidades de las niñas y mujeres en la comunidad, entendiendo los mapas como un reflejo político, social y cultural de quienes lo producen.","notes":"Realización del taller:\r\n-Mini presentaciones sobre la cartografía participativa como motor de planeación urbana y desarrollo equitativo. \r\nDiscusión grupal a modo de Grupo Focal y “mapeo mental” para pre/identificar los elementos del barrio más importantes según esta comunidad de mujeres.\r\n-Presentación de la metodología, y del mapeo con Field Papers, organización de los grupos y la dinámica.\r\n-Mapeo por grupos alrededor de la Escuelita, por sectores geográficos utilizando Field Papers. Los asistentes que cuentan con teléfono móvil y acceso a Internet utilizarán una app móvil de mapeo (OSM-Tracker). Se identificarán los puntos de interés útiles que aporten a un desarrollo integral de la comunidad, así como los “no-lugares” y zonas de inseguridad que afectan especialmente a las mujeres.\r\n\r\nEl taller estará a cargo de Celine Jacquin (@mapeadora) de OSM México, RepuBikla, Selene Yang (@seleneyang) de Nicaragua, Noemi Ticona Angles (@nah_omy) de Bolivia.","audience_level":"All","tag_list":["openstreetmap","genero"],"rating":100.0}]